
const area = [
	{
	  "level": 1,
	  "name": "上海",
	  "id": "310000",
	  "childs": [
	    {
	      "level": 2,
	      "name": "上海市",
	      "id": "310100",
	      "childs": [
	        {
	          "level": 3,
	          "name": "黄浦区",
	          "id": "310101"
	        },
	        {
	          "level": 3,
	          "name": "卢湾区",
	          "id": "310103"
	        },
	        {
	          "level": 3,
	          "name": "徐汇区",
	          "id": "310104"
	        },
	        {
	          "level": 3,
	          "name": "长宁区",
	          "id": "310105"
	        },
	        {
	          "level": 3,
	          "name": "静安区",
	          "id": "310106"
	        },
	        {
	          "level": 3,
	          "name": "普陀区",
	          "id": "310107"
	        },
	        {
	          "level": 3,
	          "name": "闸北区",
	          "id": "310108"
	        },
	        {
	          "level": 3,
	          "name": "虹口区",
	          "id": "310109"
	        },
	        {
	          "level": 3,
	          "name": "杨浦区",
	          "id": "310110"
	        },
	        {
	          "level": 3,
	          "name": "闵行区",
	          "id": "310112"
	        },
	        {
	          "level": 3,
	          "name": "宝山区",
	          "id": "310113"
	        },
	        {
	          "level": 3,
	          "name": "嘉定区",
	          "id": "310114"
	        },
	        {
	          "level": 3,
	          "name": "浦东新区",
	          "id": "310115"
	        },
	        {
	          "level": 3,
	          "name": "金山区",
	          "id": "310116"
	        },
	        {
	          "level": 3,
	          "name": "松江区",
	          "id": "310117"
	        },
	        {
	          "level": 3,
	          "name": "青浦区",
	          "id": "310118"
	        },
	        {
	          "level": 3,
	          "name": "南汇区",
	          "id": "310119"
	        },
	        {
	          "level": 3,
	          "name": "奉贤区",
	          "id": "310120"
	        },
	        {
	          "level": 3,
	          "name": "川沙区",
	          "id": "310152"
	        },
	        {
	          "level": 3,
	          "name": "崇明县",
	          "id": "310230"
	        }
	      ]
	    }
	  ]
	},
  {
    "level": 1,
    "name": "北京",
    "id": "110000",
    "childs": [
      {
        "level": 2,
        "name": "北京市",
        "id": "110100",
        "childs": [
          {
            "level": 3,
            "name": "东城区",
            "id": "110101"
          },
          {
            "level": 3,
            "name": "西城区",
            "id": "110102"
          },
          {
            "level": 3,
            "name": "崇文区",
            "id": "110103"
          },
          {
            "level": 3,
            "name": "宣武区",
            "id": "110104"
          },
          {
            "level": 3,
            "name": "朝阳区",
            "id": "110105"
          },
          {
            "level": 3,
            "name": "丰台区",
            "id": "110106"
          },
          {
            "level": 3,
            "name": "石景山区",
            "id": "110107"
          },
          {
            "level": 3,
            "name": "海淀区",
            "id": "110108"
          },
          {
            "level": 3,
            "name": "门头沟区",
            "id": "110109"
          },
          {
            "level": 3,
            "name": "房山区",
            "id": "110111"
          },
          {
            "level": 3,
            "name": "通州区",
            "id": "110112"
          },
          {
            "level": 3,
            "name": "顺义区",
            "id": "110113"
          },
          {
            "level": 3,
            "name": "昌平区",
            "id": "110114"
          },
          {
            "level": 3,
            "name": "大兴区",
            "id": "110115"
          },
          {
            "level": 3,
            "name": "怀柔区",
            "id": "110116"
          },
          {
            "level": 3,
            "name": "平谷区",
            "id": "110117"
          },
          {
            "level": 3,
            "name": "密云县",
            "id": "110228"
          },
          {
            "level": 3,
            "name": "延庆县",
            "id": "110229"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "天津",
    "id": "120000",
    "childs": [
      {
        "level": 2,
        "name": "天津市",
        "id": "120100",
        "childs": [
          {
            "level": 3,
            "name": "和平区",
            "id": "120101"
          },
          {
            "level": 3,
            "name": "河东区",
            "id": "120102"
          },
          {
            "level": 3,
            "name": "河西区",
            "id": "120103"
          },
          {
            "level": 3,
            "name": "南开区",
            "id": "120104"
          },
          {
            "level": 3,
            "name": "河北区",
            "id": "120105"
          },
          {
            "level": 3,
            "name": "红桥区",
            "id": "120106"
          },
          {
            "level": 3,
            "name": "大港区",
            "id": "120107"
          },
          {
            "level": 3,
            "name": "塘沽区",
            "id": "120108"
          },
          {
            "level": 3,
            "name": "汉沽区",
            "id": "120109"
          },
          {
            "level": 3,
            "name": "东丽区",
            "id": "120110"
          },
          {
            "level": 3,
            "name": "西青区",
            "id": "120111"
          },
          {
            "level": 3,
            "name": "津南区",
            "id": "120112"
          },
          {
            "level": 3,
            "name": "北辰区",
            "id": "120113"
          },
          {
            "level": 3,
            "name": "武清区",
            "id": "120114"
          },
          {
            "level": 3,
            "name": "宝坻区",
            "id": "120115"
          },
          {
            "level": 3,
            "name": "滨海新区",
            "id": "120116"
          },
          {
            "level": 3,
            "name": "宁河县",
            "id": "120221"
          },
          {
            "level": 3,
            "name": "静海县",
            "id": "120223"
          },
          {
            "level": 3,
            "name": "蓟县",
            "id": "120225"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "河北省",
    "id": "130000",
    "childs": [
      {
        "level": 2,
        "name": "石家庄市",
        "id": "130100",
        "childs": [
          {
            "level": 3,
            "name": "长安区",
            "id": "130102"
          },
          {
            "level": 3,
            "name": "桥东区",
            "id": "130103"
          },
          {
            "level": 3,
            "name": "桥西区",
            "id": "130104"
          },
          {
            "level": 3,
            "name": "新华区",
            "id": "130105"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "130106"
          },
          {
            "level": 3,
            "name": "井陉矿区",
            "id": "130107"
          },
          {
            "level": 3,
            "name": "裕华区",
            "id": "130108"
          },
          {
            "level": 3,
            "name": "井陉县",
            "id": "130121"
          },
          {
            "level": 3,
            "name": "正定县",
            "id": "130123"
          },
          {
            "level": 3,
            "name": "栾城县",
            "id": "130124"
          },
          {
            "level": 3,
            "name": "行唐县",
            "id": "130125"
          },
          {
            "level": 3,
            "name": "灵寿县",
            "id": "130126"
          },
          {
            "level": 3,
            "name": "高邑县",
            "id": "130127"
          },
          {
            "level": 3,
            "name": "深泽县",
            "id": "130128"
          },
          {
            "level": 3,
            "name": "赞皇县",
            "id": "130129"
          },
          {
            "level": 3,
            "name": "无极县",
            "id": "130130"
          },
          {
            "level": 3,
            "name": "平山县",
            "id": "130131"
          },
          {
            "level": 3,
            "name": "元氏县",
            "id": "130132"
          },
          {
            "level": 3,
            "name": "赵县",
            "id": "130133"
          },
          {
            "level": 3,
            "name": "辛集市",
            "id": "130181"
          },
          {
            "level": 3,
            "name": "藁城市",
            "id": "130182"
          },
          {
            "level": 3,
            "name": "晋州市",
            "id": "130183"
          },
          {
            "level": 3,
            "name": "新乐市",
            "id": "130184"
          },
          {
            "level": 3,
            "name": "鹿泉市",
            "id": "130185"
          }
        ]
      },
      {
        "level": 2,
        "name": "唐山市",
        "id": "130200",
        "childs": [
          {
            "level": 3,
            "name": "路南区",
            "id": "130202"
          },
          {
            "level": 3,
            "name": "路北区",
            "id": "130203"
          },
          {
            "level": 3,
            "name": "古冶区",
            "id": "130204"
          },
          {
            "level": 3,
            "name": "开平区",
            "id": "130205"
          },
          {
            "level": 3,
            "name": "丰南区",
            "id": "130207"
          },
          {
            "level": 3,
            "name": "丰润区",
            "id": "130208"
          },
          {
            "level": 3,
            "name": "滦县",
            "id": "130223"
          },
          {
            "level": 3,
            "name": "滦南县",
            "id": "130224"
          },
          {
            "level": 3,
            "name": "乐亭县",
            "id": "130225"
          },
          {
            "level": 3,
            "name": "迁西县",
            "id": "130227"
          },
          {
            "level": 3,
            "name": "玉田县",
            "id": "130229"
          },
          {
            "level": 3,
            "name": "曹妃甸区",
            "id": "130230"
          },
          {
            "level": 3,
            "name": "遵化市",
            "id": "130281"
          },
          {
            "level": 3,
            "name": "迁安市",
            "id": "130283"
          }
        ]
      },
      {
        "level": 2,
        "name": "秦皇岛市",
        "id": "130300",
        "childs": [
          {
            "level": 3,
            "name": "海港区",
            "id": "130302"
          },
          {
            "level": 3,
            "name": "山海关区",
            "id": "130303"
          },
          {
            "level": 3,
            "name": "北戴河区",
            "id": "130304"
          },
          {
            "level": 3,
            "name": "青龙满族自治县",
            "id": "130321"
          },
          {
            "level": 3,
            "name": "昌黎县",
            "id": "130322"
          },
          {
            "level": 3,
            "name": "抚宁县",
            "id": "130323"
          },
          {
            "level": 3,
            "name": "卢龙县",
            "id": "130324"
          },
          {
            "level": 3,
            "name": "经济技术开发区",
            "id": "130399"
          }
        ]
      },
      {
        "level": 2,
        "name": "邯郸市",
        "id": "130400",
        "childs": [
          {
            "level": 3,
            "name": "邯山区",
            "id": "130402"
          },
          {
            "level": 3,
            "name": "丛台区",
            "id": "130403"
          },
          {
            "level": 3,
            "name": "复兴区",
            "id": "130404"
          },
          {
            "level": 3,
            "name": "峰峰矿区",
            "id": "130406"
          },
          {
            "level": 3,
            "name": "邯郸县",
            "id": "130421"
          },
          {
            "level": 3,
            "name": "临漳县",
            "id": "130423"
          },
          {
            "level": 3,
            "name": "成安县",
            "id": "130424"
          },
          {
            "level": 3,
            "name": "大名县",
            "id": "130425"
          },
          {
            "level": 3,
            "name": "涉县",
            "id": "130426"
          },
          {
            "level": 3,
            "name": "磁县",
            "id": "130427"
          },
          {
            "level": 3,
            "name": "肥乡县",
            "id": "130428"
          },
          {
            "level": 3,
            "name": "永年县",
            "id": "130429"
          },
          {
            "level": 3,
            "name": "邱县",
            "id": "130430"
          },
          {
            "level": 3,
            "name": "鸡泽县",
            "id": "130431"
          },
          {
            "level": 3,
            "name": "广平县",
            "id": "130432"
          },
          {
            "level": 3,
            "name": "馆陶县",
            "id": "130433"
          },
          {
            "level": 3,
            "name": "魏县",
            "id": "130434"
          },
          {
            "level": 3,
            "name": "曲周县",
            "id": "130435"
          },
          {
            "level": 3,
            "name": "武安市",
            "id": "130481"
          }
        ]
      },
      {
        "level": 2,
        "name": "邢台市",
        "id": "130500",
        "childs": [
          {
            "level": 3,
            "name": "桥东区",
            "id": "130502"
          },
          {
            "level": 3,
            "name": "桥西区",
            "id": "130503"
          },
          {
            "level": 3,
            "name": "邢台县",
            "id": "130521"
          },
          {
            "level": 3,
            "name": "临城县",
            "id": "130522"
          },
          {
            "level": 3,
            "name": "内丘县",
            "id": "130523"
          },
          {
            "level": 3,
            "name": "柏乡县",
            "id": "130524"
          },
          {
            "level": 3,
            "name": "隆尧县",
            "id": "130525"
          },
          {
            "level": 3,
            "name": "任县",
            "id": "130526"
          },
          {
            "level": 3,
            "name": "南和县",
            "id": "130527"
          },
          {
            "level": 3,
            "name": "宁晋县",
            "id": "130528"
          },
          {
            "level": 3,
            "name": "巨鹿县",
            "id": "130529"
          },
          {
            "level": 3,
            "name": "新河县",
            "id": "130530"
          },
          {
            "level": 3,
            "name": "广宗县",
            "id": "130531"
          },
          {
            "level": 3,
            "name": "平乡县",
            "id": "130532"
          },
          {
            "level": 3,
            "name": "威县",
            "id": "130533"
          },
          {
            "level": 3,
            "name": "清河县",
            "id": "130534"
          },
          {
            "level": 3,
            "name": "临西县",
            "id": "130535"
          },
          {
            "level": 3,
            "name": "南宫市",
            "id": "130581"
          },
          {
            "level": 3,
            "name": "沙河市",
            "id": "130582"
          }
        ]
      },
      {
        "level": 2,
        "name": "保定市",
        "id": "130600",
        "childs": [
          {
            "level": 3,
            "name": "新市区",
            "id": "130602"
          },
          {
            "level": 3,
            "name": "北市区",
            "id": "130603"
          },
          {
            "level": 3,
            "name": "南市区",
            "id": "130604"
          },
          {
            "level": 3,
            "name": "满城县",
            "id": "130621"
          },
          {
            "level": 3,
            "name": "清苑县",
            "id": "130622"
          },
          {
            "level": 3,
            "name": "涞水县",
            "id": "130623"
          },
          {
            "level": 3,
            "name": "阜平县",
            "id": "130624"
          },
          {
            "level": 3,
            "name": "徐水县",
            "id": "130625"
          },
          {
            "level": 3,
            "name": "定兴县",
            "id": "130626"
          },
          {
            "level": 3,
            "name": "唐县",
            "id": "130627"
          },
          {
            "level": 3,
            "name": "高阳县",
            "id": "130628"
          },
          {
            "level": 3,
            "name": "容城县",
            "id": "130629"
          },
          {
            "level": 3,
            "name": "涞源县",
            "id": "130630"
          },
          {
            "level": 3,
            "name": "望都县",
            "id": "130631"
          },
          {
            "level": 3,
            "name": "安新县",
            "id": "130632"
          },
          {
            "level": 3,
            "name": "易县",
            "id": "130633"
          },
          {
            "level": 3,
            "name": "曲阳县",
            "id": "130634"
          },
          {
            "level": 3,
            "name": "蠡县",
            "id": "130635"
          },
          {
            "level": 3,
            "name": "顺平县",
            "id": "130636"
          },
          {
            "level": 3,
            "name": "博野县",
            "id": "130637"
          },
          {
            "level": 3,
            "name": "雄县",
            "id": "130638"
          },
          {
            "level": 3,
            "name": "涿州市",
            "id": "130681"
          },
          {
            "level": 3,
            "name": "定州市",
            "id": "130682"
          },
          {
            "level": 3,
            "name": "安国市",
            "id": "130683"
          },
          {
            "level": 3,
            "name": "高碑店市",
            "id": "130684"
          },
          {
            "level": 3,
            "name": "高开区",
            "id": "130698"
          }
        ]
      },
      {
        "level": 2,
        "name": "张家口市",
        "id": "130700",
        "childs": [
          {
            "level": 3,
            "name": "桥东区",
            "id": "130702"
          },
          {
            "level": 3,
            "name": "桥西区",
            "id": "130703"
          },
          {
            "level": 3,
            "name": "宣化区",
            "id": "130705"
          },
          {
            "level": 3,
            "name": "下花园区",
            "id": "130706"
          },
          {
            "level": 3,
            "name": "宣化县",
            "id": "130721"
          },
          {
            "level": 3,
            "name": "张北县",
            "id": "130722"
          },
          {
            "level": 3,
            "name": "康保县",
            "id": "130723"
          },
          {
            "level": 3,
            "name": "沽源县",
            "id": "130724"
          },
          {
            "level": 3,
            "name": "尚义县",
            "id": "130725"
          },
          {
            "level": 3,
            "name": "蔚县",
            "id": "130726"
          },
          {
            "level": 3,
            "name": "阳原县",
            "id": "130727"
          },
          {
            "level": 3,
            "name": "怀安县",
            "id": "130728"
          },
          {
            "level": 3,
            "name": "万全县",
            "id": "130729"
          },
          {
            "level": 3,
            "name": "怀来县",
            "id": "130730"
          },
          {
            "level": 3,
            "name": "涿鹿县",
            "id": "130731"
          },
          {
            "level": 3,
            "name": "赤城县",
            "id": "130732"
          },
          {
            "level": 3,
            "name": "崇礼县",
            "id": "130733"
          }
        ]
      },
      {
        "level": 2,
        "name": "承德市",
        "id": "130800",
        "childs": [
          {
            "level": 3,
            "name": "双桥区",
            "id": "130802"
          },
          {
            "level": 3,
            "name": "双滦区",
            "id": "130803"
          },
          {
            "level": 3,
            "name": "鹰手营子矿区",
            "id": "130804"
          },
          {
            "level": 3,
            "name": "承德县",
            "id": "130821"
          },
          {
            "level": 3,
            "name": "兴隆县",
            "id": "130822"
          },
          {
            "level": 3,
            "name": "平泉县",
            "id": "130823"
          },
          {
            "level": 3,
            "name": "滦平县",
            "id": "130824"
          },
          {
            "level": 3,
            "name": "隆化县",
            "id": "130825"
          },
          {
            "level": 3,
            "name": "丰宁满族自治县",
            "id": "130826"
          },
          {
            "level": 3,
            "name": "宽城满族自治县",
            "id": "130827"
          },
          {
            "level": 3,
            "name": "围场满族蒙古族自治县",
            "id": "130828"
          }
        ]
      },
      {
        "level": 2,
        "name": "沧州市",
        "id": "130900",
        "childs": [
          {
            "level": 3,
            "name": "新华区",
            "id": "130902"
          },
          {
            "level": 3,
            "name": "运河区",
            "id": "130903"
          },
          {
            "level": 3,
            "name": "沧县",
            "id": "130921"
          },
          {
            "level": 3,
            "name": "青县",
            "id": "130922"
          },
          {
            "level": 3,
            "name": "东光县",
            "id": "130923"
          },
          {
            "level": 3,
            "name": "海兴县",
            "id": "130924"
          },
          {
            "level": 3,
            "name": "盐山县",
            "id": "130925"
          },
          {
            "level": 3,
            "name": "肃宁县",
            "id": "130926"
          },
          {
            "level": 3,
            "name": "南皮县",
            "id": "130927"
          },
          {
            "level": 3,
            "name": "吴桥县",
            "id": "130928"
          },
          {
            "level": 3,
            "name": "献县",
            "id": "130929"
          },
          {
            "level": 3,
            "name": "孟村回族自治县",
            "id": "130930"
          },
          {
            "level": 3,
            "name": "泊头市",
            "id": "130981"
          },
          {
            "level": 3,
            "name": "任丘市",
            "id": "130982"
          },
          {
            "level": 3,
            "name": "黄骅市",
            "id": "130983"
          },
          {
            "level": 3,
            "name": "河间市",
            "id": "130984"
          }
        ]
      },
      {
        "level": 2,
        "name": "廊坊市",
        "id": "131000",
        "childs": [
          {
            "level": 3,
            "name": "安次区",
            "id": "131002"
          },
          {
            "level": 3,
            "name": "广阳区",
            "id": "131003"
          },
          {
            "level": 3,
            "name": "固安县",
            "id": "131022"
          },
          {
            "level": 3,
            "name": "永清县",
            "id": "131023"
          },
          {
            "level": 3,
            "name": "香河县",
            "id": "131024"
          },
          {
            "level": 3,
            "name": "大城县",
            "id": "131025"
          },
          {
            "level": 3,
            "name": "文安县",
            "id": "131026"
          },
          {
            "level": 3,
            "name": "大厂回族自治县",
            "id": "131028"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "131051"
          },
          {
            "level": 3,
            "name": "燕郊经济技术开发区",
            "id": "131052"
          },
          {
            "level": 3,
            "name": "霸州市",
            "id": "131081"
          },
          {
            "level": 3,
            "name": "三河市",
            "id": "131082"
          }
        ]
      },
      {
        "level": 2,
        "name": "衡水市",
        "id": "131100",
        "childs": [
          {
            "level": 3,
            "name": "桃城区",
            "id": "131102"
          },
          {
            "level": 3,
            "name": "枣强县",
            "id": "131121"
          },
          {
            "level": 3,
            "name": "武邑县",
            "id": "131122"
          },
          {
            "level": 3,
            "name": "武强县",
            "id": "131123"
          },
          {
            "level": 3,
            "name": "饶阳县",
            "id": "131124"
          },
          {
            "level": 3,
            "name": "安平县",
            "id": "131125"
          },
          {
            "level": 3,
            "name": "故城县",
            "id": "131126"
          },
          {
            "level": 3,
            "name": "景县",
            "id": "131127"
          },
          {
            "level": 3,
            "name": "阜城县",
            "id": "131128"
          },
          {
            "level": 3,
            "name": "冀州市",
            "id": "131181"
          },
          {
            "level": 3,
            "name": "深州市",
            "id": "131182"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "山西省",
    "id": "140000",
    "childs": [
      {
        "level": 2,
        "name": "太原市",
        "id": "140100",
        "childs": [
          {
            "level": 3,
            "name": "小店区",
            "id": "140105"
          },
          {
            "level": 3,
            "name": "迎泽区",
            "id": "140106"
          },
          {
            "level": 3,
            "name": "杏花岭区",
            "id": "140107"
          },
          {
            "level": 3,
            "name": "尖草坪区",
            "id": "140108"
          },
          {
            "level": 3,
            "name": "万柏林区",
            "id": "140109"
          },
          {
            "level": 3,
            "name": "晋源区",
            "id": "140110"
          },
          {
            "level": 3,
            "name": "清徐县",
            "id": "140121"
          },
          {
            "level": 3,
            "name": "阳曲县",
            "id": "140122"
          },
          {
            "level": 3,
            "name": "娄烦县",
            "id": "140123"
          },
          {
            "level": 3,
            "name": "古交市",
            "id": "140181"
          }
        ]
      },
      {
        "level": 2,
        "name": "大同市",
        "id": "140200",
        "childs": [
          {
            "level": 3,
            "name": "城区",
            "id": "140202"
          },
          {
            "level": 3,
            "name": "矿区",
            "id": "140203"
          },
          {
            "level": 3,
            "name": "南郊区",
            "id": "140211"
          },
          {
            "level": 3,
            "name": "新荣区",
            "id": "140212"
          },
          {
            "level": 3,
            "name": "阳高县",
            "id": "140221"
          },
          {
            "level": 3,
            "name": "天镇县",
            "id": "140222"
          },
          {
            "level": 3,
            "name": "广灵县",
            "id": "140223"
          },
          {
            "level": 3,
            "name": "灵丘县",
            "id": "140224"
          },
          {
            "level": 3,
            "name": "浑源县",
            "id": "140225"
          },
          {
            "level": 3,
            "name": "左云县",
            "id": "140226"
          },
          {
            "level": 3,
            "name": "大同县",
            "id": "140227"
          }
        ]
      },
      {
        "level": 2,
        "name": "阳泉市",
        "id": "140300",
        "childs": [
          {
            "level": 3,
            "name": "城区",
            "id": "140302"
          },
          {
            "level": 3,
            "name": "矿区",
            "id": "140303"
          },
          {
            "level": 3,
            "name": "郊区",
            "id": "140311"
          },
          {
            "level": 3,
            "name": "平定县",
            "id": "140321"
          },
          {
            "level": 3,
            "name": "盂县",
            "id": "140322"
          }
        ]
      },
      {
        "level": 2,
        "name": "长治市",
        "id": "140400",
        "childs": [
          {
            "level": 3,
            "name": "长治县",
            "id": "140421"
          },
          {
            "level": 3,
            "name": "襄垣县",
            "id": "140423"
          },
          {
            "level": 3,
            "name": "屯留县",
            "id": "140424"
          },
          {
            "level": 3,
            "name": "平顺县",
            "id": "140425"
          },
          {
            "level": 3,
            "name": "黎城县",
            "id": "140426"
          },
          {
            "level": 3,
            "name": "壶关县",
            "id": "140427"
          },
          {
            "level": 3,
            "name": "长子县",
            "id": "140428"
          },
          {
            "level": 3,
            "name": "武乡县",
            "id": "140429"
          },
          {
            "level": 3,
            "name": "沁县",
            "id": "140430"
          },
          {
            "level": 3,
            "name": "沁源县",
            "id": "140431"
          },
          {
            "level": 3,
            "name": "潞城市",
            "id": "140481"
          },
          {
            "level": 3,
            "name": "城区",
            "id": "140482"
          },
          {
            "level": 3,
            "name": "郊区",
            "id": "140483"
          },
          {
            "level": 3,
            "name": "高新区",
            "id": "140484"
          }
        ]
      },
      {
        "level": 2,
        "name": "晋城市",
        "id": "140500",
        "childs": [
          {
            "level": 3,
            "name": "城区",
            "id": "140502"
          },
          {
            "level": 3,
            "name": "沁水县",
            "id": "140521"
          },
          {
            "level": 3,
            "name": "阳城县",
            "id": "140522"
          },
          {
            "level": 3,
            "name": "陵川县",
            "id": "140524"
          },
          {
            "level": 3,
            "name": "泽州县",
            "id": "140525"
          },
          {
            "level": 3,
            "name": "高平市",
            "id": "140581"
          }
        ]
      },
      {
        "level": 2,
        "name": "朔州市",
        "id": "140600",
        "childs": [
          {
            "level": 3,
            "name": "朔城区",
            "id": "140602"
          },
          {
            "level": 3,
            "name": "平鲁区",
            "id": "140603"
          },
          {
            "level": 3,
            "name": "山阴县",
            "id": "140621"
          },
          {
            "level": 3,
            "name": "应县",
            "id": "140622"
          },
          {
            "level": 3,
            "name": "右玉县",
            "id": "140623"
          },
          {
            "level": 3,
            "name": "怀仁县",
            "id": "140624"
          }
        ]
      },
      {
        "level": 2,
        "name": "晋中市",
        "id": "140700",
        "childs": [
          {
            "level": 3,
            "name": "榆次区",
            "id": "140702"
          },
          {
            "level": 3,
            "name": "榆社县",
            "id": "140721"
          },
          {
            "level": 3,
            "name": "左权县",
            "id": "140722"
          },
          {
            "level": 3,
            "name": "和顺县",
            "id": "140723"
          },
          {
            "level": 3,
            "name": "昔阳县",
            "id": "140724"
          },
          {
            "level": 3,
            "name": "寿阳县",
            "id": "140725"
          },
          {
            "level": 3,
            "name": "太谷县",
            "id": "140726"
          },
          {
            "level": 3,
            "name": "祁县",
            "id": "140727"
          },
          {
            "level": 3,
            "name": "平遥县",
            "id": "140728"
          },
          {
            "level": 3,
            "name": "灵石县",
            "id": "140729"
          },
          {
            "level": 3,
            "name": "介休市",
            "id": "140781"
          }
        ]
      },
      {
        "level": 2,
        "name": "运城市",
        "id": "140800",
        "childs": [
          {
            "level": 3,
            "name": "盐湖区",
            "id": "140802"
          },
          {
            "level": 3,
            "name": "临猗县",
            "id": "140821"
          },
          {
            "level": 3,
            "name": "万荣县",
            "id": "140822"
          },
          {
            "level": 3,
            "name": "闻喜县",
            "id": "140823"
          },
          {
            "level": 3,
            "name": "稷山县",
            "id": "140824"
          },
          {
            "level": 3,
            "name": "新绛县",
            "id": "140825"
          },
          {
            "level": 3,
            "name": "绛县",
            "id": "140826"
          },
          {
            "level": 3,
            "name": "垣曲县",
            "id": "140827"
          },
          {
            "level": 3,
            "name": "夏县",
            "id": "140828"
          },
          {
            "level": 3,
            "name": "平陆县",
            "id": "140829"
          },
          {
            "level": 3,
            "name": "芮城县",
            "id": "140830"
          },
          {
            "level": 3,
            "name": "风陵渡经济开发区",
            "id": "140831"
          },
          {
            "level": 3,
            "name": "永济市",
            "id": "140881"
          },
          {
            "level": 3,
            "name": "河津市",
            "id": "140882"
          }
        ]
      },
      {
        "level": 2,
        "name": "忻州市",
        "id": "140900",
        "childs": [
          {
            "level": 3,
            "name": "忻府区",
            "id": "140902"
          },
          {
            "level": 3,
            "name": "定襄县",
            "id": "140921"
          },
          {
            "level": 3,
            "name": "五台县",
            "id": "140922"
          },
          {
            "level": 3,
            "name": "代县",
            "id": "140923"
          },
          {
            "level": 3,
            "name": "繁峙县",
            "id": "140924"
          },
          {
            "level": 3,
            "name": "宁武县",
            "id": "140925"
          },
          {
            "level": 3,
            "name": "静乐县",
            "id": "140926"
          },
          {
            "level": 3,
            "name": "神池县",
            "id": "140927"
          },
          {
            "level": 3,
            "name": "五寨县",
            "id": "140928"
          },
          {
            "level": 3,
            "name": "岢岚县",
            "id": "140929"
          },
          {
            "level": 3,
            "name": "河曲县",
            "id": "140930"
          },
          {
            "level": 3,
            "name": "保德县",
            "id": "140931"
          },
          {
            "level": 3,
            "name": "偏关县",
            "id": "140932"
          },
          {
            "level": 3,
            "name": "原平市",
            "id": "140981"
          }
        ]
      },
      {
        "level": 2,
        "name": "临汾市",
        "id": "141000",
        "childs": [
          {
            "level": 3,
            "name": "尧都区",
            "id": "141002"
          },
          {
            "level": 3,
            "name": "曲沃县",
            "id": "141021"
          },
          {
            "level": 3,
            "name": "翼城县",
            "id": "141022"
          },
          {
            "level": 3,
            "name": "襄汾县",
            "id": "141023"
          },
          {
            "level": 3,
            "name": "洪洞县",
            "id": "141024"
          },
          {
            "level": 3,
            "name": "古县",
            "id": "141025"
          },
          {
            "level": 3,
            "name": "安泽县",
            "id": "141026"
          },
          {
            "level": 3,
            "name": "浮山县",
            "id": "141027"
          },
          {
            "level": 3,
            "name": "吉县",
            "id": "141028"
          },
          {
            "level": 3,
            "name": "乡宁县",
            "id": "141029"
          },
          {
            "level": 3,
            "name": "大宁县",
            "id": "141030"
          },
          {
            "level": 3,
            "name": "隰县",
            "id": "141031"
          },
          {
            "level": 3,
            "name": "永和县",
            "id": "141032"
          },
          {
            "level": 3,
            "name": "蒲县",
            "id": "141033"
          },
          {
            "level": 3,
            "name": "汾西县",
            "id": "141034"
          },
          {
            "level": 3,
            "name": "侯马市",
            "id": "141081"
          },
          {
            "level": 3,
            "name": "霍州市",
            "id": "141082"
          }
        ]
      },
      {
        "level": 2,
        "name": "吕梁市",
        "id": "141100",
        "childs": [
          {
            "level": 3,
            "name": "离石区",
            "id": "141102"
          },
          {
            "level": 3,
            "name": "文水县",
            "id": "141121"
          },
          {
            "level": 3,
            "name": "交城县",
            "id": "141122"
          },
          {
            "level": 3,
            "name": "兴县",
            "id": "141123"
          },
          {
            "level": 3,
            "name": "临县",
            "id": "141124"
          },
          {
            "level": 3,
            "name": "柳林县",
            "id": "141125"
          },
          {
            "level": 3,
            "name": "石楼县",
            "id": "141126"
          },
          {
            "level": 3,
            "name": "岚县",
            "id": "141127"
          },
          {
            "level": 3,
            "name": "方山县",
            "id": "141128"
          },
          {
            "level": 3,
            "name": "中阳县",
            "id": "141129"
          },
          {
            "level": 3,
            "name": "交口县",
            "id": "141130"
          },
          {
            "level": 3,
            "name": "孝义市",
            "id": "141181"
          },
          {
            "level": 3,
            "name": "汾阳市",
            "id": "141182"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "内蒙古自治区",
    "id": "150000",
    "childs": [
      {
        "level": 2,
        "name": "呼和浩特市",
        "id": "150100",
        "childs": [
          {
            "level": 3,
            "name": "新城区",
            "id": "150102"
          },
          {
            "level": 3,
            "name": "回民区",
            "id": "150103"
          },
          {
            "level": 3,
            "name": "玉泉区",
            "id": "150104"
          },
          {
            "level": 3,
            "name": "赛罕区",
            "id": "150105"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "150106"
          },
          {
            "level": 3,
            "name": "土默特左旗",
            "id": "150121"
          },
          {
            "level": 3,
            "name": "托克托县",
            "id": "150122"
          },
          {
            "level": 3,
            "name": "和林格尔县",
            "id": "150123"
          },
          {
            "level": 3,
            "name": "清水河县",
            "id": "150124"
          },
          {
            "level": 3,
            "name": "武川县",
            "id": "150125"
          }
        ]
      },
      {
        "level": 2,
        "name": "包头市",
        "id": "150200",
        "childs": [
          {
            "level": 3,
            "name": "东河区",
            "id": "150202"
          },
          {
            "level": 3,
            "name": "昆都仑区",
            "id": "150203"
          },
          {
            "level": 3,
            "name": "青山区",
            "id": "150204"
          },
          {
            "level": 3,
            "name": "石拐区",
            "id": "150205"
          },
          {
            "level": 3,
            "name": "白云鄂博矿区",
            "id": "150206"
          },
          {
            "level": 3,
            "name": "九原区",
            "id": "150207"
          },
          {
            "level": 3,
            "name": "土默特右旗",
            "id": "150221"
          },
          {
            "level": 3,
            "name": "固阳县",
            "id": "150222"
          },
          {
            "level": 3,
            "name": "达尔罕茂明安联合旗",
            "id": "150223"
          }
        ]
      },
      {
        "level": 2,
        "name": "乌海市",
        "id": "150300",
        "childs": [
          {
            "level": 3,
            "name": "海勃湾区",
            "id": "150302"
          },
          {
            "level": 3,
            "name": "海南区",
            "id": "150303"
          },
          {
            "level": 3,
            "name": "乌达区",
            "id": "150304"
          }
        ]
      },
      {
        "level": 2,
        "name": "赤峰市",
        "id": "150400",
        "childs": [
          {
            "level": 3,
            "name": "红山区",
            "id": "150402"
          },
          {
            "level": 3,
            "name": "元宝山区",
            "id": "150403"
          },
          {
            "level": 3,
            "name": "松山区",
            "id": "150404"
          },
          {
            "level": 3,
            "name": "阿鲁科尔沁旗",
            "id": "150421"
          },
          {
            "level": 3,
            "name": "巴林左旗",
            "id": "150422"
          },
          {
            "level": 3,
            "name": "巴林右旗",
            "id": "150423"
          },
          {
            "level": 3,
            "name": "林西县",
            "id": "150424"
          },
          {
            "level": 3,
            "name": "克什克腾旗",
            "id": "150425"
          },
          {
            "level": 3,
            "name": "翁牛特旗",
            "id": "150426"
          },
          {
            "level": 3,
            "name": "喀喇沁旗",
            "id": "150428"
          },
          {
            "level": 3,
            "name": "宁城县",
            "id": "150429"
          },
          {
            "level": 3,
            "name": "敖汉旗",
            "id": "150430"
          }
        ]
      },
      {
        "level": 2,
        "name": "通辽市",
        "id": "150500",
        "childs": [
          {
            "level": 3,
            "name": "科尔沁区",
            "id": "150502"
          },
          {
            "level": 3,
            "name": "科尔沁左翼中旗",
            "id": "150521"
          },
          {
            "level": 3,
            "name": "科尔沁左翼后旗",
            "id": "150522"
          },
          {
            "level": 3,
            "name": "开鲁县",
            "id": "150523"
          },
          {
            "level": 3,
            "name": "库伦旗",
            "id": "150524"
          },
          {
            "level": 3,
            "name": "奈曼旗",
            "id": "150525"
          },
          {
            "level": 3,
            "name": "扎鲁特旗",
            "id": "150526"
          },
          {
            "level": 3,
            "name": "霍林郭勒市",
            "id": "150581"
          }
        ]
      },
      {
        "level": 2,
        "name": "鄂尔多斯市",
        "id": "150600",
        "childs": [
          {
            "level": 3,
            "name": "东胜区",
            "id": "150602"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "150603"
          },
          {
            "level": 3,
            "name": "达拉特旗",
            "id": "150621"
          },
          {
            "level": 3,
            "name": "准格尔旗",
            "id": "150622"
          },
          {
            "level": 3,
            "name": "鄂托克前旗",
            "id": "150623"
          },
          {
            "level": 3,
            "name": "鄂托克旗",
            "id": "150624"
          },
          {
            "level": 3,
            "name": "杭锦旗",
            "id": "150625"
          },
          {
            "level": 3,
            "name": "乌审旗",
            "id": "150626"
          },
          {
            "level": 3,
            "name": "伊金霍洛旗",
            "id": "150627"
          }
        ]
      },
      {
        "level": 2,
        "name": "呼伦贝尔市",
        "id": "150700",
        "childs": [
          {
            "level": 3,
            "name": "海拉尔区",
            "id": "150702"
          },
          {
            "level": 3,
            "name": "扎赉诺尔区",
            "id": "150703"
          },
          {
            "level": 3,
            "name": "阿荣旗",
            "id": "150721"
          },
          {
            "level": 3,
            "name": "莫力达瓦达斡尔族自治旗",
            "id": "150722"
          },
          {
            "level": 3,
            "name": "鄂伦春自治旗",
            "id": "150723"
          },
          {
            "level": 3,
            "name": "鄂温克族自治旗",
            "id": "150724"
          },
          {
            "level": 3,
            "name": "陈巴尔虎旗",
            "id": "150725"
          },
          {
            "level": 3,
            "name": "新巴尔虎左旗",
            "id": "150726"
          },
          {
            "level": 3,
            "name": "新巴尔虎右旗",
            "id": "150727"
          },
          {
            "level": 3,
            "name": "满洲里市",
            "id": "150781"
          },
          {
            "level": 3,
            "name": "牙克石市",
            "id": "150782"
          },
          {
            "level": 3,
            "name": "扎兰屯市",
            "id": "150783"
          },
          {
            "level": 3,
            "name": "额尔古纳市",
            "id": "150784"
          },
          {
            "level": 3,
            "name": "根河市",
            "id": "150785"
          }
        ]
      },
      {
        "level": 2,
        "name": "巴彦淖尔市",
        "id": "150800",
        "childs": [
          {
            "level": 3,
            "name": "临河区",
            "id": "150802"
          },
          {
            "level": 3,
            "name": "五原县",
            "id": "150821"
          },
          {
            "level": 3,
            "name": "磴口县",
            "id": "150822"
          },
          {
            "level": 3,
            "name": "乌拉特前旗",
            "id": "150823"
          },
          {
            "level": 3,
            "name": "乌拉特中旗",
            "id": "150824"
          },
          {
            "level": 3,
            "name": "乌拉特后旗",
            "id": "150825"
          },
          {
            "level": 3,
            "name": "杭锦后旗",
            "id": "150826"
          }
        ]
      },
      {
        "level": 2,
        "name": "乌兰察布市",
        "id": "150900",
        "childs": [
          {
            "level": 3,
            "name": "集宁区",
            "id": "150902"
          },
          {
            "level": 3,
            "name": "卓资县",
            "id": "150921"
          },
          {
            "level": 3,
            "name": "化德县",
            "id": "150922"
          },
          {
            "level": 3,
            "name": "商都县",
            "id": "150923"
          },
          {
            "level": 3,
            "name": "兴和县",
            "id": "150924"
          },
          {
            "level": 3,
            "name": "凉城县",
            "id": "150925"
          },
          {
            "level": 3,
            "name": "察哈尔右翼前旗",
            "id": "150926"
          },
          {
            "level": 3,
            "name": "察哈尔右翼中旗",
            "id": "150927"
          },
          {
            "level": 3,
            "name": "察哈尔右翼后旗",
            "id": "150928"
          },
          {
            "level": 3,
            "name": "四子王旗",
            "id": "150929"
          },
          {
            "level": 3,
            "name": "丰镇市",
            "id": "150981"
          }
        ]
      },
      {
        "level": 2,
        "name": "兴安盟",
        "id": "152200",
        "childs": [
          {
            "level": 3,
            "name": "乌兰浩特市",
            "id": "152201"
          },
          {
            "level": 3,
            "name": "阿尔山市",
            "id": "152202"
          },
          {
            "level": 3,
            "name": "科尔沁右翼前旗",
            "id": "152221"
          },
          {
            "level": 3,
            "name": "科尔沁右翼中旗",
            "id": "152222"
          },
          {
            "level": 3,
            "name": "扎赉特旗",
            "id": "152223"
          },
          {
            "level": 3,
            "name": "突泉县",
            "id": "152224"
          }
        ]
      },
      {
        "level": 2,
        "name": "锡林郭勒盟",
        "id": "152500",
        "childs": [
          {
            "level": 3,
            "name": "二连浩特市",
            "id": "152501"
          },
          {
            "level": 3,
            "name": "锡林浩特市",
            "id": "152502"
          },
          {
            "level": 3,
            "name": "阿巴嘎旗",
            "id": "152522"
          },
          {
            "level": 3,
            "name": "苏尼特左旗",
            "id": "152523"
          },
          {
            "level": 3,
            "name": "苏尼特右旗",
            "id": "152524"
          },
          {
            "level": 3,
            "name": "东乌珠穆沁旗",
            "id": "152525"
          },
          {
            "level": 3,
            "name": "西乌珠穆沁旗",
            "id": "152526"
          },
          {
            "level": 3,
            "name": "太仆寺旗",
            "id": "152527"
          },
          {
            "level": 3,
            "name": "镶黄旗",
            "id": "152528"
          },
          {
            "level": 3,
            "name": "正镶白旗",
            "id": "152529"
          },
          {
            "level": 3,
            "name": "正蓝旗",
            "id": "152530"
          },
          {
            "level": 3,
            "name": "多伦县",
            "id": "152531"
          }
        ]
      },
      {
        "level": 2,
        "name": "阿拉善盟",
        "id": "152900",
        "childs": [
          {
            "level": 3,
            "name": "阿拉善左旗",
            "id": "152921"
          },
          {
            "level": 3,
            "name": "阿拉善右旗",
            "id": "152922"
          },
          {
            "level": 3,
            "name": "额济纳旗",
            "id": "152923"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "辽宁省",
    "id": "210000",
    "childs": [
      {
        "level": 2,
        "name": "沈阳市",
        "id": "210100",
        "childs": [
          {
            "level": 3,
            "name": "和平区",
            "id": "210102"
          },
          {
            "level": 3,
            "name": "沈河区",
            "id": "210103"
          },
          {
            "level": 3,
            "name": "大东区",
            "id": "210104"
          },
          {
            "level": 3,
            "name": "皇姑区",
            "id": "210105"
          },
          {
            "level": 3,
            "name": "铁西区",
            "id": "210106"
          },
          {
            "level": 3,
            "name": "苏家屯区",
            "id": "210111"
          },
          {
            "level": 3,
            "name": "东陵区",
            "id": "210112"
          },
          {
            "level": 3,
            "name": "新城子区",
            "id": "210113"
          },
          {
            "level": 3,
            "name": "于洪区",
            "id": "210114"
          },
          {
            "level": 3,
            "name": "辽中县",
            "id": "210122"
          },
          {
            "level": 3,
            "name": "康平县",
            "id": "210123"
          },
          {
            "level": 3,
            "name": "法库县",
            "id": "210124"
          },
          {
            "level": 3,
            "name": "新民市",
            "id": "210181"
          },
          {
            "level": 3,
            "name": "浑南新区",
            "id": "210182"
          },
          {
            "level": 3,
            "name": "张士开发区",
            "id": "210183"
          },
          {
            "level": 3,
            "name": "沈北新区",
            "id": "210184"
          }
        ]
      },
      {
        "level": 2,
        "name": "大连市",
        "id": "210200",
        "childs": [
          {
            "level": 3,
            "name": "中山区",
            "id": "210202"
          },
          {
            "level": 3,
            "name": "西岗区",
            "id": "210203"
          },
          {
            "level": 3,
            "name": "沙河口区",
            "id": "210204"
          },
          {
            "level": 3,
            "name": "甘井子区",
            "id": "210211"
          },
          {
            "level": 3,
            "name": "旅顺口区",
            "id": "210212"
          },
          {
            "level": 3,
            "name": "金州区",
            "id": "210213"
          },
          {
            "level": 3,
            "name": "长海县",
            "id": "210224"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "210251"
          },
          {
            "level": 3,
            "name": "瓦房店市",
            "id": "210281"
          },
          {
            "level": 3,
            "name": "普兰店市",
            "id": "210282"
          },
          {
            "level": 3,
            "name": "庄河市",
            "id": "210283"
          },
          {
            "level": 3,
            "name": "岭前区",
            "id": "210297"
          }
        ]
      },
      {
        "level": 2,
        "name": "鞍山市",
        "id": "210300",
        "childs": [
          {
            "level": 3,
            "name": "铁东区",
            "id": "210302"
          },
          {
            "level": 3,
            "name": "铁西区",
            "id": "210303"
          },
          {
            "level": 3,
            "name": "立山区",
            "id": "210304"
          },
          {
            "level": 3,
            "name": "千山区",
            "id": "210311"
          },
          {
            "level": 3,
            "name": "台安县",
            "id": "210321"
          },
          {
            "level": 3,
            "name": "岫岩满族自治县",
            "id": "210323"
          },
          {
            "level": 3,
            "name": "高新区",
            "id": "210351"
          },
          {
            "level": 3,
            "name": "海城市",
            "id": "210381"
          }
        ]
      },
      {
        "level": 2,
        "name": "抚顺市",
        "id": "210400",
        "childs": [
          {
            "level": 3,
            "name": "新抚区",
            "id": "210402"
          },
          {
            "level": 3,
            "name": "东洲区",
            "id": "210403"
          },
          {
            "level": 3,
            "name": "望花区",
            "id": "210404"
          },
          {
            "level": 3,
            "name": "顺城区",
            "id": "210411"
          },
          {
            "level": 3,
            "name": "抚顺县",
            "id": "210421"
          },
          {
            "level": 3,
            "name": "新宾满族自治县",
            "id": "210422"
          },
          {
            "level": 3,
            "name": "清原满族自治县",
            "id": "210423"
          }
        ]
      },
      {
        "level": 2,
        "name": "本溪市",
        "id": "210500",
        "childs": [
          {
            "level": 3,
            "name": "平山区",
            "id": "210502"
          },
          {
            "level": 3,
            "name": "溪湖区",
            "id": "210503"
          },
          {
            "level": 3,
            "name": "明山区",
            "id": "210504"
          },
          {
            "level": 3,
            "name": "南芬区",
            "id": "210505"
          },
          {
            "level": 3,
            "name": "本溪满族自治县",
            "id": "210521"
          },
          {
            "level": 3,
            "name": "桓仁满族自治县",
            "id": "210522"
          }
        ]
      },
      {
        "level": 2,
        "name": "丹东市",
        "id": "210600",
        "childs": [
          {
            "level": 3,
            "name": "元宝区",
            "id": "210602"
          },
          {
            "level": 3,
            "name": "振兴区",
            "id": "210603"
          },
          {
            "level": 3,
            "name": "振安区",
            "id": "210604"
          },
          {
            "level": 3,
            "name": "宽甸满族自治县",
            "id": "210624"
          },
          {
            "level": 3,
            "name": "东港市",
            "id": "210681"
          },
          {
            "level": 3,
            "name": "凤城市",
            "id": "210682"
          }
        ]
      },
      {
        "level": 2,
        "name": "锦州市",
        "id": "210700",
        "childs": [
          {
            "level": 3,
            "name": "古塔区",
            "id": "210702"
          },
          {
            "level": 3,
            "name": "凌河区",
            "id": "210703"
          },
          {
            "level": 3,
            "name": "太和区",
            "id": "210711"
          },
          {
            "level": 3,
            "name": "黑山县",
            "id": "210726"
          },
          {
            "level": 3,
            "name": "义县",
            "id": "210727"
          },
          {
            "level": 3,
            "name": "凌海市",
            "id": "210781"
          },
          {
            "level": 3,
            "name": "北镇市",
            "id": "210782"
          }
        ]
      },
      {
        "level": 2,
        "name": "营口市",
        "id": "210800",
        "childs": [
          {
            "level": 3,
            "name": "站前区",
            "id": "210802"
          },
          {
            "level": 3,
            "name": "西市区",
            "id": "210803"
          },
          {
            "level": 3,
            "name": "鲅鱼圈区",
            "id": "210804"
          },
          {
            "level": 3,
            "name": "老边区",
            "id": "210811"
          },
          {
            "level": 3,
            "name": "盖州市",
            "id": "210881"
          },
          {
            "level": 3,
            "name": "大石桥市",
            "id": "210882"
          }
        ]
      },
      {
        "level": 2,
        "name": "阜新市",
        "id": "210900",
        "childs": [
          {
            "level": 3,
            "name": "海州区",
            "id": "210902"
          },
          {
            "level": 3,
            "name": "新邱区",
            "id": "210903"
          },
          {
            "level": 3,
            "name": "太平区",
            "id": "210904"
          },
          {
            "level": 3,
            "name": "清河门区",
            "id": "210905"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "210906"
          },
          {
            "level": 3,
            "name": "细河区",
            "id": "210911"
          },
          {
            "level": 3,
            "name": "阜新蒙古族自治县",
            "id": "210921"
          },
          {
            "level": 3,
            "name": "彰武县",
            "id": "210922"
          }
        ]
      },
      {
        "level": 2,
        "name": "辽阳市",
        "id": "211000",
        "childs": [
          {
            "level": 3,
            "name": "白塔区",
            "id": "211002"
          },
          {
            "level": 3,
            "name": "文圣区",
            "id": "211003"
          },
          {
            "level": 3,
            "name": "宏伟区",
            "id": "211004"
          },
          {
            "level": 3,
            "name": "弓长岭区",
            "id": "211005"
          },
          {
            "level": 3,
            "name": "太子河区",
            "id": "211011"
          },
          {
            "level": 3,
            "name": "辽阳县",
            "id": "211021"
          },
          {
            "level": 3,
            "name": "灯塔市",
            "id": "211081"
          }
        ]
      },
      {
        "level": 2,
        "name": "盘锦市",
        "id": "211100",
        "childs": [
          {
            "level": 3,
            "name": "双台子区",
            "id": "211102"
          },
          {
            "level": 3,
            "name": "兴隆台区",
            "id": "211103"
          },
          {
            "level": 3,
            "name": "大洼县",
            "id": "211121"
          },
          {
            "level": 3,
            "name": "盘山县",
            "id": "211122"
          }
        ]
      },
      {
        "level": 2,
        "name": "铁岭市",
        "id": "211200",
        "childs": [
          {
            "level": 3,
            "name": "银州区",
            "id": "211202"
          },
          {
            "level": 3,
            "name": "清河区",
            "id": "211204"
          },
          {
            "level": 3,
            "name": "铁岭县",
            "id": "211221"
          },
          {
            "level": 3,
            "name": "西丰县",
            "id": "211223"
          },
          {
            "level": 3,
            "name": "昌图县",
            "id": "211224"
          },
          {
            "level": 3,
            "name": "调兵山市",
            "id": "211281"
          },
          {
            "level": 3,
            "name": "开原市",
            "id": "211282"
          }
        ]
      },
      {
        "level": 2,
        "name": "朝阳市",
        "id": "211300",
        "childs": [
          {
            "level": 3,
            "name": "双塔区",
            "id": "211302"
          },
          {
            "level": 3,
            "name": "龙城区",
            "id": "211303"
          },
          {
            "level": 3,
            "name": "朝阳县",
            "id": "211321"
          },
          {
            "level": 3,
            "name": "建平县",
            "id": "211322"
          },
          {
            "level": 3,
            "name": "喀喇沁左翼蒙古族自治县",
            "id": "211324"
          },
          {
            "level": 3,
            "name": "北票市",
            "id": "211381"
          },
          {
            "level": 3,
            "name": "凌源市",
            "id": "211382"
          }
        ]
      },
      {
        "level": 2,
        "name": "葫芦岛市",
        "id": "211400",
        "childs": [
          {
            "level": 3,
            "name": "连山区",
            "id": "211402"
          },
          {
            "level": 3,
            "name": "龙港区",
            "id": "211403"
          },
          {
            "level": 3,
            "name": "南票区",
            "id": "211404"
          },
          {
            "level": 3,
            "name": "绥中县",
            "id": "211421"
          },
          {
            "level": 3,
            "name": "建昌县",
            "id": "211422"
          },
          {
            "level": 3,
            "name": "兴城市",
            "id": "211481"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "吉林省",
    "id": "220000",
    "childs": [
      {
        "level": 2,
        "name": "长春市",
        "id": "220100",
        "childs": [
          {
            "level": 3,
            "name": "南关区",
            "id": "220102"
          },
          {
            "level": 3,
            "name": "宽城区",
            "id": "220103"
          },
          {
            "level": 3,
            "name": "朝阳区",
            "id": "220104"
          },
          {
            "level": 3,
            "name": "二道区",
            "id": "220105"
          },
          {
            "level": 3,
            "name": "绿园区",
            "id": "220106"
          },
          {
            "level": 3,
            "name": "双阳区",
            "id": "220112"
          },
          {
            "level": 3,
            "name": "农安县",
            "id": "220122"
          },
          {
            "level": 3,
            "name": "九台市",
            "id": "220181"
          },
          {
            "level": 3,
            "name": "榆树市",
            "id": "220182"
          },
          {
            "level": 3,
            "name": "德惠市",
            "id": "220183"
          },
          {
            "level": 3,
            "name": "高新技术产业开发区",
            "id": "220184"
          },
          {
            "level": 3,
            "name": "汽车产业开发区",
            "id": "220185"
          },
          {
            "level": 3,
            "name": "经济技术开发区",
            "id": "220186"
          },
          {
            "level": 3,
            "name": "净月旅游开发区",
            "id": "220187"
          }
        ]
      },
      {
        "level": 2,
        "name": "吉林市",
        "id": "220200",
        "childs": [
          {
            "level": 3,
            "name": "昌邑区",
            "id": "220202"
          },
          {
            "level": 3,
            "name": "龙潭区",
            "id": "220203"
          },
          {
            "level": 3,
            "name": "船营区",
            "id": "220204"
          },
          {
            "level": 3,
            "name": "丰满区",
            "id": "220211"
          },
          {
            "level": 3,
            "name": "永吉县",
            "id": "220221"
          },
          {
            "level": 3,
            "name": "蛟河市",
            "id": "220281"
          },
          {
            "level": 3,
            "name": "桦甸市",
            "id": "220282"
          },
          {
            "level": 3,
            "name": "舒兰市",
            "id": "220283"
          },
          {
            "level": 3,
            "name": "磐石市",
            "id": "220284"
          }
        ]
      },
      {
        "level": 2,
        "name": "四平市",
        "id": "220300",
        "childs": [
          {
            "level": 3,
            "name": "铁西区",
            "id": "220302"
          },
          {
            "level": 3,
            "name": "铁东区",
            "id": "220303"
          },
          {
            "level": 3,
            "name": "梨树县",
            "id": "220322"
          },
          {
            "level": 3,
            "name": "伊通满族自治县",
            "id": "220323"
          },
          {
            "level": 3,
            "name": "公主岭市",
            "id": "220381"
          },
          {
            "level": 3,
            "name": "双辽市",
            "id": "220382"
          }
        ]
      },
      {
        "level": 2,
        "name": "辽源市",
        "id": "220400",
        "childs": [
          {
            "level": 3,
            "name": "龙山区",
            "id": "220402"
          },
          {
            "level": 3,
            "name": "西安区",
            "id": "220403"
          },
          {
            "level": 3,
            "name": "东丰县",
            "id": "220421"
          },
          {
            "level": 3,
            "name": "东辽县",
            "id": "220422"
          }
        ]
      },
      {
        "level": 2,
        "name": "通化市",
        "id": "220500",
        "childs": [
          {
            "level": 3,
            "name": "东昌区",
            "id": "220502"
          },
          {
            "level": 3,
            "name": "二道江区",
            "id": "220503"
          },
          {
            "level": 3,
            "name": "通化县",
            "id": "220521"
          },
          {
            "level": 3,
            "name": "辉南县",
            "id": "220523"
          },
          {
            "level": 3,
            "name": "柳河县",
            "id": "220524"
          },
          {
            "level": 3,
            "name": "梅河口市",
            "id": "220581"
          },
          {
            "level": 3,
            "name": "集安市",
            "id": "220582"
          }
        ]
      },
      {
        "level": 2,
        "name": "白山市",
        "id": "220600",
        "childs": [
          {
            "level": 3,
            "name": "浑江区",
            "id": "220602"
          },
          {
            "level": 3,
            "name": "抚松县",
            "id": "220621"
          },
          {
            "level": 3,
            "name": "靖宇县",
            "id": "220622"
          },
          {
            "level": 3,
            "name": "长白朝鲜族自治县",
            "id": "220623"
          },
          {
            "level": 3,
            "name": "江源区",
            "id": "220625"
          },
          {
            "level": 3,
            "name": "临江市",
            "id": "220681"
          }
        ]
      },
      {
        "level": 2,
        "name": "松原市",
        "id": "220700",
        "childs": [
          {
            "level": 3,
            "name": "宁江区",
            "id": "220702"
          },
          {
            "level": 3,
            "name": "前郭尔罗斯蒙古族自治县",
            "id": "220721"
          },
          {
            "level": 3,
            "name": "长岭县",
            "id": "220722"
          },
          {
            "level": 3,
            "name": "乾安县",
            "id": "220723"
          },
          {
            "level": 3,
            "name": "扶余市",
            "id": "220724"
          }
        ]
      },
      {
        "level": 2,
        "name": "白城市",
        "id": "220800",
        "childs": [
          {
            "level": 3,
            "name": "洮北区",
            "id": "220802"
          },
          {
            "level": 3,
            "name": "镇赉县",
            "id": "220821"
          },
          {
            "level": 3,
            "name": "通榆县",
            "id": "220822"
          },
          {
            "level": 3,
            "name": "洮南市",
            "id": "220881"
          },
          {
            "level": 3,
            "name": "大安市",
            "id": "220882"
          }
        ]
      },
      {
        "level": 2,
        "name": "延边朝鲜族自治州",
        "id": "222400",
        "childs": [
          {
            "level": 3,
            "name": "延吉市",
            "id": "222401"
          },
          {
            "level": 3,
            "name": "图们市",
            "id": "222402"
          },
          {
            "level": 3,
            "name": "敦化市",
            "id": "222403"
          },
          {
            "level": 3,
            "name": "珲春市",
            "id": "222404"
          },
          {
            "level": 3,
            "name": "龙井市",
            "id": "222405"
          },
          {
            "level": 3,
            "name": "和龙市",
            "id": "222406"
          },
          {
            "level": 3,
            "name": "汪清县",
            "id": "222424"
          },
          {
            "level": 3,
            "name": "安图县",
            "id": "222426"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "黑龙江省",
    "id": "230000",
    "childs": [
      {
        "level": 2,
        "name": "哈尔滨市",
        "id": "230100",
        "childs": [
          {
            "level": 3,
            "name": "道里区",
            "id": "230102"
          },
          {
            "level": 3,
            "name": "南岗区",
            "id": "230103"
          },
          {
            "level": 3,
            "name": "道外区",
            "id": "230104"
          },
          {
            "level": 3,
            "name": "香坊区",
            "id": "230106"
          },
          {
            "level": 3,
            "name": "动力区",
            "id": "230107"
          },
          {
            "level": 3,
            "name": "平房区",
            "id": "230108"
          },
          {
            "level": 3,
            "name": "松北区",
            "id": "230109"
          },
          {
            "level": 3,
            "name": "呼兰区",
            "id": "230111"
          },
          {
            "level": 3,
            "name": "依兰县",
            "id": "230123"
          },
          {
            "level": 3,
            "name": "方正县",
            "id": "230124"
          },
          {
            "level": 3,
            "name": "宾县",
            "id": "230125"
          },
          {
            "level": 3,
            "name": "巴彦县",
            "id": "230126"
          },
          {
            "level": 3,
            "name": "木兰县",
            "id": "230127"
          },
          {
            "level": 3,
            "name": "通河县",
            "id": "230128"
          },
          {
            "level": 3,
            "name": "延寿县",
            "id": "230129"
          },
          {
            "level": 3,
            "name": "双城市",
            "id": "230182"
          },
          {
            "level": 3,
            "name": "尚志市",
            "id": "230183"
          },
          {
            "level": 3,
            "name": "五常市",
            "id": "230184"
          },
          {
            "level": 3,
            "name": "阿城区",
            "id": "230185"
          }
        ]
      },
      {
        "level": 2,
        "name": "齐齐哈尔市",
        "id": "230200",
        "childs": [
          {
            "level": 3,
            "name": "龙沙区",
            "id": "230202"
          },
          {
            "level": 3,
            "name": "建华区",
            "id": "230203"
          },
          {
            "level": 3,
            "name": "铁锋区",
            "id": "230204"
          },
          {
            "level": 3,
            "name": "昂昂溪区",
            "id": "230205"
          },
          {
            "level": 3,
            "name": "富拉尔基区",
            "id": "230206"
          },
          {
            "level": 3,
            "name": "碾子山区",
            "id": "230207"
          },
          {
            "level": 3,
            "name": "梅里斯达斡尔族区",
            "id": "230208"
          },
          {
            "level": 3,
            "name": "龙江县",
            "id": "230221"
          },
          {
            "level": 3,
            "name": "依安县",
            "id": "230223"
          },
          {
            "level": 3,
            "name": "泰来县",
            "id": "230224"
          },
          {
            "level": 3,
            "name": "甘南县",
            "id": "230225"
          },
          {
            "level": 3,
            "name": "富裕县",
            "id": "230227"
          },
          {
            "level": 3,
            "name": "克山县",
            "id": "230229"
          },
          {
            "level": 3,
            "name": "克东县",
            "id": "230230"
          },
          {
            "level": 3,
            "name": "拜泉县",
            "id": "230231"
          },
          {
            "level": 3,
            "name": "讷河市",
            "id": "230281"
          }
        ]
      },
      {
        "level": 2,
        "name": "鸡西市",
        "id": "230300",
        "childs": [
          {
            "level": 3,
            "name": "鸡冠区",
            "id": "230302"
          },
          {
            "level": 3,
            "name": "恒山区",
            "id": "230303"
          },
          {
            "level": 3,
            "name": "滴道区",
            "id": "230304"
          },
          {
            "level": 3,
            "name": "梨树区",
            "id": "230305"
          },
          {
            "level": 3,
            "name": "城子河区",
            "id": "230306"
          },
          {
            "level": 3,
            "name": "麻山区",
            "id": "230307"
          },
          {
            "level": 3,
            "name": "鸡东县",
            "id": "230321"
          },
          {
            "level": 3,
            "name": "虎林市",
            "id": "230381"
          },
          {
            "level": 3,
            "name": "密山市",
            "id": "230382"
          }
        ]
      },
      {
        "level": 2,
        "name": "鹤岗市",
        "id": "230400",
        "childs": [
          {
            "level": 3,
            "name": "向阳区",
            "id": "230402"
          },
          {
            "level": 3,
            "name": "工农区",
            "id": "230403"
          },
          {
            "level": 3,
            "name": "南山区",
            "id": "230404"
          },
          {
            "level": 3,
            "name": "兴安区",
            "id": "230405"
          },
          {
            "level": 3,
            "name": "东山区",
            "id": "230406"
          },
          {
            "level": 3,
            "name": "兴山区",
            "id": "230407"
          },
          {
            "level": 3,
            "name": "萝北县",
            "id": "230421"
          },
          {
            "level": 3,
            "name": "绥滨县",
            "id": "230422"
          }
        ]
      },
      {
        "level": 2,
        "name": "双鸭山市",
        "id": "230500",
        "childs": [
          {
            "level": 3,
            "name": "尖山区",
            "id": "230502"
          },
          {
            "level": 3,
            "name": "岭东区",
            "id": "230503"
          },
          {
            "level": 3,
            "name": "四方台区",
            "id": "230505"
          },
          {
            "level": 3,
            "name": "宝山区",
            "id": "230506"
          },
          {
            "level": 3,
            "name": "集贤县",
            "id": "230521"
          },
          {
            "level": 3,
            "name": "友谊县",
            "id": "230522"
          },
          {
            "level": 3,
            "name": "宝清县",
            "id": "230523"
          },
          {
            "level": 3,
            "name": "饶河县",
            "id": "230524"
          }
        ]
      },
      {
        "level": 2,
        "name": "大庆市",
        "id": "230600",
        "childs": [
          {
            "level": 3,
            "name": "萨尔图区",
            "id": "230602"
          },
          {
            "level": 3,
            "name": "龙凤区",
            "id": "230603"
          },
          {
            "level": 3,
            "name": "让胡路区",
            "id": "230604"
          },
          {
            "level": 3,
            "name": "红岗区",
            "id": "230605"
          },
          {
            "level": 3,
            "name": "大同区",
            "id": "230606"
          },
          {
            "level": 3,
            "name": "肇州县",
            "id": "230621"
          },
          {
            "level": 3,
            "name": "肇源县",
            "id": "230622"
          },
          {
            "level": 3,
            "name": "林甸县",
            "id": "230623"
          },
          {
            "level": 3,
            "name": "杜尔伯特蒙古族自治县",
            "id": "230624"
          }
        ]
      },
      {
        "level": 2,
        "name": "伊春市",
        "id": "230700",
        "childs": [
          {
            "level": 3,
            "name": "伊春区",
            "id": "230702"
          },
          {
            "level": 3,
            "name": "南岔区",
            "id": "230703"
          },
          {
            "level": 3,
            "name": "友好区",
            "id": "230704"
          },
          {
            "level": 3,
            "name": "西林区",
            "id": "230705"
          },
          {
            "level": 3,
            "name": "翠峦区",
            "id": "230706"
          },
          {
            "level": 3,
            "name": "新青区",
            "id": "230707"
          },
          {
            "level": 3,
            "name": "美溪区",
            "id": "230708"
          },
          {
            "level": 3,
            "name": "金山屯区",
            "id": "230709"
          },
          {
            "level": 3,
            "name": "五营区",
            "id": "230710"
          },
          {
            "level": 3,
            "name": "乌马河区",
            "id": "230711"
          },
          {
            "level": 3,
            "name": "汤旺河区",
            "id": "230712"
          },
          {
            "level": 3,
            "name": "带岭区",
            "id": "230713"
          },
          {
            "level": 3,
            "name": "乌伊岭区",
            "id": "230714"
          },
          {
            "level": 3,
            "name": "红星区",
            "id": "230715"
          },
          {
            "level": 3,
            "name": "上甘岭区",
            "id": "230716"
          },
          {
            "level": 3,
            "name": "嘉荫县",
            "id": "230722"
          },
          {
            "level": 3,
            "name": "铁力市",
            "id": "230781"
          }
        ]
      },
      {
        "level": 2,
        "name": "佳木斯市",
        "id": "230800",
        "childs": [
          {
            "level": 3,
            "name": "永红区",
            "id": "230802"
          },
          {
            "level": 3,
            "name": "向阳区",
            "id": "230803"
          },
          {
            "level": 3,
            "name": "前进区",
            "id": "230804"
          },
          {
            "level": 3,
            "name": "东风区",
            "id": "230805"
          },
          {
            "level": 3,
            "name": "郊区",
            "id": "230811"
          },
          {
            "level": 3,
            "name": "桦南县",
            "id": "230822"
          },
          {
            "level": 3,
            "name": "桦川县",
            "id": "230826"
          },
          {
            "level": 3,
            "name": "汤原县",
            "id": "230828"
          },
          {
            "level": 3,
            "name": "抚远县",
            "id": "230833"
          },
          {
            "level": 3,
            "name": "同江市",
            "id": "230881"
          },
          {
            "level": 3,
            "name": "富锦市",
            "id": "230882"
          }
        ]
      },
      {
        "level": 2,
        "name": "七台河市",
        "id": "230900",
        "childs": [
          {
            "level": 3,
            "name": "新兴区",
            "id": "230902"
          },
          {
            "level": 3,
            "name": "桃山区",
            "id": "230903"
          },
          {
            "level": 3,
            "name": "茄子河区",
            "id": "230904"
          },
          {
            "level": 3,
            "name": "勃利县",
            "id": "230921"
          }
        ]
      },
      {
        "level": 2,
        "name": "牡丹江市",
        "id": "231000",
        "childs": [
          {
            "level": 3,
            "name": "东安区",
            "id": "231002"
          },
          {
            "level": 3,
            "name": "阳明区",
            "id": "231003"
          },
          {
            "level": 3,
            "name": "爱民区",
            "id": "231004"
          },
          {
            "level": 3,
            "name": "西安区",
            "id": "231005"
          },
          {
            "level": 3,
            "name": "东宁县",
            "id": "231024"
          },
          {
            "level": 3,
            "name": "林口县",
            "id": "231025"
          },
          {
            "level": 3,
            "name": "绥芬河市",
            "id": "231081"
          },
          {
            "level": 3,
            "name": "海林市",
            "id": "231083"
          },
          {
            "level": 3,
            "name": "宁安市",
            "id": "231084"
          },
          {
            "level": 3,
            "name": "穆棱市",
            "id": "231085"
          }
        ]
      },
      {
        "level": 2,
        "name": "黑河市",
        "id": "231100",
        "childs": [
          {
            "level": 3,
            "name": "爱辉区",
            "id": "231102"
          },
          {
            "level": 3,
            "name": "嫩江县",
            "id": "231121"
          },
          {
            "level": 3,
            "name": "逊克县",
            "id": "231123"
          },
          {
            "level": 3,
            "name": "孙吴县",
            "id": "231124"
          },
          {
            "level": 3,
            "name": "北安市",
            "id": "231181"
          },
          {
            "level": 3,
            "name": "五大连池市",
            "id": "231182"
          }
        ]
      },
      {
        "level": 2,
        "name": "绥化市",
        "id": "231200",
        "childs": [
          {
            "level": 3,
            "name": "北林区",
            "id": "231202"
          },
          {
            "level": 3,
            "name": "望奎县",
            "id": "231221"
          },
          {
            "level": 3,
            "name": "兰西县",
            "id": "231222"
          },
          {
            "level": 3,
            "name": "青冈县",
            "id": "231223"
          },
          {
            "level": 3,
            "name": "庆安县",
            "id": "231224"
          },
          {
            "level": 3,
            "name": "明水县",
            "id": "231225"
          },
          {
            "level": 3,
            "name": "绥棱县",
            "id": "231226"
          },
          {
            "level": 3,
            "name": "安达市",
            "id": "231281"
          },
          {
            "level": 3,
            "name": "肇东市",
            "id": "231282"
          },
          {
            "level": 3,
            "name": "海伦市",
            "id": "231283"
          }
        ]
      },
      {
        "level": 2,
        "name": "大兴安岭地区",
        "id": "232700",
        "childs": [
          {
            "level": 3,
            "name": "松岭区",
            "id": "232702"
          },
          {
            "level": 3,
            "name": "新林区",
            "id": "232703"
          },
          {
            "level": 3,
            "name": "呼中区",
            "id": "232704"
          },
          {
            "level": 3,
            "name": "呼玛县",
            "id": "232721"
          },
          {
            "level": 3,
            "name": "塔河县",
            "id": "232722"
          },
          {
            "level": 3,
            "name": "漠河县",
            "id": "232723"
          },
          {
            "level": 3,
            "name": "加格达奇区",
            "id": "232724"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "江苏省",
    "id": "320000",
    "childs": [
      {
        "level": 2,
        "name": "南京市",
        "id": "320100",
        "childs": [
          {
            "level": 3,
            "name": "玄武区",
            "id": "320102"
          },
          {
            "level": 3,
            "name": "白下区",
            "id": "320103"
          },
          {
            "level": 3,
            "name": "秦淮区",
            "id": "320104"
          },
          {
            "level": 3,
            "name": "建邺区",
            "id": "320105"
          },
          {
            "level": 3,
            "name": "鼓楼区",
            "id": "320106"
          },
          {
            "level": 3,
            "name": "下关区",
            "id": "320107"
          },
          {
            "level": 3,
            "name": "浦口区",
            "id": "320111"
          },
          {
            "level": 3,
            "name": "栖霞区",
            "id": "320113"
          },
          {
            "level": 3,
            "name": "雨花台区",
            "id": "320114"
          },
          {
            "level": 3,
            "name": "江宁区",
            "id": "320115"
          },
          {
            "level": 3,
            "name": "六合区",
            "id": "320116"
          },
          {
            "level": 3,
            "name": "溧水区",
            "id": "320124"
          },
          {
            "level": 3,
            "name": "高淳区",
            "id": "320125"
          }
        ]
      },
      {
        "level": 2,
        "name": "无锡市",
        "id": "320200",
        "childs": [
          {
            "level": 3,
            "name": "崇安区",
            "id": "320202"
          },
          {
            "level": 3,
            "name": "南长区",
            "id": "320203"
          },
          {
            "level": 3,
            "name": "北塘区",
            "id": "320204"
          },
          {
            "level": 3,
            "name": "锡山区",
            "id": "320205"
          },
          {
            "level": 3,
            "name": "惠山区",
            "id": "320206"
          },
          {
            "level": 3,
            "name": "滨湖区",
            "id": "320211"
          },
          {
            "level": 3,
            "name": "江阴市",
            "id": "320281"
          },
          {
            "level": 3,
            "name": "宜兴市",
            "id": "320282"
          },
          {
            "level": 3,
            "name": "新区",
            "id": "320296"
          }
        ]
      },
      {
        "level": 2,
        "name": "徐州市",
        "id": "320300",
        "childs": [
          {
            "level": 3,
            "name": "鼓楼区",
            "id": "320302"
          },
          {
            "level": 3,
            "name": "云龙区",
            "id": "320303"
          },
          {
            "level": 3,
            "name": "九里区",
            "id": "320304"
          },
          {
            "level": 3,
            "name": "贾汪区",
            "id": "320305"
          },
          {
            "level": 3,
            "name": "泉山区",
            "id": "320311"
          },
          {
            "level": 3,
            "name": "丰县",
            "id": "320321"
          },
          {
            "level": 3,
            "name": "沛县",
            "id": "320322"
          },
          {
            "level": 3,
            "name": "铜山区",
            "id": "320323"
          },
          {
            "level": 3,
            "name": "睢宁县",
            "id": "320324"
          },
          {
            "level": 3,
            "name": "新沂市",
            "id": "320381"
          },
          {
            "level": 3,
            "name": "邳州市",
            "id": "320382"
          }
        ]
      },
      {
        "level": 2,
        "name": "常州市",
        "id": "320400",
        "childs": [
          {
            "level": 3,
            "name": "天宁区",
            "id": "320402"
          },
          {
            "level": 3,
            "name": "钟楼区",
            "id": "320404"
          },
          {
            "level": 3,
            "name": "戚墅堰区",
            "id": "320405"
          },
          {
            "level": 3,
            "name": "新北区",
            "id": "320411"
          },
          {
            "level": 3,
            "name": "武进区",
            "id": "320412"
          },
          {
            "level": 3,
            "name": "溧阳市",
            "id": "320481"
          },
          {
            "level": 3,
            "name": "金坛市",
            "id": "320482"
          }
        ]
      },
      {
        "level": 2,
        "name": "苏州市",
        "id": "320500",
        "childs": [
          {
            "level": 3,
            "name": "沧浪区",
            "id": "320502"
          },
          {
            "level": 3,
            "name": "平江区",
            "id": "320503"
          },
          {
            "level": 3,
            "name": "金阊区",
            "id": "320504"
          },
          {
            "level": 3,
            "name": "虎丘区",
            "id": "320505"
          },
          {
            "level": 3,
            "name": "吴中区",
            "id": "320506"
          },
          {
            "level": 3,
            "name": "相城区",
            "id": "320507"
          },
          {
            "level": 3,
            "name": "姑苏区",
            "id": "320508"
          },
          {
            "level": 3,
            "name": "常熟市",
            "id": "320581"
          },
          {
            "level": 3,
            "name": "张家港市",
            "id": "320582"
          },
          {
            "level": 3,
            "name": "昆山市",
            "id": "320583"
          },
          {
            "level": 3,
            "name": "吴江区",
            "id": "320584"
          },
          {
            "level": 3,
            "name": "太仓市",
            "id": "320585"
          },
          {
            "level": 3,
            "name": "新区",
            "id": "320594"
          },
          {
            "level": 3,
            "name": "园区",
            "id": "320595"
          }
        ]
      },
      {
        "level": 2,
        "name": "南通市",
        "id": "320600",
        "childs": [
          {
            "level": 3,
            "name": "崇川区",
            "id": "320602"
          },
          {
            "level": 3,
            "name": "港闸区",
            "id": "320611"
          },
          {
            "level": 3,
            "name": "通州区",
            "id": "320612"
          },
          {
            "level": 3,
            "name": "海安县",
            "id": "320621"
          },
          {
            "level": 3,
            "name": "如东县",
            "id": "320623"
          },
          {
            "level": 3,
            "name": "启东市",
            "id": "320681"
          },
          {
            "level": 3,
            "name": "如皋市",
            "id": "320682"
          },
          {
            "level": 3,
            "name": "通州市",
            "id": "320683"
          },
          {
            "level": 3,
            "name": "海门市",
            "id": "320684"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "320693"
          }
        ]
      },
      {
        "level": 2,
        "name": "连云港市",
        "id": "320700",
        "childs": [
          {
            "level": 3,
            "name": "连云区",
            "id": "320703"
          },
          {
            "level": 3,
            "name": "新浦区",
            "id": "320705"
          },
          {
            "level": 3,
            "name": "海州区",
            "id": "320706"
          },
          {
            "level": 3,
            "name": "赣榆县",
            "id": "320721"
          },
          {
            "level": 3,
            "name": "东海县",
            "id": "320722"
          },
          {
            "level": 3,
            "name": "灌云县",
            "id": "320723"
          },
          {
            "level": 3,
            "name": "灌南县",
            "id": "320724"
          }
        ]
      },
      {
        "level": 2,
        "name": "淮安市",
        "id": "320800",
        "childs": [
          {
            "level": 3,
            "name": "清河区",
            "id": "320802"
          },
          {
            "level": 3,
            "name": "淮安区",
            "id": "320803"
          },
          {
            "level": 3,
            "name": "淮阴区",
            "id": "320804"
          },
          {
            "level": 3,
            "name": "清浦区",
            "id": "320811"
          },
          {
            "level": 3,
            "name": "涟水县",
            "id": "320826"
          },
          {
            "level": 3,
            "name": "洪泽县",
            "id": "320829"
          },
          {
            "level": 3,
            "name": "盱眙县",
            "id": "320830"
          },
          {
            "level": 3,
            "name": "金湖县",
            "id": "320831"
          }
        ]
      },
      {
        "level": 2,
        "name": "盐城市",
        "id": "320900",
        "childs": [
          {
            "level": 3,
            "name": "亭湖区",
            "id": "320902"
          },
          {
            "level": 3,
            "name": "盐都区",
            "id": "320903"
          },
          {
            "level": 3,
            "name": "响水县",
            "id": "320921"
          },
          {
            "level": 3,
            "name": "滨海县",
            "id": "320922"
          },
          {
            "level": 3,
            "name": "阜宁县",
            "id": "320923"
          },
          {
            "level": 3,
            "name": "射阳县",
            "id": "320924"
          },
          {
            "level": 3,
            "name": "建湖县",
            "id": "320925"
          },
          {
            "level": 3,
            "name": "东台市",
            "id": "320981"
          },
          {
            "level": 3,
            "name": "大丰市",
            "id": "320982"
          }
        ]
      },
      {
        "level": 2,
        "name": "扬州市",
        "id": "321000",
        "childs": [
          {
            "level": 3,
            "name": "广陵区",
            "id": "321002"
          },
          {
            "level": 3,
            "name": "邗江区",
            "id": "321003"
          },
          {
            "level": 3,
            "name": "维扬区",
            "id": "321011"
          },
          {
            "level": 3,
            "name": "宝应县",
            "id": "321023"
          },
          {
            "level": 3,
            "name": "仪征市",
            "id": "321081"
          },
          {
            "level": 3,
            "name": "高邮市",
            "id": "321084"
          },
          {
            "level": 3,
            "name": "江都区",
            "id": "321088"
          },
          {
            "level": 3,
            "name": "经济开发区",
            "id": "321092"
          }
        ]
      },
      {
        "level": 2,
        "name": "镇江市",
        "id": "321100",
        "childs": [
          {
            "level": 3,
            "name": "京口区",
            "id": "321102"
          },
          {
            "level": 3,
            "name": "润州区",
            "id": "321111"
          },
          {
            "level": 3,
            "name": "丹徒区",
            "id": "321112"
          },
          {
            "level": 3,
            "name": "丹阳市",
            "id": "321181"
          },
          {
            "level": 3,
            "name": "扬中市",
            "id": "321182"
          },
          {
            "level": 3,
            "name": "句容市",
            "id": "321183"
          }
        ]
      },
      {
        "level": 2,
        "name": "泰州市",
        "id": "321200",
        "childs": [
          {
            "level": 3,
            "name": "海陵区",
            "id": "321202"
          },
          {
            "level": 3,
            "name": "高港区",
            "id": "321203"
          },
          {
            "level": 3,
            "name": "兴化市",
            "id": "321281"
          },
          {
            "level": 3,
            "name": "靖江市",
            "id": "321282"
          },
          {
            "level": 3,
            "name": "泰兴市",
            "id": "321283"
          },
          {
            "level": 3,
            "name": "姜堰区",
            "id": "321284"
          }
        ]
      },
      {
        "level": 2,
        "name": "宿迁市",
        "id": "321300",
        "childs": [
          {
            "level": 3,
            "name": "宿城区",
            "id": "321302"
          },
          {
            "level": 3,
            "name": "宿豫区",
            "id": "321311"
          },
          {
            "level": 3,
            "name": "沭阳县",
            "id": "321322"
          },
          {
            "level": 3,
            "name": "泗阳县",
            "id": "321323"
          },
          {
            "level": 3,
            "name": "泗洪县",
            "id": "321324"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "浙江省",
    "id": "330000",
    "childs": [
      {
        "level": 2,
        "name": "杭州市",
        "id": "330100",
        "childs": [
          {
            "level": 3,
            "name": "上城区",
            "id": "330102"
          },
          {
            "level": 3,
            "name": "下城区",
            "id": "330103"
          },
          {
            "level": 3,
            "name": "江干区",
            "id": "330104"
          },
          {
            "level": 3,
            "name": "拱墅区",
            "id": "330105"
          },
          {
            "level": 3,
            "name": "西湖区",
            "id": "330106"
          },
          {
            "level": 3,
            "name": "滨江区",
            "id": "330108"
          },
          {
            "level": 3,
            "name": "萧山区",
            "id": "330109"
          },
          {
            "level": 3,
            "name": "余杭区",
            "id": "330110"
          },
          {
            "level": 3,
            "name": "桐庐县",
            "id": "330122"
          },
          {
            "level": 3,
            "name": "淳安县",
            "id": "330127"
          },
          {
            "level": 3,
            "name": "建德市",
            "id": "330182"
          },
          {
            "level": 3,
            "name": "富阳市",
            "id": "330183"
          },
          {
            "level": 3,
            "name": "临安市",
            "id": "330185"
          }
        ]
      },
      {
        "level": 2,
        "name": "宁波市",
        "id": "330200",
        "childs": [
          {
            "level": 3,
            "name": "海曙区",
            "id": "330203"
          },
          {
            "level": 3,
            "name": "江东区",
            "id": "330204"
          },
          {
            "level": 3,
            "name": "江北区",
            "id": "330205"
          },
          {
            "level": 3,
            "name": "北仑区",
            "id": "330206"
          },
          {
            "level": 3,
            "name": "镇海区",
            "id": "330211"
          },
          {
            "level": 3,
            "name": "鄞州区",
            "id": "330212"
          },
          {
            "level": 3,
            "name": "象山县",
            "id": "330225"
          },
          {
            "level": 3,
            "name": "宁海县",
            "id": "330226"
          },
          {
            "level": 3,
            "name": "余姚市",
            "id": "330281"
          },
          {
            "level": 3,
            "name": "慈溪市",
            "id": "330282"
          },
          {
            "level": 3,
            "name": "奉化市",
            "id": "330283"
          }
        ]
      },
      {
        "level": 2,
        "name": "温州市",
        "id": "330300",
        "childs": [
          {
            "level": 3,
            "name": "鹿城区",
            "id": "330302"
          },
          {
            "level": 3,
            "name": "龙湾区",
            "id": "330303"
          },
          {
            "level": 3,
            "name": "瓯海区",
            "id": "330304"
          },
          {
            "level": 3,
            "name": "洞头县",
            "id": "330322"
          },
          {
            "level": 3,
            "name": "永嘉县",
            "id": "330324"
          },
          {
            "level": 3,
            "name": "平阳县",
            "id": "330326"
          },
          {
            "level": 3,
            "name": "苍南县",
            "id": "330327"
          },
          {
            "level": 3,
            "name": "文成县",
            "id": "330328"
          },
          {
            "level": 3,
            "name": "泰顺县",
            "id": "330329"
          },
          {
            "level": 3,
            "name": "瑞安市",
            "id": "330381"
          },
          {
            "level": 3,
            "name": "乐清市",
            "id": "330382"
          }
        ]
      },
      {
        "level": 2,
        "name": "嘉兴市",
        "id": "330400",
        "childs": [
          {
            "level": 3,
            "name": "南湖区",
            "id": "330402"
          },
          {
            "level": 3,
            "name": "秀洲区",
            "id": "330411"
          },
          {
            "level": 3,
            "name": "嘉善县",
            "id": "330421"
          },
          {
            "level": 3,
            "name": "海盐县",
            "id": "330424"
          },
          {
            "level": 3,
            "name": "海宁市",
            "id": "330481"
          },
          {
            "level": 3,
            "name": "平湖市",
            "id": "330482"
          },
          {
            "level": 3,
            "name": "桐乡市",
            "id": "330483"
          }
        ]
      },
      {
        "level": 2,
        "name": "湖州市",
        "id": "330500",
        "childs": [
          {
            "level": 3,
            "name": "吴兴区",
            "id": "330502"
          },
          {
            "level": 3,
            "name": "南浔区",
            "id": "330503"
          },
          {
            "level": 3,
            "name": "德清县",
            "id": "330521"
          },
          {
            "level": 3,
            "name": "长兴县",
            "id": "330522"
          },
          {
            "level": 3,
            "name": "安吉县",
            "id": "330523"
          }
        ]
      },
      {
        "level": 2,
        "name": "绍兴市",
        "id": "330600",
        "childs": [
          {
            "level": 3,
            "name": "越城区",
            "id": "330602"
          },
          {
            "level": 3,
            "name": "绍兴县",
            "id": "330621"
          },
          {
            "level": 3,
            "name": "新昌县",
            "id": "330624"
          },
          {
            "level": 3,
            "name": "诸暨市",
            "id": "330681"
          },
          {
            "level": 3,
            "name": "上虞市",
            "id": "330682"
          },
          {
            "level": 3,
            "name": "嵊州市",
            "id": "330683"
          }
        ]
      },
      {
        "level": 2,
        "name": "金华市",
        "id": "330700",
        "childs": [
          {
            "level": 3,
            "name": "婺城区",
            "id": "330702"
          },
          {
            "level": 3,
            "name": "金东区",
            "id": "330703"
          },
          {
            "level": 3,
            "name": "武义县",
            "id": "330723"
          },
          {
            "level": 3,
            "name": "浦江县",
            "id": "330726"
          },
          {
            "level": 3,
            "name": "磐安县",
            "id": "330727"
          },
          {
            "level": 3,
            "name": "兰溪市",
            "id": "330781"
          },
          {
            "level": 3,
            "name": "义乌市",
            "id": "330782"
          },
          {
            "level": 3,
            "name": "东阳市",
            "id": "330783"
          },
          {
            "level": 3,
            "name": "永康市",
            "id": "330784"
          }
        ]
      },
      {
        "level": 2,
        "name": "衢州市",
        "id": "330800",
        "childs": [
          {
            "level": 3,
            "name": "柯城区",
            "id": "330802"
          },
          {
            "level": 3,
            "name": "衢江区",
            "id": "330803"
          },
          {
            "level": 3,
            "name": "常山县",
            "id": "330822"
          },
          {
            "level": 3,
            "name": "开化县",
            "id": "330824"
          },
          {
            "level": 3,
            "name": "龙游县",
            "id": "330825"
          },
          {
            "level": 3,
            "name": "江山市",
            "id": "330881"
          }
        ]
      },
      {
        "level": 2,
        "name": "舟山市",
        "id": "330900",
        "childs": [
          {
            "level": 3,
            "name": "定海区",
            "id": "330902"
          },
          {
            "level": 3,
            "name": "普陀区",
            "id": "330903"
          },
          {
            "level": 3,
            "name": "岱山县",
            "id": "330921"
          },
          {
            "level": 3,
            "name": "嵊泗县",
            "id": "330922"
          }
        ]
      },
      {
        "level": 2,
        "name": "台州市",
        "id": "331000",
        "childs": [
          {
            "level": 3,
            "name": "椒江区",
            "id": "331002"
          },
          {
            "level": 3,
            "name": "黄岩区",
            "id": "331003"
          },
          {
            "level": 3,
            "name": "路桥区",
            "id": "331004"
          },
          {
            "level": 3,
            "name": "玉环县",
            "id": "331021"
          },
          {
            "level": 3,
            "name": "三门县",
            "id": "331022"
          },
          {
            "level": 3,
            "name": "天台县",
            "id": "331023"
          },
          {
            "level": 3,
            "name": "仙居县",
            "id": "331024"
          },
          {
            "level": 3,
            "name": "温岭市",
            "id": "331081"
          },
          {
            "level": 3,
            "name": "临海市",
            "id": "331082"
          }
        ]
      },
      {
        "level": 2,
        "name": "丽水市",
        "id": "331100",
        "childs": [
          {
            "level": 3,
            "name": "莲都区",
            "id": "331102"
          },
          {
            "level": 3,
            "name": "青田县",
            "id": "331121"
          },
          {
            "level": 3,
            "name": "缙云县",
            "id": "331122"
          },
          {
            "level": 3,
            "name": "遂昌县",
            "id": "331123"
          },
          {
            "level": 3,
            "name": "松阳县",
            "id": "331124"
          },
          {
            "level": 3,
            "name": "云和县",
            "id": "331125"
          },
          {
            "level": 3,
            "name": "庆元县",
            "id": "331126"
          },
          {
            "level": 3,
            "name": "景宁畲族自治县",
            "id": "331127"
          },
          {
            "level": 3,
            "name": "龙泉市",
            "id": "331181"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "安徽省",
    "id": "340000",
    "childs": [
      {
        "level": 2,
        "name": "合肥市",
        "id": "340100",
        "childs": [
          {
            "level": 3,
            "name": "瑶海区",
            "id": "340102"
          },
          {
            "level": 3,
            "name": "庐阳区",
            "id": "340103"
          },
          {
            "level": 3,
            "name": "蜀山区",
            "id": "340104"
          },
          {
            "level": 3,
            "name": "包河区",
            "id": "340111"
          },
          {
            "level": 3,
            "name": "长丰县",
            "id": "340121"
          },
          {
            "level": 3,
            "name": "肥东县",
            "id": "340122"
          },
          {
            "level": 3,
            "name": "肥西县",
            "id": "340123"
          },
          {
            "level": 3,
            "name": "高新区",
            "id": "340151"
          },
          {
            "level": 3,
            "name": "中区",
            "id": "340191"
          },
          {
            "level": 3,
            "name": "巢湖市",
            "id": "341400"
          },
          {
            "level": 3,
            "name": "居巢区",
            "id": "341402"
          },
          {
            "level": 3,
            "name": "庐江县",
            "id": "341421"
          }
        ]
      },
      {
        "level": 2,
        "name": "芜湖市",
        "id": "340200",
        "childs": [
          {
            "level": 3,
            "name": "镜湖区",
            "id": "340202"
          },
          {
            "level": 3,
            "name": "弋江区",
            "id": "340203"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "340204"
          },
          {
            "level": 3,
            "name": "鸠江区",
            "id": "340207"
          },
          {
            "level": 3,
            "name": "三山区",
            "id": "340208"
          },
          {
            "level": 3,
            "name": "芜湖县",
            "id": "340221"
          },
          {
            "level": 3,
            "name": "繁昌县",
            "id": "340222"
          },
          {
            "level": 3,
            "name": "南陵县",
            "id": "340223"
          },
          {
            "level": 3,
            "name": "无为县",
            "id": "341422"
          }
        ]
      },
      {
        "level": 2,
        "name": "蚌埠市",
        "id": "340300",
        "childs": [
          {
            "level": 3,
            "name": "龙子湖区",
            "id": "340302"
          },
          {
            "level": 3,
            "name": "蚌山区",
            "id": "340303"
          },
          {
            "level": 3,
            "name": "禹会区",
            "id": "340304"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "340305"
          },
          {
            "level": 3,
            "name": "淮上区",
            "id": "340311"
          },
          {
            "level": 3,
            "name": "怀远县",
            "id": "340321"
          },
          {
            "level": 3,
            "name": "五河县",
            "id": "340322"
          },
          {
            "level": 3,
            "name": "固镇县",
            "id": "340323"
          }
        ]
      },
      {
        "level": 2,
        "name": "淮南市",
        "id": "340400",
        "childs": [
          {
            "level": 3,
            "name": "大通区",
            "id": "340402"
          },
          {
            "level": 3,
            "name": "田家庵区",
            "id": "340403"
          },
          {
            "level": 3,
            "name": "谢家集区",
            "id": "340404"
          },
          {
            "level": 3,
            "name": "八公山区",
            "id": "340405"
          },
          {
            "level": 3,
            "name": "潘集区",
            "id": "340406"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "340407"
          },
          {
            "level": 3,
            "name": "凤台县",
            "id": "340421"
          }
        ]
      },
      {
        "level": 2,
        "name": "马鞍山市",
        "id": "340500",
        "childs": [
          {
            "level": 3,
            "name": "金家庄区",
            "id": "340502"
          },
          {
            "level": 3,
            "name": "花山区",
            "id": "340503"
          },
          {
            "level": 3,
            "name": "雨山区",
            "id": "340504"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "340505"
          },
          {
            "level": 3,
            "name": "博望区",
            "id": "340506"
          },
          {
            "level": 3,
            "name": "当涂县",
            "id": "340521"
          },
          {
            "level": 3,
            "name": "含山县",
            "id": "341423"
          },
          {
            "level": 3,
            "name": "和县",
            "id": "341424"
          }
        ]
      },
      {
        "level": 2,
        "name": "淮北市",
        "id": "340600",
        "childs": [
          {
            "level": 3,
            "name": "杜集区",
            "id": "340602"
          },
          {
            "level": 3,
            "name": "相山区",
            "id": "340603"
          },
          {
            "level": 3,
            "name": "烈山区",
            "id": "340604"
          },
          {
            "level": 3,
            "name": "濉溪县",
            "id": "340621"
          }
        ]
      },
      {
        "level": 2,
        "name": "铜陵市",
        "id": "340700",
        "childs": [
          {
            "level": 3,
            "name": "铜官山区",
            "id": "340702"
          },
          {
            "level": 3,
            "name": "狮子山区",
            "id": "340703"
          },
          {
            "level": 3,
            "name": "郊区",
            "id": "340711"
          },
          {
            "level": 3,
            "name": "铜陵县",
            "id": "340721"
          }
        ]
      },
      {
        "level": 2,
        "name": "安庆市",
        "id": "340800",
        "childs": [
          {
            "level": 3,
            "name": "迎江区",
            "id": "340802"
          },
          {
            "level": 3,
            "name": "大观区",
            "id": "340803"
          },
          {
            "level": 3,
            "name": "宜秀区",
            "id": "340811"
          },
          {
            "level": 3,
            "name": "怀宁县",
            "id": "340822"
          },
          {
            "level": 3,
            "name": "枞阳县",
            "id": "340823"
          },
          {
            "level": 3,
            "name": "潜山县",
            "id": "340824"
          },
          {
            "level": 3,
            "name": "太湖县",
            "id": "340825"
          },
          {
            "level": 3,
            "name": "宿松县",
            "id": "340826"
          },
          {
            "level": 3,
            "name": "望江县",
            "id": "340827"
          },
          {
            "level": 3,
            "name": "岳西县",
            "id": "340828"
          },
          {
            "level": 3,
            "name": "桐城市",
            "id": "340881"
          }
        ]
      },
      {
        "level": 2,
        "name": "黄山市",
        "id": "341000",
        "childs": [
          {
            "level": 3,
            "name": "屯溪区",
            "id": "341002"
          },
          {
            "level": 3,
            "name": "黄山区",
            "id": "341003"
          },
          {
            "level": 3,
            "name": "徽州区",
            "id": "341004"
          },
          {
            "level": 3,
            "name": "歙县",
            "id": "341021"
          },
          {
            "level": 3,
            "name": "休宁县",
            "id": "341022"
          },
          {
            "level": 3,
            "name": "黟县",
            "id": "341023"
          },
          {
            "level": 3,
            "name": "祁门县",
            "id": "341024"
          }
        ]
      },
      {
        "level": 2,
        "name": "滁州市",
        "id": "341100",
        "childs": [
          {
            "level": 3,
            "name": "琅琊区",
            "id": "341102"
          },
          {
            "level": 3,
            "name": "南谯区",
            "id": "341103"
          },
          {
            "level": 3,
            "name": "来安县",
            "id": "341122"
          },
          {
            "level": 3,
            "name": "全椒县",
            "id": "341124"
          },
          {
            "level": 3,
            "name": "定远县",
            "id": "341125"
          },
          {
            "level": 3,
            "name": "凤阳县",
            "id": "341126"
          },
          {
            "level": 3,
            "name": "天长市",
            "id": "341181"
          },
          {
            "level": 3,
            "name": "明光市",
            "id": "341182"
          }
        ]
      },
      {
        "level": 2,
        "name": "阜阳市",
        "id": "341200",
        "childs": [
          {
            "level": 3,
            "name": "颍州区",
            "id": "341202"
          },
          {
            "level": 3,
            "name": "颍东区",
            "id": "341203"
          },
          {
            "level": 3,
            "name": "颍泉区",
            "id": "341204"
          },
          {
            "level": 3,
            "name": "临泉县",
            "id": "341221"
          },
          {
            "level": 3,
            "name": "太和县",
            "id": "341222"
          },
          {
            "level": 3,
            "name": "阜南县",
            "id": "341225"
          },
          {
            "level": 3,
            "name": "颍上县",
            "id": "341226"
          },
          {
            "level": 3,
            "name": "界首市",
            "id": "341282"
          }
        ]
      },
      {
        "level": 2,
        "name": "宿州市",
        "id": "341300",
        "childs": [
          {
            "level": 3,
            "name": "埇桥区",
            "id": "341302"
          },
          {
            "level": 3,
            "name": "砀山县",
            "id": "341321"
          },
          {
            "level": 3,
            "name": "萧县",
            "id": "341322"
          },
          {
            "level": 3,
            "name": "灵璧县",
            "id": "341323"
          },
          {
            "level": 3,
            "name": "泗县",
            "id": "341324"
          }
        ]
      },
      {
        "level": 2,
        "name": "六安市",
        "id": "341500",
        "childs": [
          {
            "level": 3,
            "name": "金安区",
            "id": "341502"
          },
          {
            "level": 3,
            "name": "裕安区",
            "id": "341503"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "341504"
          },
          {
            "level": 3,
            "name": "寿县",
            "id": "341521"
          },
          {
            "level": 3,
            "name": "霍邱县",
            "id": "341522"
          },
          {
            "level": 3,
            "name": "舒城县",
            "id": "341523"
          },
          {
            "level": 3,
            "name": "金寨县",
            "id": "341524"
          },
          {
            "level": 3,
            "name": "霍山县",
            "id": "341525"
          }
        ]
      },
      {
        "level": 2,
        "name": "亳州市",
        "id": "341600",
        "childs": [
          {
            "level": 3,
            "name": "谯城区",
            "id": "341602"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "341603"
          },
          {
            "level": 3,
            "name": "涡阳县",
            "id": "341621"
          },
          {
            "level": 3,
            "name": "蒙城县",
            "id": "341622"
          },
          {
            "level": 3,
            "name": "利辛县",
            "id": "341623"
          }
        ]
      },
      {
        "level": 2,
        "name": "池州市",
        "id": "341700",
        "childs": [
          {
            "level": 3,
            "name": "贵池区",
            "id": "341702"
          },
          {
            "level": 3,
            "name": "东至县",
            "id": "341721"
          },
          {
            "level": 3,
            "name": "石台县",
            "id": "341722"
          },
          {
            "level": 3,
            "name": "青阳县",
            "id": "341723"
          }
        ]
      },
      {
        "level": 2,
        "name": "宣城市",
        "id": "341800",
        "childs": [
          {
            "level": 3,
            "name": "宣州区",
            "id": "341802"
          },
          {
            "level": 3,
            "name": "郎溪县",
            "id": "341821"
          },
          {
            "level": 3,
            "name": "广德县",
            "id": "341822"
          },
          {
            "level": 3,
            "name": "泾县",
            "id": "341823"
          },
          {
            "level": 3,
            "name": "绩溪县",
            "id": "341824"
          },
          {
            "level": 3,
            "name": "旌德县",
            "id": "341825"
          },
          {
            "level": 3,
            "name": "宁国市",
            "id": "341881"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "福建省",
    "id": "350000",
    "childs": [
      {
        "level": 2,
        "name": "福州市",
        "id": "350100",
        "childs": [
          {
            "level": 3,
            "name": "鼓楼区",
            "id": "350102"
          },
          {
            "level": 3,
            "name": "台江区",
            "id": "350103"
          },
          {
            "level": 3,
            "name": "仓山区",
            "id": "350104"
          },
          {
            "level": 3,
            "name": "马尾区",
            "id": "350105"
          },
          {
            "level": 3,
            "name": "晋安区",
            "id": "350111"
          },
          {
            "level": 3,
            "name": "闽侯县",
            "id": "350121"
          },
          {
            "level": 3,
            "name": "连江县",
            "id": "350122"
          },
          {
            "level": 3,
            "name": "罗源县",
            "id": "350123"
          },
          {
            "level": 3,
            "name": "闽清县",
            "id": "350124"
          },
          {
            "level": 3,
            "name": "永泰县",
            "id": "350125"
          },
          {
            "level": 3,
            "name": "平潭县",
            "id": "350128"
          },
          {
            "level": 3,
            "name": "福清市",
            "id": "350181"
          },
          {
            "level": 3,
            "name": "长乐市",
            "id": "350182"
          }
        ]
      },
      {
        "level": 2,
        "name": "厦门市",
        "id": "350200",
        "childs": [
          {
            "level": 3,
            "name": "思明区",
            "id": "350203"
          },
          {
            "level": 3,
            "name": "海沧区",
            "id": "350205"
          },
          {
            "level": 3,
            "name": "湖里区",
            "id": "350206"
          },
          {
            "level": 3,
            "name": "集美区",
            "id": "350211"
          },
          {
            "level": 3,
            "name": "同安区",
            "id": "350212"
          },
          {
            "level": 3,
            "name": "翔安区",
            "id": "350213"
          }
        ]
      },
      {
        "level": 2,
        "name": "莆田市",
        "id": "350300",
        "childs": [
          {
            "level": 3,
            "name": "城厢区",
            "id": "350302"
          },
          {
            "level": 3,
            "name": "涵江区",
            "id": "350303"
          },
          {
            "level": 3,
            "name": "荔城区",
            "id": "350304"
          },
          {
            "level": 3,
            "name": "秀屿区",
            "id": "350305"
          },
          {
            "level": 3,
            "name": "仙游县",
            "id": "350322"
          }
        ]
      },
      {
        "level": 2,
        "name": "三明市",
        "id": "350400",
        "childs": [
          {
            "level": 3,
            "name": "梅列区",
            "id": "350402"
          },
          {
            "level": 3,
            "name": "三元区",
            "id": "350403"
          },
          {
            "level": 3,
            "name": "明溪县",
            "id": "350421"
          },
          {
            "level": 3,
            "name": "清流县",
            "id": "350423"
          },
          {
            "level": 3,
            "name": "宁化县",
            "id": "350424"
          },
          {
            "level": 3,
            "name": "大田县",
            "id": "350425"
          },
          {
            "level": 3,
            "name": "尤溪县",
            "id": "350426"
          },
          {
            "level": 3,
            "name": "沙县",
            "id": "350427"
          },
          {
            "level": 3,
            "name": "将乐县",
            "id": "350428"
          },
          {
            "level": 3,
            "name": "泰宁县",
            "id": "350429"
          },
          {
            "level": 3,
            "name": "建宁县",
            "id": "350430"
          },
          {
            "level": 3,
            "name": "永安市",
            "id": "350481"
          }
        ]
      },
      {
        "level": 2,
        "name": "泉州市",
        "id": "350500",
        "childs": [
          {
            "level": 3,
            "name": "鲤城区",
            "id": "350502"
          },
          {
            "level": 3,
            "name": "丰泽区",
            "id": "350503"
          },
          {
            "level": 3,
            "name": "洛江区",
            "id": "350504"
          },
          {
            "level": 3,
            "name": "泉港区",
            "id": "350505"
          },
          {
            "level": 3,
            "name": "惠安县",
            "id": "350521"
          },
          {
            "level": 3,
            "name": "安溪县",
            "id": "350524"
          },
          {
            "level": 3,
            "name": "永春县",
            "id": "350525"
          },
          {
            "level": 3,
            "name": "德化县",
            "id": "350526"
          },
          {
            "level": 3,
            "name": "石狮市",
            "id": "350581"
          },
          {
            "level": 3,
            "name": "晋江市",
            "id": "350582"
          },
          {
            "level": 3,
            "name": "南安市",
            "id": "350583"
          }
        ]
      },
      {
        "level": 2,
        "name": "漳州市",
        "id": "350600",
        "childs": [
          {
            "level": 3,
            "name": "芗城区",
            "id": "350602"
          },
          {
            "level": 3,
            "name": "龙文区",
            "id": "350603"
          },
          {
            "level": 3,
            "name": "云霄县",
            "id": "350622"
          },
          {
            "level": 3,
            "name": "漳浦县",
            "id": "350623"
          },
          {
            "level": 3,
            "name": "诏安县",
            "id": "350624"
          },
          {
            "level": 3,
            "name": "长泰县",
            "id": "350625"
          },
          {
            "level": 3,
            "name": "东山县",
            "id": "350626"
          },
          {
            "level": 3,
            "name": "南靖县",
            "id": "350627"
          },
          {
            "level": 3,
            "name": "平和县",
            "id": "350628"
          },
          {
            "level": 3,
            "name": "华安县",
            "id": "350629"
          },
          {
            "level": 3,
            "name": "龙海市",
            "id": "350681"
          }
        ]
      },
      {
        "level": 2,
        "name": "南平市",
        "id": "350700",
        "childs": [
          {
            "level": 3,
            "name": "延平区",
            "id": "350702"
          },
          {
            "level": 3,
            "name": "顺昌县",
            "id": "350721"
          },
          {
            "level": 3,
            "name": "浦城县",
            "id": "350722"
          },
          {
            "level": 3,
            "name": "光泽县",
            "id": "350723"
          },
          {
            "level": 3,
            "name": "松溪县",
            "id": "350724"
          },
          {
            "level": 3,
            "name": "政和县",
            "id": "350725"
          },
          {
            "level": 3,
            "name": "邵武市",
            "id": "350781"
          },
          {
            "level": 3,
            "name": "武夷山市",
            "id": "350782"
          },
          {
            "level": 3,
            "name": "建瓯市",
            "id": "350783"
          },
          {
            "level": 3,
            "name": "建阳市",
            "id": "350784"
          }
        ]
      },
      {
        "level": 2,
        "name": "龙岩市",
        "id": "350800",
        "childs": [
          {
            "level": 3,
            "name": "新罗区",
            "id": "350802"
          },
          {
            "level": 3,
            "name": "长汀县",
            "id": "350821"
          },
          {
            "level": 3,
            "name": "永定县",
            "id": "350822"
          },
          {
            "level": 3,
            "name": "上杭县",
            "id": "350823"
          },
          {
            "level": 3,
            "name": "武平县",
            "id": "350824"
          },
          {
            "level": 3,
            "name": "连城县",
            "id": "350825"
          },
          {
            "level": 3,
            "name": "漳平市",
            "id": "350881"
          }
        ]
      },
      {
        "level": 2,
        "name": "宁德市",
        "id": "350900",
        "childs": [
          {
            "level": 3,
            "name": "蕉城区",
            "id": "350902"
          },
          {
            "level": 3,
            "name": "霞浦县",
            "id": "350921"
          },
          {
            "level": 3,
            "name": "古田县",
            "id": "350922"
          },
          {
            "level": 3,
            "name": "屏南县",
            "id": "350923"
          },
          {
            "level": 3,
            "name": "寿宁县",
            "id": "350924"
          },
          {
            "level": 3,
            "name": "周宁县",
            "id": "350925"
          },
          {
            "level": 3,
            "name": "柘荣县",
            "id": "350926"
          },
          {
            "level": 3,
            "name": "福安市",
            "id": "350981"
          },
          {
            "level": 3,
            "name": "福鼎市",
            "id": "350982"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "江西省",
    "id": "360000",
    "childs": [
      {
        "level": 2,
        "name": "南昌市",
        "id": "360100",
        "childs": [
          {
            "level": 3,
            "name": "东湖区",
            "id": "360102"
          },
          {
            "level": 3,
            "name": "西湖区",
            "id": "360103"
          },
          {
            "level": 3,
            "name": "青云谱区",
            "id": "360104"
          },
          {
            "level": 3,
            "name": "湾里区",
            "id": "360105"
          },
          {
            "level": 3,
            "name": "青山湖区",
            "id": "360111"
          },
          {
            "level": 3,
            "name": "南昌县",
            "id": "360121"
          },
          {
            "level": 3,
            "name": "新建县",
            "id": "360122"
          },
          {
            "level": 3,
            "name": "安义县",
            "id": "360123"
          },
          {
            "level": 3,
            "name": "进贤县",
            "id": "360124"
          },
          {
            "level": 3,
            "name": "红谷滩新区",
            "id": "360125"
          },
          {
            "level": 3,
            "name": "经济技术开发区",
            "id": "360126"
          }
        ]
      },
      {
        "level": 2,
        "name": "景德镇市",
        "id": "360200",
        "childs": [
          {
            "level": 3,
            "name": "昌江区",
            "id": "360202"
          },
          {
            "level": 3,
            "name": "珠山区",
            "id": "360203"
          },
          {
            "level": 3,
            "name": "浮梁县",
            "id": "360222"
          },
          {
            "level": 3,
            "name": "乐平市",
            "id": "360281"
          }
        ]
      },
      {
        "level": 2,
        "name": "萍乡市",
        "id": "360300",
        "childs": [
          {
            "level": 3,
            "name": "安源区",
            "id": "360302"
          },
          {
            "level": 3,
            "name": "湘东区",
            "id": "360313"
          },
          {
            "level": 3,
            "name": "莲花县",
            "id": "360321"
          },
          {
            "level": 3,
            "name": "上栗县",
            "id": "360322"
          },
          {
            "level": 3,
            "name": "芦溪县",
            "id": "360323"
          }
        ]
      },
      {
        "level": 2,
        "name": "九江市",
        "id": "360400",
        "childs": [
          {
            "level": 3,
            "name": "庐山区",
            "id": "360402"
          },
          {
            "level": 3,
            "name": "浔阳区",
            "id": "360403"
          },
          {
            "level": 3,
            "name": "九江县",
            "id": "360421"
          },
          {
            "level": 3,
            "name": "武宁县",
            "id": "360423"
          },
          {
            "level": 3,
            "name": "修水县",
            "id": "360424"
          },
          {
            "level": 3,
            "name": "永修县",
            "id": "360425"
          },
          {
            "level": 3,
            "name": "德安县",
            "id": "360426"
          },
          {
            "level": 3,
            "name": "星子县",
            "id": "360427"
          },
          {
            "level": 3,
            "name": "都昌县",
            "id": "360428"
          },
          {
            "level": 3,
            "name": "湖口县",
            "id": "360429"
          },
          {
            "level": 3,
            "name": "彭泽县",
            "id": "360430"
          },
          {
            "level": 3,
            "name": "瑞昌市",
            "id": "360481"
          },
          {
            "level": 3,
            "name": "共青城市",
            "id": "360482"
          }
        ]
      },
      {
        "level": 2,
        "name": "新余市",
        "id": "360500",
        "childs": [
          {
            "level": 3,
            "name": "渝水区",
            "id": "360502"
          },
          {
            "level": 3,
            "name": "分宜县",
            "id": "360521"
          }
        ]
      },
      {
        "level": 2,
        "name": "鹰潭市",
        "id": "360600",
        "childs": [
          {
            "level": 3,
            "name": "月湖区",
            "id": "360602"
          },
          {
            "level": 3,
            "name": "余江县",
            "id": "360622"
          },
          {
            "level": 3,
            "name": "贵溪市",
            "id": "360681"
          }
        ]
      },
      {
        "level": 2,
        "name": "赣州市",
        "id": "360700",
        "childs": [
          {
            "level": 3,
            "name": "章贡区",
            "id": "360702"
          },
          {
            "level": 3,
            "name": "赣县",
            "id": "360721"
          },
          {
            "level": 3,
            "name": "信丰县",
            "id": "360722"
          },
          {
            "level": 3,
            "name": "大余县",
            "id": "360723"
          },
          {
            "level": 3,
            "name": "上犹县",
            "id": "360724"
          },
          {
            "level": 3,
            "name": "崇义县",
            "id": "360725"
          },
          {
            "level": 3,
            "name": "安远县",
            "id": "360726"
          },
          {
            "level": 3,
            "name": "龙南县",
            "id": "360727"
          },
          {
            "level": 3,
            "name": "定南县",
            "id": "360728"
          },
          {
            "level": 3,
            "name": "全南县",
            "id": "360729"
          },
          {
            "level": 3,
            "name": "宁都县",
            "id": "360730"
          },
          {
            "level": 3,
            "name": "于都县",
            "id": "360731"
          },
          {
            "level": 3,
            "name": "兴国县",
            "id": "360732"
          },
          {
            "level": 3,
            "name": "会昌县",
            "id": "360733"
          },
          {
            "level": 3,
            "name": "寻乌县",
            "id": "360734"
          },
          {
            "level": 3,
            "name": "石城县",
            "id": "360735"
          },
          {
            "level": 3,
            "name": "黄金区",
            "id": "360751"
          },
          {
            "level": 3,
            "name": "瑞金市",
            "id": "360781"
          },
          {
            "level": 3,
            "name": "南康市",
            "id": "360782"
          }
        ]
      },
      {
        "level": 2,
        "name": "吉安市",
        "id": "360800",
        "childs": [
          {
            "level": 3,
            "name": "吉州区",
            "id": "360802"
          },
          {
            "level": 3,
            "name": "青原区",
            "id": "360803"
          },
          {
            "level": 3,
            "name": "吉安县",
            "id": "360821"
          },
          {
            "level": 3,
            "name": "吉水县",
            "id": "360822"
          },
          {
            "level": 3,
            "name": "峡江县",
            "id": "360823"
          },
          {
            "level": 3,
            "name": "新干县",
            "id": "360824"
          },
          {
            "level": 3,
            "name": "永丰县",
            "id": "360825"
          },
          {
            "level": 3,
            "name": "泰和县",
            "id": "360826"
          },
          {
            "level": 3,
            "name": "遂川县",
            "id": "360827"
          },
          {
            "level": 3,
            "name": "万安县",
            "id": "360828"
          },
          {
            "level": 3,
            "name": "安福县",
            "id": "360829"
          },
          {
            "level": 3,
            "name": "永新县",
            "id": "360830"
          },
          {
            "level": 3,
            "name": "井冈山市",
            "id": "360881"
          }
        ]
      },
      {
        "level": 2,
        "name": "宜春市",
        "id": "360900",
        "childs": [
          {
            "level": 3,
            "name": "袁州区",
            "id": "360902"
          },
          {
            "level": 3,
            "name": "奉新县",
            "id": "360921"
          },
          {
            "level": 3,
            "name": "万载县",
            "id": "360922"
          },
          {
            "level": 3,
            "name": "上高县",
            "id": "360923"
          },
          {
            "level": 3,
            "name": "宜丰县",
            "id": "360924"
          },
          {
            "level": 3,
            "name": "靖安县",
            "id": "360925"
          },
          {
            "level": 3,
            "name": "铜鼓县",
            "id": "360926"
          },
          {
            "level": 3,
            "name": "丰城市",
            "id": "360981"
          },
          {
            "level": 3,
            "name": "樟树市",
            "id": "360982"
          },
          {
            "level": 3,
            "name": "高安市",
            "id": "360983"
          }
        ]
      },
      {
        "level": 2,
        "name": "抚州市",
        "id": "361000",
        "childs": [
          {
            "level": 3,
            "name": "临川区",
            "id": "361002"
          },
          {
            "level": 3,
            "name": "南城县",
            "id": "361021"
          },
          {
            "level": 3,
            "name": "黎川县",
            "id": "361022"
          },
          {
            "level": 3,
            "name": "南丰县",
            "id": "361023"
          },
          {
            "level": 3,
            "name": "崇仁县",
            "id": "361024"
          },
          {
            "level": 3,
            "name": "乐安县",
            "id": "361025"
          },
          {
            "level": 3,
            "name": "宜黄县",
            "id": "361026"
          },
          {
            "level": 3,
            "name": "金溪县",
            "id": "361027"
          },
          {
            "level": 3,
            "name": "资溪县",
            "id": "361028"
          },
          {
            "level": 3,
            "name": "东乡县",
            "id": "361029"
          },
          {
            "level": 3,
            "name": "广昌县",
            "id": "361030"
          }
        ]
      },
      {
        "level": 2,
        "name": "上饶市",
        "id": "361100",
        "childs": [
          {
            "level": 3,
            "name": "信州区",
            "id": "361102"
          },
          {
            "level": 3,
            "name": "上饶县",
            "id": "361121"
          },
          {
            "level": 3,
            "name": "广丰县",
            "id": "361122"
          },
          {
            "level": 3,
            "name": "玉山县",
            "id": "361123"
          },
          {
            "level": 3,
            "name": "铅山县",
            "id": "361124"
          },
          {
            "level": 3,
            "name": "横峰县",
            "id": "361125"
          },
          {
            "level": 3,
            "name": "弋阳县",
            "id": "361126"
          },
          {
            "level": 3,
            "name": "余干县",
            "id": "361127"
          },
          {
            "level": 3,
            "name": "鄱阳县",
            "id": "361128"
          },
          {
            "level": 3,
            "name": "万年县",
            "id": "361129"
          },
          {
            "level": 3,
            "name": "婺源县",
            "id": "361130"
          },
          {
            "level": 3,
            "name": "德兴市",
            "id": "361181"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "山东省",
    "id": "370000",
    "childs": [
      {
        "level": 2,
        "name": "济南市",
        "id": "370100",
        "childs": [
          {
            "level": 3,
            "name": "历下区",
            "id": "370102"
          },
          {
            "level": 3,
            "name": "市中区",
            "id": "370103"
          },
          {
            "level": 3,
            "name": "槐荫区",
            "id": "370104"
          },
          {
            "level": 3,
            "name": "天桥区",
            "id": "370105"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "370106"
          },
          {
            "level": 3,
            "name": "历城区",
            "id": "370112"
          },
          {
            "level": 3,
            "name": "长清区",
            "id": "370113"
          },
          {
            "level": 3,
            "name": "平阴县",
            "id": "370124"
          },
          {
            "level": 3,
            "name": "济阳县",
            "id": "370125"
          },
          {
            "level": 3,
            "name": "商河县",
            "id": "370126"
          },
          {
            "level": 3,
            "name": "章丘市",
            "id": "370181"
          }
        ]
      },
      {
        "level": 2,
        "name": "青岛市",
        "id": "370200",
        "childs": [
          {
            "level": 3,
            "name": "市南区",
            "id": "370202"
          },
          {
            "level": 3,
            "name": "市北区",
            "id": "370203"
          },
          {
            "level": 3,
            "name": "四方区",
            "id": "370205"
          },
          {
            "level": 3,
            "name": "黄岛区",
            "id": "370211"
          },
          {
            "level": 3,
            "name": "崂山区",
            "id": "370212"
          },
          {
            "level": 3,
            "name": "李沧区",
            "id": "370213"
          },
          {
            "level": 3,
            "name": "城阳区",
            "id": "370214"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "370251"
          },
          {
            "level": 3,
            "name": "胶州市",
            "id": "370281"
          },
          {
            "level": 3,
            "name": "即墨市",
            "id": "370282"
          },
          {
            "level": 3,
            "name": "平度市",
            "id": "370283"
          },
          {
            "level": 3,
            "name": "胶南市",
            "id": "370284"
          },
          {
            "level": 3,
            "name": "莱西市",
            "id": "370285"
          }
        ]
      },
      {
        "level": 2,
        "name": "淄博市",
        "id": "370300",
        "childs": [
          {
            "level": 3,
            "name": "淄川区",
            "id": "370302"
          },
          {
            "level": 3,
            "name": "张店区",
            "id": "370303"
          },
          {
            "level": 3,
            "name": "博山区",
            "id": "370304"
          },
          {
            "level": 3,
            "name": "临淄区",
            "id": "370305"
          },
          {
            "level": 3,
            "name": "周村区",
            "id": "370306"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "370307"
          },
          {
            "level": 3,
            "name": "桓台县",
            "id": "370321"
          },
          {
            "level": 3,
            "name": "高青县",
            "id": "370322"
          },
          {
            "level": 3,
            "name": "沂源县",
            "id": "370323"
          }
        ]
      },
      {
        "level": 2,
        "name": "枣庄市",
        "id": "370400",
        "childs": [
          {
            "level": 3,
            "name": "市中区",
            "id": "370402"
          },
          {
            "level": 3,
            "name": "薛城区",
            "id": "370403"
          },
          {
            "level": 3,
            "name": "峄城区",
            "id": "370404"
          },
          {
            "level": 3,
            "name": "台儿庄区",
            "id": "370405"
          },
          {
            "level": 3,
            "name": "山亭区",
            "id": "370406"
          },
          {
            "level": 3,
            "name": "滕州市",
            "id": "370481"
          }
        ]
      },
      {
        "level": 2,
        "name": "东营市",
        "id": "370500",
        "childs": [
          {
            "level": 3,
            "name": "东营区",
            "id": "370502"
          },
          {
            "level": 3,
            "name": "河口区",
            "id": "370503"
          },
          {
            "level": 3,
            "name": "垦利县",
            "id": "370521"
          },
          {
            "level": 3,
            "name": "利津县",
            "id": "370522"
          },
          {
            "level": 3,
            "name": "广饶县",
            "id": "370523"
          },
          {
            "level": 3,
            "name": "西城区",
            "id": "370589"
          },
          {
            "level": 3,
            "name": "东城区",
            "id": "370590"
          }
        ]
      },
      {
        "level": 2,
        "name": "烟台市",
        "id": "370600",
        "childs": [
          {
            "level": 3,
            "name": "芝罘区",
            "id": "370602"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "370603"
          },
          {
            "level": 3,
            "name": "福山区",
            "id": "370611"
          },
          {
            "level": 3,
            "name": "牟平区",
            "id": "370612"
          },
          {
            "level": 3,
            "name": "莱山区",
            "id": "370613"
          },
          {
            "level": 3,
            "name": "长岛县",
            "id": "370634"
          },
          {
            "level": 3,
            "name": "龙口市",
            "id": "370681"
          },
          {
            "level": 3,
            "name": "莱阳市",
            "id": "370682"
          },
          {
            "level": 3,
            "name": "莱州市",
            "id": "370683"
          },
          {
            "level": 3,
            "name": "蓬莱市",
            "id": "370684"
          },
          {
            "level": 3,
            "name": "招远市",
            "id": "370685"
          },
          {
            "level": 3,
            "name": "栖霞市",
            "id": "370686"
          },
          {
            "level": 3,
            "name": "海阳市",
            "id": "370687"
          }
        ]
      },
      {
        "level": 2,
        "name": "潍坊市",
        "id": "370700",
        "childs": [
          {
            "level": 3,
            "name": "潍城区",
            "id": "370702"
          },
          {
            "level": 3,
            "name": "寒亭区",
            "id": "370703"
          },
          {
            "level": 3,
            "name": "坊子区",
            "id": "370704"
          },
          {
            "level": 3,
            "name": "奎文区",
            "id": "370705"
          },
          {
            "level": 3,
            "name": "临朐县",
            "id": "370724"
          },
          {
            "level": 3,
            "name": "昌乐县",
            "id": "370725"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "370751"
          },
          {
            "level": 3,
            "name": "青州市",
            "id": "370781"
          },
          {
            "level": 3,
            "name": "诸城市",
            "id": "370782"
          },
          {
            "level": 3,
            "name": "寿光市",
            "id": "370783"
          },
          {
            "level": 3,
            "name": "安丘市",
            "id": "370784"
          },
          {
            "level": 3,
            "name": "高密市",
            "id": "370785"
          },
          {
            "level": 3,
            "name": "昌邑市",
            "id": "370786"
          }
        ]
      },
      {
        "level": 2,
        "name": "济宁市",
        "id": "370800",
        "childs": [
          {
            "level": 3,
            "name": "市中区",
            "id": "370802"
          },
          {
            "level": 3,
            "name": "任城区",
            "id": "370811"
          },
          {
            "level": 3,
            "name": "微山县",
            "id": "370826"
          },
          {
            "level": 3,
            "name": "鱼台县",
            "id": "370827"
          },
          {
            "level": 3,
            "name": "金乡县",
            "id": "370828"
          },
          {
            "level": 3,
            "name": "嘉祥县",
            "id": "370829"
          },
          {
            "level": 3,
            "name": "汶上县",
            "id": "370830"
          },
          {
            "level": 3,
            "name": "泗水县",
            "id": "370831"
          },
          {
            "level": 3,
            "name": "梁山县",
            "id": "370832"
          },
          {
            "level": 3,
            "name": "曲阜市",
            "id": "370881"
          },
          {
            "level": 3,
            "name": "兖州市",
            "id": "370882"
          },
          {
            "level": 3,
            "name": "邹城市",
            "id": "370883"
          }
        ]
      },
      {
        "level": 2,
        "name": "泰安市",
        "id": "370900",
        "childs": [
          {
            "level": 3,
            "name": "泰山区",
            "id": "370902"
          },
          {
            "level": 3,
            "name": "岱岳区",
            "id": "370903"
          },
          {
            "level": 3,
            "name": "宁阳县",
            "id": "370921"
          },
          {
            "level": 3,
            "name": "东平县",
            "id": "370923"
          },
          {
            "level": 3,
            "name": "新泰市",
            "id": "370982"
          },
          {
            "level": 3,
            "name": "肥城市",
            "id": "370983"
          }
        ]
      },
      {
        "level": 2,
        "name": "威海市",
        "id": "371000",
        "childs": [
          {
            "level": 3,
            "name": "环翠区",
            "id": "371002"
          },
          {
            "level": 3,
            "name": "文登市",
            "id": "371081"
          },
          {
            "level": 3,
            "name": "荣成市",
            "id": "371082"
          },
          {
            "level": 3,
            "name": "乳山市",
            "id": "371083"
          }
        ]
      },
      {
        "level": 2,
        "name": "日照市",
        "id": "371100",
        "childs": [
          {
            "level": 3,
            "name": "东港区",
            "id": "371102"
          },
          {
            "level": 3,
            "name": "岚山区",
            "id": "371103"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "371104"
          },
          {
            "level": 3,
            "name": "五莲县",
            "id": "371121"
          },
          {
            "level": 3,
            "name": "莒县",
            "id": "371122"
          }
        ]
      },
      {
        "level": 2,
        "name": "莱芜市",
        "id": "371200",
        "childs": [
          {
            "level": 3,
            "name": "莱城区",
            "id": "371202"
          },
          {
            "level": 3,
            "name": "钢城区",
            "id": "371203"
          }
        ]
      },
      {
        "level": 2,
        "name": "临沂市",
        "id": "371300",
        "childs": [
          {
            "level": 3,
            "name": "兰山区",
            "id": "371302"
          },
          {
            "level": 3,
            "name": "罗庄区",
            "id": "371311"
          },
          {
            "level": 3,
            "name": "河东区",
            "id": "371312"
          },
          {
            "level": 3,
            "name": "沂南县",
            "id": "371321"
          },
          {
            "level": 3,
            "name": "郯城县",
            "id": "371322"
          },
          {
            "level": 3,
            "name": "沂水县",
            "id": "371323"
          },
          {
            "level": 3,
            "name": "苍山县",
            "id": "371324"
          },
          {
            "level": 3,
            "name": "费县",
            "id": "371325"
          },
          {
            "level": 3,
            "name": "平邑县",
            "id": "371326"
          },
          {
            "level": 3,
            "name": "莒南县",
            "id": "371327"
          },
          {
            "level": 3,
            "name": "蒙阴县",
            "id": "371328"
          },
          {
            "level": 3,
            "name": "临沭县",
            "id": "371329"
          }
        ]
      },
      {
        "level": 2,
        "name": "德州市",
        "id": "371400",
        "childs": [
          {
            "level": 3,
            "name": "德城区",
            "id": "371402"
          },
          {
            "level": 3,
            "name": "陵县",
            "id": "371421"
          },
          {
            "level": 3,
            "name": "宁津县",
            "id": "371422"
          },
          {
            "level": 3,
            "name": "庆云县",
            "id": "371423"
          },
          {
            "level": 3,
            "name": "临邑县",
            "id": "371424"
          },
          {
            "level": 3,
            "name": "齐河县",
            "id": "371425"
          },
          {
            "level": 3,
            "name": "平原县",
            "id": "371426"
          },
          {
            "level": 3,
            "name": "夏津县",
            "id": "371427"
          },
          {
            "level": 3,
            "name": "武城县",
            "id": "371428"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "371451"
          },
          {
            "level": 3,
            "name": "乐陵市",
            "id": "371481"
          },
          {
            "level": 3,
            "name": "禹城市",
            "id": "371482"
          }
        ]
      },
      {
        "level": 2,
        "name": "聊城市",
        "id": "371500",
        "childs": [
          {
            "level": 3,
            "name": "东昌府区",
            "id": "371502"
          },
          {
            "level": 3,
            "name": "阳谷县",
            "id": "371521"
          },
          {
            "level": 3,
            "name": "莘县",
            "id": "371522"
          },
          {
            "level": 3,
            "name": "茌平县",
            "id": "371523"
          },
          {
            "level": 3,
            "name": "东阿县",
            "id": "371524"
          },
          {
            "level": 3,
            "name": "冠县",
            "id": "371525"
          },
          {
            "level": 3,
            "name": "高唐县",
            "id": "371526"
          },
          {
            "level": 3,
            "name": "临清市",
            "id": "371581"
          }
        ]
      },
      {
        "level": 2,
        "name": "滨州市",
        "id": "371600",
        "childs": [
          {
            "level": 3,
            "name": "滨城区",
            "id": "371602"
          },
          {
            "level": 3,
            "name": "惠民县",
            "id": "371621"
          },
          {
            "level": 3,
            "name": "阳信县",
            "id": "371622"
          },
          {
            "level": 3,
            "name": "无棣县",
            "id": "371623"
          },
          {
            "level": 3,
            "name": "沾化县",
            "id": "371624"
          },
          {
            "level": 3,
            "name": "博兴县",
            "id": "371625"
          },
          {
            "level": 3,
            "name": "邹平县",
            "id": "371626"
          }
        ]
      },
      {
        "level": 2,
        "name": "菏泽市",
        "id": "371700",
        "childs": [
          {
            "level": 3,
            "name": "牡丹区",
            "id": "371702"
          },
          {
            "level": 3,
            "name": "曹县",
            "id": "371721"
          },
          {
            "level": 3,
            "name": "单县",
            "id": "371722"
          },
          {
            "level": 3,
            "name": "成武县",
            "id": "371723"
          },
          {
            "level": 3,
            "name": "巨野县",
            "id": "371724"
          },
          {
            "level": 3,
            "name": "郓城县",
            "id": "371725"
          },
          {
            "level": 3,
            "name": "鄄城县",
            "id": "371726"
          },
          {
            "level": 3,
            "name": "定陶县",
            "id": "371727"
          },
          {
            "level": 3,
            "name": "东明县",
            "id": "371728"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "河南省",
    "id": "410000",
    "childs": [
      {
        "level": 2,
        "name": "郑州市",
        "id": "410100",
        "childs": [
          {
            "level": 3,
            "name": "中原区",
            "id": "410102"
          },
          {
            "level": 3,
            "name": "二七区",
            "id": "410103"
          },
          {
            "level": 3,
            "name": "管城回族区",
            "id": "410104"
          },
          {
            "level": 3,
            "name": "金水区",
            "id": "410105"
          },
          {
            "level": 3,
            "name": "上街区",
            "id": "410106"
          },
          {
            "level": 3,
            "name": "惠济区",
            "id": "410108"
          },
          {
            "level": 3,
            "name": "中牟县",
            "id": "410122"
          },
          {
            "level": 3,
            "name": "巩义市",
            "id": "410181"
          },
          {
            "level": 3,
            "name": "荥阳市",
            "id": "410182"
          },
          {
            "level": 3,
            "name": "新密市",
            "id": "410183"
          },
          {
            "level": 3,
            "name": "新郑市",
            "id": "410184"
          },
          {
            "level": 3,
            "name": "登封市",
            "id": "410185"
          },
          {
            "level": 3,
            "name": "郑东新区",
            "id": "410186"
          },
          {
            "level": 3,
            "name": "高新区",
            "id": "410187"
          },
          {
            "level": 3,
            "name": "航空港区",
            "id": "410188"
          }
        ]
      },
      {
        "level": 2,
        "name": "开封市",
        "id": "410200",
        "childs": [
          {
            "level": 3,
            "name": "龙亭区",
            "id": "410202"
          },
          {
            "level": 3,
            "name": "顺河回族区",
            "id": "410203"
          },
          {
            "level": 3,
            "name": "鼓楼区",
            "id": "410204"
          },
          {
            "level": 3,
            "name": "禹王台区",
            "id": "410205"
          },
          {
            "level": 3,
            "name": "金明区",
            "id": "410211"
          },
          {
            "level": 3,
            "name": "杞县",
            "id": "410221"
          },
          {
            "level": 3,
            "name": "通许县",
            "id": "410222"
          },
          {
            "level": 3,
            "name": "尉氏县",
            "id": "410223"
          },
          {
            "level": 3,
            "name": "开封县",
            "id": "410224"
          },
          {
            "level": 3,
            "name": "兰考县",
            "id": "410225"
          }
        ]
      },
      {
        "level": 2,
        "name": "洛阳市",
        "id": "410300",
        "childs": [
          {
            "level": 3,
            "name": "老城区",
            "id": "410302"
          },
          {
            "level": 3,
            "name": "西工区",
            "id": "410303"
          },
          {
            "level": 3,
            "name": "瀍河回族区",
            "id": "410304"
          },
          {
            "level": 3,
            "name": "涧西区",
            "id": "410305"
          },
          {
            "level": 3,
            "name": "吉利区",
            "id": "410306"
          },
          {
            "level": 3,
            "name": "洛龙区",
            "id": "410307"
          },
          {
            "level": 3,
            "name": "孟津县",
            "id": "410322"
          },
          {
            "level": 3,
            "name": "新安县",
            "id": "410323"
          },
          {
            "level": 3,
            "name": "栾川县",
            "id": "410324"
          },
          {
            "level": 3,
            "name": "嵩县",
            "id": "410325"
          },
          {
            "level": 3,
            "name": "汝阳县",
            "id": "410326"
          },
          {
            "level": 3,
            "name": "宜阳县",
            "id": "410327"
          },
          {
            "level": 3,
            "name": "洛宁县",
            "id": "410328"
          },
          {
            "level": 3,
            "name": "伊川县",
            "id": "410329"
          },
          {
            "level": 3,
            "name": "偃师市",
            "id": "410381"
          },
          {
            "level": 3,
            "name": "高新区",
            "id": "471004"
          }
        ]
      },
      {
        "level": 2,
        "name": "平顶山市",
        "id": "410400",
        "childs": [
          {
            "level": 3,
            "name": "新华区",
            "id": "410402"
          },
          {
            "level": 3,
            "name": "卫东区",
            "id": "410403"
          },
          {
            "level": 3,
            "name": "石龙区",
            "id": "410404"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "410405"
          },
          {
            "level": 3,
            "name": "湛河区",
            "id": "410411"
          },
          {
            "level": 3,
            "name": "宝丰县",
            "id": "410421"
          },
          {
            "level": 3,
            "name": "叶县",
            "id": "410422"
          },
          {
            "level": 3,
            "name": "鲁山县",
            "id": "410423"
          },
          {
            "level": 3,
            "name": "郏县",
            "id": "410425"
          },
          {
            "level": 3,
            "name": "舞钢市",
            "id": "410481"
          },
          {
            "level": 3,
            "name": "汝州市",
            "id": "410482"
          }
        ]
      },
      {
        "level": 2,
        "name": "安阳市",
        "id": "410500",
        "childs": [
          {
            "level": 3,
            "name": "文峰区",
            "id": "410502"
          },
          {
            "level": 3,
            "name": "北关区",
            "id": "410503"
          },
          {
            "level": 3,
            "name": "殷都区",
            "id": "410505"
          },
          {
            "level": 3,
            "name": "龙安区",
            "id": "410506"
          },
          {
            "level": 3,
            "name": "安阳县",
            "id": "410522"
          },
          {
            "level": 3,
            "name": "汤阴县",
            "id": "410523"
          },
          {
            "level": 3,
            "name": "滑县",
            "id": "410526"
          },
          {
            "level": 3,
            "name": "内黄县",
            "id": "410527"
          },
          {
            "level": 3,
            "name": "林州市",
            "id": "410581"
          }
        ]
      },
      {
        "level": 2,
        "name": "鹤壁市",
        "id": "410600",
        "childs": [
          {
            "level": 3,
            "name": "鹤山区",
            "id": "410602"
          },
          {
            "level": 3,
            "name": "山城区",
            "id": "410603"
          },
          {
            "level": 3,
            "name": "淇滨区",
            "id": "410611"
          },
          {
            "level": 3,
            "name": "浚县",
            "id": "410621"
          },
          {
            "level": 3,
            "name": "淇县",
            "id": "410622"
          }
        ]
      },
      {
        "level": 2,
        "name": "新乡市",
        "id": "410700",
        "childs": [
          {
            "level": 3,
            "name": "红旗区",
            "id": "410702"
          },
          {
            "level": 3,
            "name": "卫滨区",
            "id": "410703"
          },
          {
            "level": 3,
            "name": "凤泉区",
            "id": "410704"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "410705"
          },
          {
            "level": 3,
            "name": "牧野区",
            "id": "410711"
          },
          {
            "level": 3,
            "name": "新乡县",
            "id": "410721"
          },
          {
            "level": 3,
            "name": "获嘉县",
            "id": "410724"
          },
          {
            "level": 3,
            "name": "原阳县",
            "id": "410725"
          },
          {
            "level": 3,
            "name": "延津县",
            "id": "410726"
          },
          {
            "level": 3,
            "name": "封丘县",
            "id": "410727"
          },
          {
            "level": 3,
            "name": "长垣县",
            "id": "410728"
          },
          {
            "level": 3,
            "name": "卫辉市",
            "id": "410781"
          },
          {
            "level": 3,
            "name": "辉县市",
            "id": "410782"
          }
        ]
      },
      {
        "level": 2,
        "name": "焦作市",
        "id": "410800",
        "childs": [
          {
            "level": 3,
            "name": "解放区",
            "id": "410802"
          },
          {
            "level": 3,
            "name": "中站区",
            "id": "410803"
          },
          {
            "level": 3,
            "name": "马村区",
            "id": "410804"
          },
          {
            "level": 3,
            "name": "山阳区",
            "id": "410811"
          },
          {
            "level": 3,
            "name": "修武县",
            "id": "410821"
          },
          {
            "level": 3,
            "name": "博爱县",
            "id": "410822"
          },
          {
            "level": 3,
            "name": "武陟县",
            "id": "410823"
          },
          {
            "level": 3,
            "name": "温县",
            "id": "410825"
          },
          {
            "level": 3,
            "name": "沁阳市",
            "id": "410882"
          },
          {
            "level": 3,
            "name": "孟州市",
            "id": "410883"
          }
        ]
      },
      {
        "level": 2,
        "name": "济源市",
        "id": "410881",
        "childs": []
      },
      {
        "level": 2,
        "name": "濮阳市",
        "id": "410900",
        "childs": [
          {
            "level": 3,
            "name": "华龙区",
            "id": "410902"
          },
          {
            "level": 3,
            "name": "清丰县",
            "id": "410922"
          },
          {
            "level": 3,
            "name": "南乐县",
            "id": "410923"
          },
          {
            "level": 3,
            "name": "范县",
            "id": "410926"
          },
          {
            "level": 3,
            "name": "台前县",
            "id": "410927"
          },
          {
            "level": 3,
            "name": "濮阳县",
            "id": "410928"
          }
        ]
      },
      {
        "level": 2,
        "name": "许昌市",
        "id": "411000",
        "childs": [
          {
            "level": 3,
            "name": "魏都区",
            "id": "411002"
          },
          {
            "level": 3,
            "name": "许昌县",
            "id": "411023"
          },
          {
            "level": 3,
            "name": "鄢陵县",
            "id": "411024"
          },
          {
            "level": 3,
            "name": "襄城县",
            "id": "411025"
          },
          {
            "level": 3,
            "name": "禹州市",
            "id": "411081"
          },
          {
            "level": 3,
            "name": "长葛市",
            "id": "411082"
          }
        ]
      },
      {
        "level": 2,
        "name": "漯河市",
        "id": "411100",
        "childs": [
          {
            "level": 3,
            "name": "源汇区",
            "id": "411102"
          },
          {
            "level": 3,
            "name": "郾城区",
            "id": "411103"
          },
          {
            "level": 3,
            "name": "召陵区",
            "id": "411104"
          },
          {
            "level": 3,
            "name": "舞阳县",
            "id": "411121"
          },
          {
            "level": 3,
            "name": "临颍县",
            "id": "411122"
          }
        ]
      },
      {
        "level": 2,
        "name": "三门峡市",
        "id": "411200",
        "childs": [
          {
            "level": 3,
            "name": "湖滨区",
            "id": "411202"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "411203"
          },
          {
            "level": 3,
            "name": "渑池县",
            "id": "411221"
          },
          {
            "level": 3,
            "name": "陕县",
            "id": "411222"
          },
          {
            "level": 3,
            "name": "卢氏县",
            "id": "411224"
          },
          {
            "level": 3,
            "name": "义马市",
            "id": "411281"
          },
          {
            "level": 3,
            "name": "灵宝市",
            "id": "411282"
          }
        ]
      },
      {
        "level": 2,
        "name": "南阳市",
        "id": "411300",
        "childs": [
          {
            "level": 3,
            "name": "宛城区",
            "id": "411302"
          },
          {
            "level": 3,
            "name": "卧龙区",
            "id": "411303"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "411304"
          },
          {
            "level": 3,
            "name": "南召县",
            "id": "411321"
          },
          {
            "level": 3,
            "name": "方城县",
            "id": "411322"
          },
          {
            "level": 3,
            "name": "西峡县",
            "id": "411323"
          },
          {
            "level": 3,
            "name": "镇平县",
            "id": "411324"
          },
          {
            "level": 3,
            "name": "内乡县",
            "id": "411325"
          },
          {
            "level": 3,
            "name": "淅川县",
            "id": "411326"
          },
          {
            "level": 3,
            "name": "社旗县",
            "id": "411327"
          },
          {
            "level": 3,
            "name": "唐河县",
            "id": "411328"
          },
          {
            "level": 3,
            "name": "新野县",
            "id": "411329"
          },
          {
            "level": 3,
            "name": "桐柏县",
            "id": "411330"
          },
          {
            "level": 3,
            "name": "邓州市",
            "id": "411381"
          }
        ]
      },
      {
        "level": 2,
        "name": "商丘市",
        "id": "411400",
        "childs": [
          {
            "level": 3,
            "name": "梁园区",
            "id": "411402"
          },
          {
            "level": 3,
            "name": "睢阳区",
            "id": "411403"
          },
          {
            "level": 3,
            "name": "民权县",
            "id": "411421"
          },
          {
            "level": 3,
            "name": "睢县",
            "id": "411422"
          },
          {
            "level": 3,
            "name": "宁陵县",
            "id": "411423"
          },
          {
            "level": 3,
            "name": "柘城县",
            "id": "411424"
          },
          {
            "level": 3,
            "name": "虞城县",
            "id": "411425"
          },
          {
            "level": 3,
            "name": "夏邑县",
            "id": "411426"
          },
          {
            "level": 3,
            "name": "永城市",
            "id": "411481"
          }
        ]
      },
      {
        "level": 2,
        "name": "信阳市",
        "id": "411500",
        "childs": [
          {
            "level": 3,
            "name": "浉河区",
            "id": "411502"
          },
          {
            "level": 3,
            "name": "平桥区",
            "id": "411503"
          },
          {
            "level": 3,
            "name": "罗山县",
            "id": "411521"
          },
          {
            "level": 3,
            "name": "光山县",
            "id": "411522"
          },
          {
            "level": 3,
            "name": "新县",
            "id": "411523"
          },
          {
            "level": 3,
            "name": "商城县",
            "id": "411524"
          },
          {
            "level": 3,
            "name": "固始县",
            "id": "411525"
          },
          {
            "level": 3,
            "name": "潢川县",
            "id": "411526"
          },
          {
            "level": 3,
            "name": "淮滨县",
            "id": "411527"
          },
          {
            "level": 3,
            "name": "息县",
            "id": "411528"
          }
        ]
      },
      {
        "level": 2,
        "name": "周口市",
        "id": "411600",
        "childs": [
          {
            "level": 3,
            "name": "川汇区",
            "id": "411602"
          },
          {
            "level": 3,
            "name": "扶沟县",
            "id": "411621"
          },
          {
            "level": 3,
            "name": "西华县",
            "id": "411622"
          },
          {
            "level": 3,
            "name": "商水县",
            "id": "411623"
          },
          {
            "level": 3,
            "name": "沈丘县",
            "id": "411624"
          },
          {
            "level": 3,
            "name": "郸城县",
            "id": "411625"
          },
          {
            "level": 3,
            "name": "淮阳县",
            "id": "411626"
          },
          {
            "level": 3,
            "name": "太康县",
            "id": "411627"
          },
          {
            "level": 3,
            "name": "鹿邑县",
            "id": "411628"
          },
          {
            "level": 3,
            "name": "项城市",
            "id": "411681"
          }
        ]
      },
      {
        "level": 2,
        "name": "驻马店市",
        "id": "411700",
        "childs": [
          {
            "level": 3,
            "name": "驿城区",
            "id": "411702"
          },
          {
            "level": 3,
            "name": "西平县",
            "id": "411721"
          },
          {
            "level": 3,
            "name": "上蔡县",
            "id": "411722"
          },
          {
            "level": 3,
            "name": "平舆县",
            "id": "411723"
          },
          {
            "level": 3,
            "name": "正阳县",
            "id": "411724"
          },
          {
            "level": 3,
            "name": "确山县",
            "id": "411725"
          },
          {
            "level": 3,
            "name": "泌阳县",
            "id": "411726"
          },
          {
            "level": 3,
            "name": "汝南县",
            "id": "411727"
          },
          {
            "level": 3,
            "name": "遂平县",
            "id": "411728"
          },
          {
            "level": 3,
            "name": "新蔡县",
            "id": "411729"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "湖北省",
    "id": "420000",
    "childs": [
      {
        "level": 2,
        "name": "武汉市",
        "id": "420100",
        "childs": [
          {
            "level": 3,
            "name": "江岸区",
            "id": "420102"
          },
          {
            "level": 3,
            "name": "江汉区",
            "id": "420103"
          },
          {
            "level": 3,
            "name": "硚口区",
            "id": "420104"
          },
          {
            "level": 3,
            "name": "汉阳区",
            "id": "420105"
          },
          {
            "level": 3,
            "name": "武昌区",
            "id": "420106"
          },
          {
            "level": 3,
            "name": "青山区",
            "id": "420107"
          },
          {
            "level": 3,
            "name": "洪山区",
            "id": "420111"
          },
          {
            "level": 3,
            "name": "东西湖区",
            "id": "420112"
          },
          {
            "level": 3,
            "name": "汉南区",
            "id": "420113"
          },
          {
            "level": 3,
            "name": "蔡甸区",
            "id": "420114"
          },
          {
            "level": 3,
            "name": "江夏区",
            "id": "420115"
          },
          {
            "level": 3,
            "name": "黄陂区",
            "id": "420116"
          },
          {
            "level": 3,
            "name": "新洲区",
            "id": "420117"
          }
        ]
      },
      {
        "level": 2,
        "name": "黄石市",
        "id": "420200",
        "childs": [
          {
            "level": 3,
            "name": "黄石港区",
            "id": "420202"
          },
          {
            "level": 3,
            "name": "西塞山区",
            "id": "420203"
          },
          {
            "level": 3,
            "name": "下陆区",
            "id": "420204"
          },
          {
            "level": 3,
            "name": "铁山区",
            "id": "420205"
          },
          {
            "level": 3,
            "name": "阳新县",
            "id": "420222"
          },
          {
            "level": 3,
            "name": "大冶市",
            "id": "420281"
          }
        ]
      },
      {
        "level": 2,
        "name": "十堰市",
        "id": "420300",
        "childs": [
          {
            "level": 3,
            "name": "茅箭区",
            "id": "420302"
          },
          {
            "level": 3,
            "name": "张湾区",
            "id": "420303"
          },
          {
            "level": 3,
            "name": "郧县",
            "id": "420321"
          },
          {
            "level": 3,
            "name": "郧西县",
            "id": "420322"
          },
          {
            "level": 3,
            "name": "竹山县",
            "id": "420323"
          },
          {
            "level": 3,
            "name": "竹溪县",
            "id": "420324"
          },
          {
            "level": 3,
            "name": "房县",
            "id": "420325"
          },
          {
            "level": 3,
            "name": "丹江口市",
            "id": "420381"
          },
          {
            "level": 3,
            "name": "城区",
            "id": "420382"
          }
        ]
      },
      {
        "level": 2,
        "name": "宜昌市",
        "id": "420500",
        "childs": [
          {
            "level": 3,
            "name": "西陵区",
            "id": "420502"
          },
          {
            "level": 3,
            "name": "伍家岗区",
            "id": "420503"
          },
          {
            "level": 3,
            "name": "点军区",
            "id": "420504"
          },
          {
            "level": 3,
            "name": "猇亭区",
            "id": "420505"
          },
          {
            "level": 3,
            "name": "夷陵区",
            "id": "420506"
          },
          {
            "level": 3,
            "name": "远安县",
            "id": "420525"
          },
          {
            "level": 3,
            "name": "兴山县",
            "id": "420526"
          },
          {
            "level": 3,
            "name": "秭归县",
            "id": "420527"
          },
          {
            "level": 3,
            "name": "长阳土家族自治县",
            "id": "420528"
          },
          {
            "level": 3,
            "name": "五峰土家族自治县",
            "id": "420529"
          },
          {
            "level": 3,
            "name": "葛洲坝区",
            "id": "420551"
          },
          {
            "level": 3,
            "name": "开发区",
            "id": "420552"
          },
          {
            "level": 3,
            "name": "宜都市",
            "id": "420581"
          },
          {
            "level": 3,
            "name": "当阳市",
            "id": "420582"
          },
          {
            "level": 3,
            "name": "枝江市",
            "id": "420583"
          }
        ]
      },
      {
        "level": 2,
        "name": "襄阳市",
        "id": "420600",
        "childs": [
          {
            "level": 3,
            "name": "襄城区",
            "id": "420602"
          },
          {
            "level": 3,
            "name": "樊城区",
            "id": "420606"
          },
          {
            "level": 3,
            "name": "襄州区",
            "id": "420607"
          },
          {
            "level": 3,
            "name": "南漳县",
            "id": "420624"
          },
          {
            "level": 3,
            "name": "谷城县",
            "id": "420625"
          },
          {
            "level": 3,
            "name": "保康县",
            "id": "420626"
          },
          {
            "level": 3,
            "name": "老河口市",
            "id": "420682"
          },
          {
            "level": 3,
            "name": "枣阳市",
            "id": "420683"
          },
          {
            "level": 3,
            "name": "宜城市",
            "id": "420684"
          }
        ]
      },
      {
        "level": 2,
        "name": "鄂州市",
        "id": "420700",
        "childs": [
          {
            "level": 3,
            "name": "梁子湖区",
            "id": "420702"
          },
          {
            "level": 3,
            "name": "华容区",
            "id": "420703"
          },
          {
            "level": 3,
            "name": "鄂城区",
            "id": "420704"
          }
        ]
      },
      {
        "level": 2,
        "name": "荆门市",
        "id": "420800",
        "childs": [
          {
            "level": 3,
            "name": "东宝区",
            "id": "420802"
          },
          {
            "level": 3,
            "name": "掇刀区",
            "id": "420804"
          },
          {
            "level": 3,
            "name": "京山县",
            "id": "420821"
          },
          {
            "level": 3,
            "name": "沙洋县",
            "id": "420822"
          },
          {
            "level": 3,
            "name": "钟祥市",
            "id": "420881"
          }
        ]
      },
      {
        "level": 2,
        "name": "孝感市",
        "id": "420900",
        "childs": [
          {
            "level": 3,
            "name": "孝南区",
            "id": "420902"
          },
          {
            "level": 3,
            "name": "孝昌县",
            "id": "420921"
          },
          {
            "level": 3,
            "name": "大悟县",
            "id": "420922"
          },
          {
            "level": 3,
            "name": "云梦县",
            "id": "420923"
          },
          {
            "level": 3,
            "name": "应城市",
            "id": "420981"
          },
          {
            "level": 3,
            "name": "安陆市",
            "id": "420982"
          },
          {
            "level": 3,
            "name": "汉川市",
            "id": "420984"
          }
        ]
      },
      {
        "level": 2,
        "name": "荆州市",
        "id": "421000",
        "childs": [
          {
            "level": 3,
            "name": "沙市区",
            "id": "421002"
          },
          {
            "level": 3,
            "name": "荆州区",
            "id": "421003"
          },
          {
            "level": 3,
            "name": "公安县",
            "id": "421022"
          },
          {
            "level": 3,
            "name": "监利县",
            "id": "421023"
          },
          {
            "level": 3,
            "name": "江陵县",
            "id": "421024"
          },
          {
            "level": 3,
            "name": "石首市",
            "id": "421081"
          },
          {
            "level": 3,
            "name": "洪湖市",
            "id": "421083"
          },
          {
            "level": 3,
            "name": "松滋市",
            "id": "421087"
          }
        ]
      },
      {
        "level": 2,
        "name": "黄冈市",
        "id": "421100",
        "childs": [
          {
            "level": 3,
            "name": "黄州区",
            "id": "421102"
          },
          {
            "level": 3,
            "name": "团风县",
            "id": "421121"
          },
          {
            "level": 3,
            "name": "红安县",
            "id": "421122"
          },
          {
            "level": 3,
            "name": "罗田县",
            "id": "421123"
          },
          {
            "level": 3,
            "name": "英山县",
            "id": "421124"
          },
          {
            "level": 3,
            "name": "浠水县",
            "id": "421125"
          },
          {
            "level": 3,
            "name": "蕲春县",
            "id": "421126"
          },
          {
            "level": 3,
            "name": "黄梅县",
            "id": "421127"
          },
          {
            "level": 3,
            "name": "麻城市",
            "id": "421181"
          },
          {
            "level": 3,
            "name": "武穴市",
            "id": "421182"
          }
        ]
      },
      {
        "level": 2,
        "name": "咸宁市",
        "id": "421200",
        "childs": [
          {
            "level": 3,
            "name": "咸安区",
            "id": "421202"
          },
          {
            "level": 3,
            "name": "嘉鱼县",
            "id": "421221"
          },
          {
            "level": 3,
            "name": "通城县",
            "id": "421222"
          },
          {
            "level": 3,
            "name": "崇阳县",
            "id": "421223"
          },
          {
            "level": 3,
            "name": "通山县",
            "id": "421224"
          },
          {
            "level": 3,
            "name": "赤壁市",
            "id": "421281"
          },
          {
            "level": 3,
            "name": "温泉城区",
            "id": "421282"
          }
        ]
      },
      {
        "level": 2,
        "name": "随州市",
        "id": "421300",
        "childs": [
          {
            "level": 3,
            "name": "曾都区",
            "id": "421302"
          },
          {
            "level": 3,
            "name": "随县",
            "id": "421321"
          },
          {
            "level": 3,
            "name": "广水市",
            "id": "421381"
          }
        ]
      },
      {
        "level": 2,
        "name": "恩施土家族苗族自治州",
        "id": "422800",
        "childs": [
          {
            "level": 3,
            "name": "恩施市",
            "id": "422801"
          },
          {
            "level": 3,
            "name": "利川市",
            "id": "422802"
          },
          {
            "level": 3,
            "name": "建始县",
            "id": "422822"
          },
          {
            "level": 3,
            "name": "巴东县",
            "id": "422823"
          },
          {
            "level": 3,
            "name": "宣恩县",
            "id": "422825"
          },
          {
            "level": 3,
            "name": "咸丰县",
            "id": "422826"
          },
          {
            "level": 3,
            "name": "来凤县",
            "id": "422827"
          },
          {
            "level": 3,
            "name": "鹤峰县",
            "id": "422828"
          }
        ]
      },
      {
        "level": 2,
        "name": "仙桃市",
        "id": "429004",
        "childs": []
      },
      {
        "level": 2,
        "name": "潜江市",
        "id": "429005",
        "childs": []
      },
      {
        "level": 2,
        "name": "天门市",
        "id": "429006",
        "childs": []
      },
      {
        "level": 2,
        "name": "神农架林区",
        "id": "429021",
        "childs": []
      }
    ]
  },
  {
    "level": 1,
    "name": "湖南省",
    "id": "430000",
    "childs": [
      {
        "level": 2,
        "name": "长沙市",
        "id": "430100",
        "childs": [
          {
            "level": 3,
            "name": "芙蓉区",
            "id": "430102"
          },
          {
            "level": 3,
            "name": "天心区",
            "id": "430103"
          },
          {
            "level": 3,
            "name": "岳麓区",
            "id": "430104"
          },
          {
            "level": 3,
            "name": "开福区",
            "id": "430105"
          },
          {
            "level": 3,
            "name": "雨花区",
            "id": "430111"
          },
          {
            "level": 3,
            "name": "长沙县",
            "id": "430121"
          },
          {
            "level": 3,
            "name": "望城区",
            "id": "430122"
          },
          {
            "level": 3,
            "name": "宁乡县",
            "id": "430124"
          },
          {
            "level": 3,
            "name": "浏阳市",
            "id": "430181"
          }
        ]
      },
      {
        "level": 2,
        "name": "株洲市",
        "id": "430200",
        "childs": [
          {
            "level": 3,
            "name": "荷塘区",
            "id": "430202"
          },
          {
            "level": 3,
            "name": "芦淞区",
            "id": "430203"
          },
          {
            "level": 3,
            "name": "石峰区",
            "id": "430204"
          },
          {
            "level": 3,
            "name": "天元区",
            "id": "430211"
          },
          {
            "level": 3,
            "name": "株洲县",
            "id": "430221"
          },
          {
            "level": 3,
            "name": "攸县",
            "id": "430223"
          },
          {
            "level": 3,
            "name": "茶陵县",
            "id": "430224"
          },
          {
            "level": 3,
            "name": "炎陵县",
            "id": "430225"
          },
          {
            "level": 3,
            "name": "醴陵市",
            "id": "430281"
          }
        ]
      },
      {
        "level": 2,
        "name": "湘潭市",
        "id": "430300",
        "childs": [
          {
            "level": 3,
            "name": "雨湖区",
            "id": "430302"
          },
          {
            "level": 3,
            "name": "岳塘区",
            "id": "430304"
          },
          {
            "level": 3,
            "name": "湘潭县",
            "id": "430321"
          },
          {
            "level": 3,
            "name": "湘乡市",
            "id": "430381"
          },
          {
            "level": 3,
            "name": "韶山市",
            "id": "430382"
          }
        ]
      },
      {
        "level": 2,
        "name": "衡阳市",
        "id": "430400",
        "childs": [
          {
            "level": 3,
            "name": "珠晖区",
            "id": "430405"
          },
          {
            "level": 3,
            "name": "雁峰区",
            "id": "430406"
          },
          {
            "level": 3,
            "name": "石鼓区",
            "id": "430407"
          },
          {
            "level": 3,
            "name": "蒸湘区",
            "id": "430408"
          },
          {
            "level": 3,
            "name": "南岳区",
            "id": "430412"
          },
          {
            "level": 3,
            "name": "衡阳县",
            "id": "430421"
          },
          {
            "level": 3,
            "name": "衡南县",
            "id": "430422"
          },
          {
            "level": 3,
            "name": "衡山县",
            "id": "430423"
          },
          {
            "level": 3,
            "name": "衡东县",
            "id": "430424"
          },
          {
            "level": 3,
            "name": "祁东县",
            "id": "430426"
          },
          {
            "level": 3,
            "name": "耒阳市",
            "id": "430481"
          },
          {
            "level": 3,
            "name": "常宁市",
            "id": "430482"
          }
        ]
      },
      {
        "level": 2,
        "name": "邵阳市",
        "id": "430500",
        "childs": [
          {
            "level": 3,
            "name": "双清区",
            "id": "430502"
          },
          {
            "level": 3,
            "name": "大祥区",
            "id": "430503"
          },
          {
            "level": 3,
            "name": "北塔区",
            "id": "430511"
          },
          {
            "level": 3,
            "name": "邵东县",
            "id": "430521"
          },
          {
            "level": 3,
            "name": "新邵县",
            "id": "430522"
          },
          {
            "level": 3,
            "name": "邵阳县",
            "id": "430523"
          },
          {
            "level": 3,
            "name": "隆回县",
            "id": "430524"
          },
          {
            "level": 3,
            "name": "洞口县",
            "id": "430525"
          },
          {
            "level": 3,
            "name": "绥宁县",
            "id": "430527"
          },
          {
            "level": 3,
            "name": "新宁县",
            "id": "430528"
          },
          {
            "level": 3,
            "name": "城步苗族自治县",
            "id": "430529"
          },
          {
            "level": 3,
            "name": "武冈市",
            "id": "430581"
          }
        ]
      },
      {
        "level": 2,
        "name": "岳阳市",
        "id": "430600",
        "childs": [
          {
            "level": 3,
            "name": "岳阳楼区",
            "id": "430602"
          },
          {
            "level": 3,
            "name": "云溪区",
            "id": "430603"
          },
          {
            "level": 3,
            "name": "君山区",
            "id": "430611"
          },
          {
            "level": 3,
            "name": "岳阳县",
            "id": "430621"
          },
          {
            "level": 3,
            "name": "华容县",
            "id": "430623"
          },
          {
            "level": 3,
            "name": "湘阴县",
            "id": "430624"
          },
          {
            "level": 3,
            "name": "平江县",
            "id": "430626"
          },
          {
            "level": 3,
            "name": "汨罗市",
            "id": "430681"
          },
          {
            "level": 3,
            "name": "临湘市",
            "id": "430682"
          }
        ]
      },
      {
        "level": 2,
        "name": "常德市",
        "id": "430700",
        "childs": [
          {
            "level": 3,
            "name": "武陵区",
            "id": "430702"
          },
          {
            "level": 3,
            "name": "鼎城区",
            "id": "430703"
          },
          {
            "level": 3,
            "name": "安乡县",
            "id": "430721"
          },
          {
            "level": 3,
            "name": "汉寿县",
            "id": "430722"
          },
          {
            "level": 3,
            "name": "澧县",
            "id": "430723"
          },
          {
            "level": 3,
            "name": "临澧县",
            "id": "430724"
          },
          {
            "level": 3,
            "name": "桃源县",
            "id": "430725"
          },
          {
            "level": 3,
            "name": "石门县",
            "id": "430726"
          },
          {
            "level": 3,
            "name": "津市市",
            "id": "430781"
          }
        ]
      },
      {
        "level": 2,
        "name": "张家界市",
        "id": "430800",
        "childs": [
          {
            "level": 3,
            "name": "永定区",
            "id": "430802"
          },
          {
            "level": 3,
            "name": "武陵源区",
            "id": "430811"
          },
          {
            "level": 3,
            "name": "慈利县",
            "id": "430821"
          },
          {
            "level": 3,
            "name": "桑植县",
            "id": "430822"
          }
        ]
      },
      {
        "level": 2,
        "name": "益阳市",
        "id": "430900",
        "childs": [
          {
            "level": 3,
            "name": "资阳区",
            "id": "430902"
          },
          {
            "level": 3,
            "name": "赫山区",
            "id": "430903"
          },
          {
            "level": 3,
            "name": "南县",
            "id": "430921"
          },
          {
            "level": 3,
            "name": "桃江县",
            "id": "430922"
          },
          {
            "level": 3,
            "name": "安化县",
            "id": "430923"
          },
          {
            "level": 3,
            "name": "沅江市",
            "id": "430981"
          }
        ]
      },
      {
        "level": 2,
        "name": "郴州市",
        "id": "431000",
        "childs": [
          {
            "level": 3,
            "name": "北湖区",
            "id": "431002"
          },
          {
            "level": 3,
            "name": "苏仙区",
            "id": "431003"
          },
          {
            "level": 3,
            "name": "桂阳县",
            "id": "431021"
          },
          {
            "level": 3,
            "name": "宜章县",
            "id": "431022"
          },
          {
            "level": 3,
            "name": "永兴县",
            "id": "431023"
          },
          {
            "level": 3,
            "name": "嘉禾县",
            "id": "431024"
          },
          {
            "level": 3,
            "name": "临武县",
            "id": "431025"
          },
          {
            "level": 3,
            "name": "汝城县",
            "id": "431026"
          },
          {
            "level": 3,
            "name": "桂东县",
            "id": "431027"
          },
          {
            "level": 3,
            "name": "安仁县",
            "id": "431028"
          },
          {
            "level": 3,
            "name": "资兴市",
            "id": "431081"
          }
        ]
      },
      {
        "level": 2,
        "name": "永州市",
        "id": "431100",
        "childs": [
          {
            "level": 3,
            "name": "零陵区",
            "id": "431102"
          },
          {
            "level": 3,
            "name": "冷水滩区",
            "id": "431103"
          },
          {
            "level": 3,
            "name": "祁阳县",
            "id": "431121"
          },
          {
            "level": 3,
            "name": "东安县",
            "id": "431122"
          },
          {
            "level": 3,
            "name": "双牌县",
            "id": "431123"
          },
          {
            "level": 3,
            "name": "道县",
            "id": "431124"
          },
          {
            "level": 3,
            "name": "江永县",
            "id": "431125"
          },
          {
            "level": 3,
            "name": "宁远县",
            "id": "431126"
          },
          {
            "level": 3,
            "name": "蓝山县",
            "id": "431127"
          },
          {
            "level": 3,
            "name": "新田县",
            "id": "431128"
          },
          {
            "level": 3,
            "name": "江华瑶族自治县",
            "id": "431129"
          }
        ]
      },
      {
        "level": 2,
        "name": "怀化市",
        "id": "431200",
        "childs": [
          {
            "level": 3,
            "name": "鹤城区",
            "id": "431202"
          },
          {
            "level": 3,
            "name": "中方县",
            "id": "431221"
          },
          {
            "level": 3,
            "name": "沅陵县",
            "id": "431222"
          },
          {
            "level": 3,
            "name": "辰溪县",
            "id": "431223"
          },
          {
            "level": 3,
            "name": "溆浦县",
            "id": "431224"
          },
          {
            "level": 3,
            "name": "会同县",
            "id": "431225"
          },
          {
            "level": 3,
            "name": "麻阳苗族自治县",
            "id": "431226"
          },
          {
            "level": 3,
            "name": "新晃侗族自治县",
            "id": "431227"
          },
          {
            "level": 3,
            "name": "芷江侗族自治县",
            "id": "431228"
          },
          {
            "level": 3,
            "name": "靖州苗族侗族自治县",
            "id": "431229"
          },
          {
            "level": 3,
            "name": "通道侗族自治县",
            "id": "431230"
          },
          {
            "level": 3,
            "name": "洪江市",
            "id": "431281"
          }
        ]
      },
      {
        "level": 2,
        "name": "娄底市",
        "id": "431300",
        "childs": [
          {
            "level": 3,
            "name": "娄星区",
            "id": "431302"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "431303"
          },
          {
            "level": 3,
            "name": "双峰县",
            "id": "431321"
          },
          {
            "level": 3,
            "name": "新化县",
            "id": "431322"
          },
          {
            "level": 3,
            "name": "冷水江市",
            "id": "431381"
          },
          {
            "level": 3,
            "name": "涟源市",
            "id": "431382"
          }
        ]
      },
      {
        "level": 2,
        "name": "湘西土家族苗族自治州",
        "id": "433100",
        "childs": [
          {
            "level": 3,
            "name": "吉首市",
            "id": "433101"
          },
          {
            "level": 3,
            "name": "泸溪县",
            "id": "433122"
          },
          {
            "level": 3,
            "name": "凤凰县",
            "id": "433123"
          },
          {
            "level": 3,
            "name": "花垣县",
            "id": "433124"
          },
          {
            "level": 3,
            "name": "保靖县",
            "id": "433125"
          },
          {
            "level": 3,
            "name": "古丈县",
            "id": "433126"
          },
          {
            "level": 3,
            "name": "永顺县",
            "id": "433127"
          },
          {
            "level": 3,
            "name": "龙山县",
            "id": "433130"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "广东省",
    "id": "440000",
    "childs": [
      {
        "level": 2,
        "name": "广州市",
        "id": "440100",
        "childs": [
          {
            "level": 3,
            "name": "荔湾区",
            "id": "440103"
          },
          {
            "level": 3,
            "name": "越秀区",
            "id": "440104"
          },
          {
            "level": 3,
            "name": "海珠区",
            "id": "440105"
          },
          {
            "level": 3,
            "name": "天河区",
            "id": "440106"
          },
          {
            "level": 3,
            "name": "白云区",
            "id": "440111"
          },
          {
            "level": 3,
            "name": "黄埔区",
            "id": "440112"
          },
          {
            "level": 3,
            "name": "番禺区",
            "id": "440113"
          },
          {
            "level": 3,
            "name": "花都区",
            "id": "440114"
          },
          {
            "level": 3,
            "name": "南沙区",
            "id": "440115"
          },
          {
            "level": 3,
            "name": "萝岗区",
            "id": "440116"
          },
          {
            "level": 3,
            "name": "增城市",
            "id": "440183"
          },
          {
            "level": 3,
            "name": "从化市",
            "id": "440184"
          },
          {
            "level": 3,
            "name": "东山区",
            "id": "440188"
          }
        ]
      },
      {
        "level": 2,
        "name": "韶关市",
        "id": "440200",
        "childs": [
          {
            "level": 3,
            "name": "武江区",
            "id": "440203"
          },
          {
            "level": 3,
            "name": "浈江区",
            "id": "440204"
          },
          {
            "level": 3,
            "name": "曲江区",
            "id": "440205"
          },
          {
            "level": 3,
            "name": "始兴县",
            "id": "440222"
          },
          {
            "level": 3,
            "name": "仁化县",
            "id": "440224"
          },
          {
            "level": 3,
            "name": "翁源县",
            "id": "440229"
          },
          {
            "level": 3,
            "name": "乳源瑶族自治县",
            "id": "440232"
          },
          {
            "level": 3,
            "name": "新丰县",
            "id": "440233"
          },
          {
            "level": 3,
            "name": "乐昌市",
            "id": "440281"
          },
          {
            "level": 3,
            "name": "南雄市",
            "id": "440282"
          }
        ]
      },
      {
        "level": 2,
        "name": "深圳市",
        "id": "440300",
        "childs": [
          {
            "level": 3,
            "name": "大鹏新区",
            "id": "440302"
          },
          {
            "level": 3,
            "name": "罗湖区",
            "id": "440303"
          },
          {
            "level": 3,
            "name": "福田区",
            "id": "440304"
          },
          {
            "level": 3,
            "name": "南山区",
            "id": "440305"
          },
          {
            "level": 3,
            "name": "宝安区",
            "id": "440306"
          },
          {
            "level": 3,
            "name": "龙岗区",
            "id": "440307"
          },
          {
            "level": 3,
            "name": "盐田区",
            "id": "440308"
          },
          {
            "level": 3,
            "name": "龙华新区",
            "id": "440309"
          }
        ]
      },
      {
        "level": 2,
        "name": "珠海市",
        "id": "440400",
        "childs": [
          {
            "level": 3,
            "name": "香洲区",
            "id": "440402"
          },
          {
            "level": 3,
            "name": "斗门区",
            "id": "440403"
          },
          {
            "level": 3,
            "name": "金湾区",
            "id": "440404"
          },
          {
            "level": 3,
            "name": "金唐区",
            "id": "440486"
          },
          {
            "level": 3,
            "name": "南湾区",
            "id": "440487"
          }
        ]
      },
      {
        "level": 2,
        "name": "汕头市",
        "id": "440500",
        "childs": [
          {
            "level": 3,
            "name": "龙湖区",
            "id": "440507"
          },
          {
            "level": 3,
            "name": "金平区",
            "id": "440511"
          },
          {
            "level": 3,
            "name": "濠江区",
            "id": "440512"
          },
          {
            "level": 3,
            "name": "潮阳区",
            "id": "440513"
          },
          {
            "level": 3,
            "name": "潮南区",
            "id": "440514"
          },
          {
            "level": 3,
            "name": "澄海区",
            "id": "440515"
          },
          {
            "level": 3,
            "name": "南澳县",
            "id": "440523"
          }
        ]
      },
      {
        "level": 2,
        "name": "佛山市",
        "id": "440600",
        "childs": [
          {
            "level": 3,
            "name": "其它区",
            "id": "440603"
          },
          {
            "level": 3,
            "name": "禅城区",
            "id": "440604"
          },
          {
            "level": 3,
            "name": "南海区",
            "id": "440605"
          },
          {
            "level": 3,
            "name": "顺德区",
            "id": "440606"
          },
          {
            "level": 3,
            "name": "三水区",
            "id": "440607"
          },
          {
            "level": 3,
            "name": "高明区",
            "id": "440608"
          }
        ]
      },
      {
        "level": 2,
        "name": "江门市",
        "id": "440700",
        "childs": [
          {
            "level": 3,
            "name": "蓬江区",
            "id": "440703"
          },
          {
            "level": 3,
            "name": "江海区",
            "id": "440704"
          },
          {
            "level": 3,
            "name": "新会区",
            "id": "440705"
          },
          {
            "level": 3,
            "name": "台山市",
            "id": "440781"
          },
          {
            "level": 3,
            "name": "开平市",
            "id": "440783"
          },
          {
            "level": 3,
            "name": "鹤山市",
            "id": "440784"
          },
          {
            "level": 3,
            "name": "恩平市",
            "id": "440785"
          }
        ]
      },
      {
        "level": 2,
        "name": "湛江市",
        "id": "440800",
        "childs": [
          {
            "level": 3,
            "name": "赤坎区",
            "id": "440802"
          },
          {
            "level": 3,
            "name": "霞山区",
            "id": "440803"
          },
          {
            "level": 3,
            "name": "坡头区",
            "id": "440804"
          },
          {
            "level": 3,
            "name": "麻章区",
            "id": "440811"
          },
          {
            "level": 3,
            "name": "遂溪县",
            "id": "440823"
          },
          {
            "level": 3,
            "name": "徐闻县",
            "id": "440825"
          },
          {
            "level": 3,
            "name": "廉江市",
            "id": "440881"
          },
          {
            "level": 3,
            "name": "雷州市",
            "id": "440882"
          },
          {
            "level": 3,
            "name": "吴川市",
            "id": "440883"
          }
        ]
      },
      {
        "level": 2,
        "name": "茂名市",
        "id": "440900",
        "childs": [
          {
            "level": 3,
            "name": "茂南区",
            "id": "440902"
          },
          {
            "level": 3,
            "name": "茂港区",
            "id": "440903"
          },
          {
            "level": 3,
            "name": "电白县",
            "id": "440923"
          },
          {
            "level": 3,
            "name": "高州市",
            "id": "440981"
          },
          {
            "level": 3,
            "name": "化州市",
            "id": "440982"
          },
          {
            "level": 3,
            "name": "信宜市",
            "id": "440983"
          }
        ]
      },
      {
        "level": 2,
        "name": "肇庆市",
        "id": "441200",
        "childs": [
          {
            "level": 3,
            "name": "端州区",
            "id": "441202"
          },
          {
            "level": 3,
            "name": "鼎湖区",
            "id": "441203"
          },
          {
            "level": 3,
            "name": "广宁县",
            "id": "441223"
          },
          {
            "level": 3,
            "name": "怀集县",
            "id": "441224"
          },
          {
            "level": 3,
            "name": "封开县",
            "id": "441225"
          },
          {
            "level": 3,
            "name": "德庆县",
            "id": "441226"
          },
          {
            "level": 3,
            "name": "高要市",
            "id": "441283"
          },
          {
            "level": 3,
            "name": "四会市",
            "id": "441284"
          }
        ]
      },
      {
        "level": 2,
        "name": "惠州市",
        "id": "441300",
        "childs": [
          {
            "level": 3,
            "name": "惠城区",
            "id": "441302"
          },
          {
            "level": 3,
            "name": "惠阳区",
            "id": "441303"
          },
          {
            "level": 3,
            "name": "博罗县",
            "id": "441322"
          },
          {
            "level": 3,
            "name": "惠东县",
            "id": "441323"
          },
          {
            "level": 3,
            "name": "龙门县",
            "id": "441324"
          }
        ]
      },
      {
        "level": 2,
        "name": "梅州市",
        "id": "441400",
        "childs": [
          {
            "level": 3,
            "name": "梅江区",
            "id": "441402"
          },
          {
            "level": 3,
            "name": "梅县",
            "id": "441421"
          },
          {
            "level": 3,
            "name": "大埔县",
            "id": "441422"
          },
          {
            "level": 3,
            "name": "丰顺县",
            "id": "441423"
          },
          {
            "level": 3,
            "name": "五华县",
            "id": "441424"
          },
          {
            "level": 3,
            "name": "平远县",
            "id": "441426"
          },
          {
            "level": 3,
            "name": "蕉岭县",
            "id": "441427"
          },
          {
            "level": 3,
            "name": "兴宁市",
            "id": "441481"
          }
        ]
      },
      {
        "level": 2,
        "name": "汕尾市",
        "id": "441500",
        "childs": [
          {
            "level": 3,
            "name": "城区",
            "id": "441502"
          },
          {
            "level": 3,
            "name": "海丰县",
            "id": "441521"
          },
          {
            "level": 3,
            "name": "陆河县",
            "id": "441523"
          },
          {
            "level": 3,
            "name": "陆丰市",
            "id": "441581"
          }
        ]
      },
      {
        "level": 2,
        "name": "河源市",
        "id": "441600",
        "childs": [
          {
            "level": 3,
            "name": "源城区",
            "id": "441602"
          },
          {
            "level": 3,
            "name": "紫金县",
            "id": "441621"
          },
          {
            "level": 3,
            "name": "龙川县",
            "id": "441622"
          },
          {
            "level": 3,
            "name": "连平县",
            "id": "441623"
          },
          {
            "level": 3,
            "name": "和平县",
            "id": "441624"
          },
          {
            "level": 3,
            "name": "东源县",
            "id": "441625"
          }
        ]
      },
      {
        "level": 2,
        "name": "阳江市",
        "id": "441700",
        "childs": [
          {
            "level": 3,
            "name": "江城区",
            "id": "441702"
          },
          {
            "level": 3,
            "name": "阳西县",
            "id": "441721"
          },
          {
            "level": 3,
            "name": "阳东县",
            "id": "441723"
          },
          {
            "level": 3,
            "name": "阳春市",
            "id": "441781"
          }
        ]
      },
      {
        "level": 2,
        "name": "清远市",
        "id": "441800",
        "childs": [
          {
            "level": 3,
            "name": "清城区",
            "id": "441802"
          },
          {
            "level": 3,
            "name": "佛冈县",
            "id": "441821"
          },
          {
            "level": 3,
            "name": "阳山县",
            "id": "441823"
          },
          {
            "level": 3,
            "name": "连山壮族瑶族自治县",
            "id": "441825"
          },
          {
            "level": 3,
            "name": "连南瑶族自治县",
            "id": "441826"
          },
          {
            "level": 3,
            "name": "清新区",
            "id": "441827"
          },
          {
            "level": 3,
            "name": "英德市",
            "id": "441881"
          },
          {
            "level": 3,
            "name": "连州市",
            "id": "441882"
          }
        ]
      },
      {
        "level": 2,
        "name": "东莞市",
        "id": "441900",
        "childs": []
      },
      {
        "level": 2,
        "name": "中山市",
        "id": "442000",
        "childs": []
      },
      {
        "level": 2,
        "name": "潮州市",
        "id": "445100",
        "childs": [
          {
            "level": 3,
            "name": "湘桥区",
            "id": "445102"
          },
          {
            "level": 3,
            "name": "潮安区",
            "id": "445121"
          },
          {
            "level": 3,
            "name": "饶平县",
            "id": "445122"
          },
          {
            "level": 3,
            "name": "枫溪区",
            "id": "445185"
          }
        ]
      },
      {
        "level": 2,
        "name": "揭阳市",
        "id": "445200",
        "childs": [
          {
            "level": 3,
            "name": "榕城区",
            "id": "445202"
          },
          {
            "level": 3,
            "name": "揭东区",
            "id": "445221"
          },
          {
            "level": 3,
            "name": "揭西县",
            "id": "445222"
          },
          {
            "level": 3,
            "name": "惠来县",
            "id": "445224"
          },
          {
            "level": 3,
            "name": "普宁市",
            "id": "445281"
          },
          {
            "level": 3,
            "name": "东山区",
            "id": "445284"
          }
        ]
      },
      {
        "level": 2,
        "name": "云浮市",
        "id": "445300",
        "childs": [
          {
            "level": 3,
            "name": "云城区",
            "id": "445302"
          },
          {
            "level": 3,
            "name": "新兴县",
            "id": "445321"
          },
          {
            "level": 3,
            "name": "郁南县",
            "id": "445322"
          },
          {
            "level": 3,
            "name": "云安县",
            "id": "445323"
          },
          {
            "level": 3,
            "name": "罗定市",
            "id": "445381"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "广西壮族自治区",
    "id": "450000",
    "childs": [
      {
        "level": 2,
        "name": "南宁市",
        "id": "450100",
        "childs": [
          {
            "level": 3,
            "name": "兴宁区",
            "id": "450102"
          },
          {
            "level": 3,
            "name": "青秀区",
            "id": "450103"
          },
          {
            "level": 3,
            "name": "江南区",
            "id": "450105"
          },
          {
            "level": 3,
            "name": "西乡塘区",
            "id": "450107"
          },
          {
            "level": 3,
            "name": "良庆区",
            "id": "450108"
          },
          {
            "level": 3,
            "name": "邕宁区",
            "id": "450109"
          },
          {
            "level": 3,
            "name": "武鸣县",
            "id": "450122"
          },
          {
            "level": 3,
            "name": "隆安县",
            "id": "450123"
          },
          {
            "level": 3,
            "name": "马山县",
            "id": "450124"
          },
          {
            "level": 3,
            "name": "上林县",
            "id": "450125"
          },
          {
            "level": 3,
            "name": "宾阳县",
            "id": "450126"
          },
          {
            "level": 3,
            "name": "横县",
            "id": "450127"
          }
        ]
      },
      {
        "level": 2,
        "name": "柳州市",
        "id": "450200",
        "childs": [
          {
            "level": 3,
            "name": "城中区",
            "id": "450202"
          },
          {
            "level": 3,
            "name": "鱼峰区",
            "id": "450203"
          },
          {
            "level": 3,
            "name": "柳南区",
            "id": "450204"
          },
          {
            "level": 3,
            "name": "柳北区",
            "id": "450205"
          },
          {
            "level": 3,
            "name": "柳江县",
            "id": "450221"
          },
          {
            "level": 3,
            "name": "柳城县",
            "id": "450222"
          },
          {
            "level": 3,
            "name": "鹿寨县",
            "id": "450223"
          },
          {
            "level": 3,
            "name": "融安县",
            "id": "450224"
          },
          {
            "level": 3,
            "name": "融水苗族自治县",
            "id": "450225"
          },
          {
            "level": 3,
            "name": "三江侗族自治县",
            "id": "450226"
          }
        ]
      },
      {
        "level": 2,
        "name": "桂林市",
        "id": "450300",
        "childs": [
          {
            "level": 3,
            "name": "秀峰区",
            "id": "450302"
          },
          {
            "level": 3,
            "name": "叠彩区",
            "id": "450303"
          },
          {
            "level": 3,
            "name": "象山区",
            "id": "450304"
          },
          {
            "level": 3,
            "name": "七星区",
            "id": "450305"
          },
          {
            "level": 3,
            "name": "雁山区",
            "id": "450311"
          },
          {
            "level": 3,
            "name": "阳朔县",
            "id": "450321"
          },
          {
            "level": 3,
            "name": "临桂区",
            "id": "450322"
          },
          {
            "level": 3,
            "name": "灵川县",
            "id": "450323"
          },
          {
            "level": 3,
            "name": "全州县",
            "id": "450324"
          },
          {
            "level": 3,
            "name": "兴安县",
            "id": "450325"
          },
          {
            "level": 3,
            "name": "永福县",
            "id": "450326"
          },
          {
            "level": 3,
            "name": "灌阳县",
            "id": "450327"
          },
          {
            "level": 3,
            "name": "龙胜各族自治县",
            "id": "450328"
          },
          {
            "level": 3,
            "name": "资源县",
            "id": "450329"
          },
          {
            "level": 3,
            "name": "平乐县",
            "id": "450330"
          },
          {
            "level": 3,
            "name": "荔浦县",
            "id": "450331"
          },
          {
            "level": 3,
            "name": "恭城瑶族自治县",
            "id": "450332"
          }
        ]
      },
      {
        "level": 2,
        "name": "梧州市",
        "id": "450400",
        "childs": [
          {
            "level": 3,
            "name": "万秀区",
            "id": "450403"
          },
          {
            "level": 3,
            "name": "蝶山区",
            "id": "450404"
          },
          {
            "level": 3,
            "name": "长洲区",
            "id": "450405"
          },
          {
            "level": 3,
            "name": "龙圩区",
            "id": "450406"
          },
          {
            "level": 3,
            "name": "苍梧县",
            "id": "450421"
          },
          {
            "level": 3,
            "name": "藤县",
            "id": "450422"
          },
          {
            "level": 3,
            "name": "蒙山县",
            "id": "450423"
          },
          {
            "level": 3,
            "name": "岑溪市",
            "id": "450481"
          }
        ]
      },
      {
        "level": 2,
        "name": "北海市",
        "id": "450500",
        "childs": [
          {
            "level": 3,
            "name": "海城区",
            "id": "450502"
          },
          {
            "level": 3,
            "name": "银海区",
            "id": "450503"
          },
          {
            "level": 3,
            "name": "铁山港区",
            "id": "450512"
          },
          {
            "level": 3,
            "name": "合浦县",
            "id": "450521"
          }
        ]
      },
      {
        "level": 2,
        "name": "防城港市",
        "id": "450600",
        "childs": [
          {
            "level": 3,
            "name": "港口区",
            "id": "450602"
          },
          {
            "level": 3,
            "name": "防城区",
            "id": "450603"
          },
          {
            "level": 3,
            "name": "上思县",
            "id": "450621"
          },
          {
            "level": 3,
            "name": "东兴市",
            "id": "450681"
          }
        ]
      },
      {
        "level": 2,
        "name": "钦州市",
        "id": "450700",
        "childs": [
          {
            "level": 3,
            "name": "钦南区",
            "id": "450702"
          },
          {
            "level": 3,
            "name": "钦北区",
            "id": "450703"
          },
          {
            "level": 3,
            "name": "灵山县",
            "id": "450721"
          },
          {
            "level": 3,
            "name": "浦北县",
            "id": "450722"
          }
        ]
      },
      {
        "level": 2,
        "name": "贵港市",
        "id": "450800",
        "childs": [
          {
            "level": 3,
            "name": "港北区",
            "id": "450802"
          },
          {
            "level": 3,
            "name": "港南区",
            "id": "450803"
          },
          {
            "level": 3,
            "name": "覃塘区",
            "id": "450804"
          },
          {
            "level": 3,
            "name": "平南县",
            "id": "450821"
          },
          {
            "level": 3,
            "name": "桂平市",
            "id": "450881"
          }
        ]
      },
      {
        "level": 2,
        "name": "玉林市",
        "id": "450900",
        "childs": [
          {
            "level": 3,
            "name": "玉州区",
            "id": "450902"
          },
          {
            "level": 3,
            "name": "福绵区",
            "id": "450903"
          },
          {
            "level": 3,
            "name": "容县",
            "id": "450921"
          },
          {
            "level": 3,
            "name": "陆川县",
            "id": "450922"
          },
          {
            "level": 3,
            "name": "博白县",
            "id": "450923"
          },
          {
            "level": 3,
            "name": "兴业县",
            "id": "450924"
          },
          {
            "level": 3,
            "name": "北流市",
            "id": "450981"
          }
        ]
      },
      {
        "level": 2,
        "name": "百色市",
        "id": "451000",
        "childs": [
          {
            "level": 3,
            "name": "右江区",
            "id": "451002"
          },
          {
            "level": 3,
            "name": "田阳县",
            "id": "451021"
          },
          {
            "level": 3,
            "name": "田东县",
            "id": "451022"
          },
          {
            "level": 3,
            "name": "平果县",
            "id": "451023"
          },
          {
            "level": 3,
            "name": "德保县",
            "id": "451024"
          },
          {
            "level": 3,
            "name": "靖西县",
            "id": "451025"
          },
          {
            "level": 3,
            "name": "那坡县",
            "id": "451026"
          },
          {
            "level": 3,
            "name": "凌云县",
            "id": "451027"
          },
          {
            "level": 3,
            "name": "乐业县",
            "id": "451028"
          },
          {
            "level": 3,
            "name": "田林县",
            "id": "451029"
          },
          {
            "level": 3,
            "name": "西林县",
            "id": "451030"
          },
          {
            "level": 3,
            "name": "隆林各族自治县",
            "id": "451031"
          }
        ]
      },
      {
        "level": 2,
        "name": "贺州市",
        "id": "451100",
        "childs": [
          {
            "level": 3,
            "name": "八步区",
            "id": "451102"
          },
          {
            "level": 3,
            "name": "平桂管理区",
            "id": "451119"
          },
          {
            "level": 3,
            "name": "昭平县",
            "id": "451121"
          },
          {
            "level": 3,
            "name": "钟山县",
            "id": "451122"
          },
          {
            "level": 3,
            "name": "富川瑶族自治县",
            "id": "451123"
          }
        ]
      },
      {
        "level": 2,
        "name": "河池市",
        "id": "451200",
        "childs": [
          {
            "level": 3,
            "name": "金城江区",
            "id": "451202"
          },
          {
            "level": 3,
            "name": "南丹县",
            "id": "451221"
          },
          {
            "level": 3,
            "name": "天峨县",
            "id": "451222"
          },
          {
            "level": 3,
            "name": "凤山县",
            "id": "451223"
          },
          {
            "level": 3,
            "name": "东兰县",
            "id": "451224"
          },
          {
            "level": 3,
            "name": "罗城仫佬族自治县",
            "id": "451225"
          },
          {
            "level": 3,
            "name": "环江毛南族自治县",
            "id": "451226"
          },
          {
            "level": 3,
            "name": "巴马瑶族自治县",
            "id": "451227"
          },
          {
            "level": 3,
            "name": "都安瑶族自治县",
            "id": "451228"
          },
          {
            "level": 3,
            "name": "大化瑶族自治县",
            "id": "451229"
          },
          {
            "level": 3,
            "name": "宜州市",
            "id": "451281"
          }
        ]
      },
      {
        "level": 2,
        "name": "来宾市",
        "id": "451300",
        "childs": [
          {
            "level": 3,
            "name": "兴宾区",
            "id": "451302"
          },
          {
            "level": 3,
            "name": "忻城县",
            "id": "451321"
          },
          {
            "level": 3,
            "name": "象州县",
            "id": "451322"
          },
          {
            "level": 3,
            "name": "武宣县",
            "id": "451323"
          },
          {
            "level": 3,
            "name": "金秀瑶族自治县",
            "id": "451324"
          },
          {
            "level": 3,
            "name": "合山市",
            "id": "451381"
          }
        ]
      },
      {
        "level": 2,
        "name": "崇左市",
        "id": "451400",
        "childs": [
          {
            "level": 3,
            "name": "江州区",
            "id": "451402"
          },
          {
            "level": 3,
            "name": "扶绥县",
            "id": "451421"
          },
          {
            "level": 3,
            "name": "宁明县",
            "id": "451422"
          },
          {
            "level": 3,
            "name": "龙州县",
            "id": "451423"
          },
          {
            "level": 3,
            "name": "大新县",
            "id": "451424"
          },
          {
            "level": 3,
            "name": "天等县",
            "id": "451425"
          },
          {
            "level": 3,
            "name": "凭祥市",
            "id": "451481"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "海南省",
    "id": "460000",
    "childs": [
      {
        "level": 2,
        "name": "海口市",
        "id": "460100",
        "childs": [
          {
            "level": 3,
            "name": "其它区",
            "id": "460104"
          },
          {
            "level": 3,
            "name": "秀英区",
            "id": "460105"
          },
          {
            "level": 3,
            "name": "龙华区",
            "id": "460106"
          },
          {
            "level": 3,
            "name": "琼山区",
            "id": "460107"
          },
          {
            "level": 3,
            "name": "美兰区",
            "id": "460108"
          }
        ]
      },
      {
        "level": 2,
        "name": "三亚市",
        "id": "460200",
        "childs": []
      },
      {
        "level": 2,
        "name": "三沙市",
        "id": "460321",
        "childs": [
          {
            "level": 3,
            "name": "西沙群岛",
            "id": "469037"
          },
          {
            "level": 3,
            "name": "南沙群岛",
            "id": "469038"
          },
          {
            "level": 3,
            "name": "中沙群岛的岛礁及其海域",
            "id": "469039"
          }
        ]
      },
      {
        "level": 2,
        "name": "五指山市",
        "id": "469001",
        "childs": []
      },
      {
        "level": 2,
        "name": "琼海市",
        "id": "469002",
        "childs": []
      },
      {
        "level": 2,
        "name": "儋州市",
        "id": "469003",
        "childs": []
      },
      {
        "level": 2,
        "name": "文昌市",
        "id": "469005",
        "childs": []
      },
      {
        "level": 2,
        "name": "万宁市",
        "id": "469006",
        "childs": []
      },
      {
        "level": 2,
        "name": "东方市",
        "id": "469007",
        "childs": []
      },
      {
        "level": 2,
        "name": "定安县",
        "id": "469025",
        "childs": []
      },
      {
        "level": 2,
        "name": "屯昌县",
        "id": "469026",
        "childs": []
      },
      {
        "level": 2,
        "name": "澄迈县",
        "id": "469027",
        "childs": []
      },
      {
        "level": 2,
        "name": "临高县",
        "id": "469028",
        "childs": []
      },
      {
        "level": 2,
        "name": "白沙黎族自治县",
        "id": "469030",
        "childs": []
      },
      {
        "level": 2,
        "name": "昌江黎族自治县",
        "id": "469031",
        "childs": []
      },
      {
        "level": 2,
        "name": "乐东黎族自治县",
        "id": "469033",
        "childs": []
      },
      {
        "level": 2,
        "name": "陵水黎族自治县",
        "id": "469034",
        "childs": []
      },
      {
        "level": 2,
        "name": "保亭黎族苗族自治县",
        "id": "469035",
        "childs": []
      },
      {
        "level": 2,
        "name": "琼中黎族苗族自治县",
        "id": "469036",
        "childs": []
      }
    ]
  },
  {
    "level": 1,
    "name": "重庆",
    "id": "500000",
    "childs": [
      {
        "level": 2,
        "name": "重庆市",
        "id": "500100",
        "childs": [
          {
            "level": 3,
            "name": "万州区",
            "id": "500101"
          },
          {
            "level": 3,
            "name": "涪陵区",
            "id": "500102"
          },
          {
            "level": 3,
            "name": "渝中区",
            "id": "500103"
          },
          {
            "level": 3,
            "name": "大渡口区",
            "id": "500104"
          },
          {
            "level": 3,
            "name": "江北区",
            "id": "500105"
          },
          {
            "level": 3,
            "name": "沙坪坝区",
            "id": "500106"
          },
          {
            "level": 3,
            "name": "九龙坡区",
            "id": "500107"
          },
          {
            "level": 3,
            "name": "南岸区",
            "id": "500108"
          },
          {
            "level": 3,
            "name": "北碚区",
            "id": "500109"
          },
          {
            "level": 3,
            "name": "万盛区",
            "id": "500110"
          },
          {
            "level": 3,
            "name": "双桥区",
            "id": "500111"
          },
          {
            "level": 3,
            "name": "渝北区",
            "id": "500112"
          },
          {
            "level": 3,
            "name": "巴南区",
            "id": "500113"
          },
          {
            "level": 3,
            "name": "黔江区",
            "id": "500114"
          },
          {
            "level": 3,
            "name": "长寿区",
            "id": "500115"
          },
          {
            "level": 3,
            "name": "綦江区",
            "id": "500222"
          },
          {
            "level": 3,
            "name": "潼南县",
            "id": "500223"
          },
          {
            "level": 3,
            "name": "铜梁县",
            "id": "500224"
          },
          {
            "level": 3,
            "name": "大足区",
            "id": "500225"
          },
          {
            "level": 3,
            "name": "荣昌县",
            "id": "500226"
          },
          {
            "level": 3,
            "name": "璧山县",
            "id": "500227"
          },
          {
            "level": 3,
            "name": "梁平县",
            "id": "500228"
          },
          {
            "level": 3,
            "name": "城口县",
            "id": "500229"
          },
          {
            "level": 3,
            "name": "丰都县",
            "id": "500230"
          },
          {
            "level": 3,
            "name": "垫江县",
            "id": "500231"
          },
          {
            "level": 3,
            "name": "武隆县",
            "id": "500232"
          },
          {
            "level": 3,
            "name": "忠县",
            "id": "500233"
          },
          {
            "level": 3,
            "name": "开县",
            "id": "500234"
          },
          {
            "level": 3,
            "name": "云阳县",
            "id": "500235"
          },
          {
            "level": 3,
            "name": "奉节县",
            "id": "500236"
          },
          {
            "level": 3,
            "name": "巫山县",
            "id": "500237"
          },
          {
            "level": 3,
            "name": "巫溪县",
            "id": "500238"
          },
          {
            "level": 3,
            "name": "石柱土家族自治县",
            "id": "500240"
          },
          {
            "level": 3,
            "name": "秀山土家族苗族自治县",
            "id": "500241"
          },
          {
            "level": 3,
            "name": "酉阳土家族苗族自治县",
            "id": "500242"
          },
          {
            "level": 3,
            "name": "彭水苗族土家族自治县",
            "id": "500243"
          },
          {
            "level": 3,
            "name": "江津区",
            "id": "500381"
          },
          {
            "level": 3,
            "name": "合川区",
            "id": "500382"
          },
          {
            "level": 3,
            "name": "永川区",
            "id": "500383"
          },
          {
            "level": 3,
            "name": "南川区",
            "id": "500384"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "四川省",
    "id": "510000",
    "childs": [
      {
        "level": 2,
        "name": "成都市",
        "id": "510100",
        "childs": [
          {
            "level": 3,
            "name": "锦江区",
            "id": "510104"
          },
          {
            "level": 3,
            "name": "青羊区",
            "id": "510105"
          },
          {
            "level": 3,
            "name": "金牛区",
            "id": "510106"
          },
          {
            "level": 3,
            "name": "武侯区",
            "id": "510107"
          },
          {
            "level": 3,
            "name": "成华区",
            "id": "510108"
          },
          {
            "level": 3,
            "name": "龙泉驿区",
            "id": "510112"
          },
          {
            "level": 3,
            "name": "青白江区",
            "id": "510113"
          },
          {
            "level": 3,
            "name": "新都区",
            "id": "510114"
          },
          {
            "level": 3,
            "name": "温江区",
            "id": "510115"
          },
          {
            "level": 3,
            "name": "金堂县",
            "id": "510121"
          },
          {
            "level": 3,
            "name": "双流县",
            "id": "510122"
          },
          {
            "level": 3,
            "name": "郫县",
            "id": "510124"
          },
          {
            "level": 3,
            "name": "大邑县",
            "id": "510129"
          },
          {
            "level": 3,
            "name": "蒲江县",
            "id": "510131"
          },
          {
            "level": 3,
            "name": "新津县",
            "id": "510132"
          },
          {
            "level": 3,
            "name": "都江堰市",
            "id": "510181"
          },
          {
            "level": 3,
            "name": "彭州市",
            "id": "510182"
          },
          {
            "level": 3,
            "name": "邛崃市",
            "id": "510183"
          },
          {
            "level": 3,
            "name": "崇州市",
            "id": "510184"
          }
        ]
      },
      {
        "level": 2,
        "name": "自贡市",
        "id": "510300",
        "childs": [
          {
            "level": 3,
            "name": "自流井区",
            "id": "510302"
          },
          {
            "level": 3,
            "name": "贡井区",
            "id": "510303"
          },
          {
            "level": 3,
            "name": "大安区",
            "id": "510304"
          },
          {
            "level": 3,
            "name": "沿滩区",
            "id": "510311"
          },
          {
            "level": 3,
            "name": "荣县",
            "id": "510321"
          },
          {
            "level": 3,
            "name": "富顺县",
            "id": "510322"
          }
        ]
      },
      {
        "level": 2,
        "name": "攀枝花市",
        "id": "510400",
        "childs": [
          {
            "level": 3,
            "name": "东区",
            "id": "510402"
          },
          {
            "level": 3,
            "name": "西区",
            "id": "510403"
          },
          {
            "level": 3,
            "name": "仁和区",
            "id": "510411"
          },
          {
            "level": 3,
            "name": "米易县",
            "id": "510421"
          },
          {
            "level": 3,
            "name": "盐边县",
            "id": "510422"
          }
        ]
      },
      {
        "level": 2,
        "name": "泸州市",
        "id": "510500",
        "childs": [
          {
            "level": 3,
            "name": "江阳区",
            "id": "510502"
          },
          {
            "level": 3,
            "name": "纳溪区",
            "id": "510503"
          },
          {
            "level": 3,
            "name": "龙马潭区",
            "id": "510504"
          },
          {
            "level": 3,
            "name": "泸县",
            "id": "510521"
          },
          {
            "level": 3,
            "name": "合江县",
            "id": "510522"
          },
          {
            "level": 3,
            "name": "叙永县",
            "id": "510524"
          },
          {
            "level": 3,
            "name": "古蔺县",
            "id": "510525"
          }
        ]
      },
      {
        "level": 2,
        "name": "德阳市",
        "id": "510600",
        "childs": [
          {
            "level": 3,
            "name": "旌阳区",
            "id": "510603"
          },
          {
            "level": 3,
            "name": "中江县",
            "id": "510623"
          },
          {
            "level": 3,
            "name": "罗江县",
            "id": "510626"
          },
          {
            "level": 3,
            "name": "广汉市",
            "id": "510681"
          },
          {
            "level": 3,
            "name": "什邡市",
            "id": "510682"
          },
          {
            "level": 3,
            "name": "绵竹市",
            "id": "510683"
          }
        ]
      },
      {
        "level": 2,
        "name": "绵阳市",
        "id": "510700",
        "childs": [
          {
            "level": 3,
            "name": "涪城区",
            "id": "510703"
          },
          {
            "level": 3,
            "name": "游仙区",
            "id": "510704"
          },
          {
            "level": 3,
            "name": "其它区",
            "id": "510705"
          },
          {
            "level": 3,
            "name": "三台县",
            "id": "510722"
          },
          {
            "level": 3,
            "name": "盐亭县",
            "id": "510723"
          },
          {
            "level": 3,
            "name": "安县",
            "id": "510724"
          },
          {
            "level": 3,
            "name": "梓潼县",
            "id": "510725"
          },
          {
            "level": 3,
            "name": "北川羌族自治县",
            "id": "510726"
          },
          {
            "level": 3,
            "name": "平武县",
            "id": "510727"
          },
          {
            "level": 3,
            "name": "高新区",
            "id": "510751"
          },
          {
            "level": 3,
            "name": "江油市",
            "id": "510781"
          }
        ]
      },
      {
        "level": 2,
        "name": "广元市",
        "id": "510800",
        "childs": [
          {
            "level": 3,
            "name": "利州区",
            "id": "510802"
          },
          {
            "level": 3,
            "name": "昭化区",
            "id": "510811"
          },
          {
            "level": 3,
            "name": "朝天区",
            "id": "510812"
          },
          {
            "level": 3,
            "name": "旺苍县",
            "id": "510821"
          },
          {
            "level": 3,
            "name": "青川县",
            "id": "510822"
          },
          {
            "level": 3,
            "name": "剑阁县",
            "id": "510823"
          },
          {
            "level": 3,
            "name": "苍溪县",
            "id": "510824"
          }
        ]
      },
      {
        "level": 2,
        "name": "遂宁市",
        "id": "510900",
        "childs": [
          {
            "level": 3,
            "name": "船山区",
            "id": "510903"
          },
          {
            "level": 3,
            "name": "安居区",
            "id": "510904"
          },
          {
            "level": 3,
            "name": "蓬溪县",
            "id": "510921"
          },
          {
            "level": 3,
            "name": "射洪县",
            "id": "510922"
          },
          {
            "level": 3,
            "name": "大英县",
            "id": "510923"
          }
        ]
      },
      {
        "level": 2,
        "name": "内江市",
        "id": "511000",
        "childs": [
          {
            "level": 3,
            "name": "市中区",
            "id": "511002"
          },
          {
            "level": 3,
            "name": "东兴区",
            "id": "511011"
          },
          {
            "level": 3,
            "name": "威远县",
            "id": "511024"
          },
          {
            "level": 3,
            "name": "资中县",
            "id": "511025"
          },
          {
            "level": 3,
            "name": "隆昌县",
            "id": "511028"
          }
        ]
      },
      {
        "level": 2,
        "name": "乐山市",
        "id": "511100",
        "childs": [
          {
            "level": 3,
            "name": "市中区",
            "id": "511102"
          },
          {
            "level": 3,
            "name": "沙湾区",
            "id": "511111"
          },
          {
            "level": 3,
            "name": "五通桥区",
            "id": "511112"
          },
          {
            "level": 3,
            "name": "金口河区",
            "id": "511113"
          },
          {
            "level": 3,
            "name": "犍为县",
            "id": "511123"
          },
          {
            "level": 3,
            "name": "井研县",
            "id": "511124"
          },
          {
            "level": 3,
            "name": "夹江县",
            "id": "511126"
          },
          {
            "level": 3,
            "name": "沐川县",
            "id": "511129"
          },
          {
            "level": 3,
            "name": "峨边彝族自治县",
            "id": "511132"
          },
          {
            "level": 3,
            "name": "马边彝族自治县",
            "id": "511133"
          },
          {
            "level": 3,
            "name": "峨眉山市",
            "id": "511181"
          }
        ]
      },
      {
        "level": 2,
        "name": "南充市",
        "id": "511300",
        "childs": [
          {
            "level": 3,
            "name": "顺庆区",
            "id": "511302"
          },
          {
            "level": 3,
            "name": "高坪区",
            "id": "511303"
          },
          {
            "level": 3,
            "name": "嘉陵区",
            "id": "511304"
          },
          {
            "level": 3,
            "name": "南部县",
            "id": "511321"
          },
          {
            "level": 3,
            "name": "营山县",
            "id": "511322"
          },
          {
            "level": 3,
            "name": "蓬安县",
            "id": "511323"
          },
          {
            "level": 3,
            "name": "仪陇县",
            "id": "511324"
          },
          {
            "level": 3,
            "name": "西充县",
            "id": "511325"
          },
          {
            "level": 3,
            "name": "阆中市",
            "id": "511381"
          }
        ]
      },
      {
        "level": 2,
        "name": "眉山市",
        "id": "511400",
        "childs": [
          {
            "level": 3,
            "name": "东坡区",
            "id": "511402"
          },
          {
            "level": 3,
            "name": "仁寿县",
            "id": "511421"
          },
          {
            "level": 3,
            "name": "彭山县",
            "id": "511422"
          },
          {
            "level": 3,
            "name": "洪雅县",
            "id": "511423"
          },
          {
            "level": 3,
            "name": "丹棱县",
            "id": "511424"
          },
          {
            "level": 3,
            "name": "青神县",
            "id": "511425"
          }
        ]
      },
      {
        "level": 2,
        "name": "宜宾市",
        "id": "511500",
        "childs": [
          {
            "level": 3,
            "name": "翠屏区",
            "id": "511502"
          },
          {
            "level": 3,
            "name": "宜宾县",
            "id": "511521"
          },
          {
            "level": 3,
            "name": "南溪区",
            "id": "511522"
          },
          {
            "level": 3,
            "name": "江安县",
            "id": "511523"
          },
          {
            "level": 3,
            "name": "长宁县",
            "id": "511524"
          },
          {
            "level": 3,
            "name": "高县",
            "id": "511525"
          },
          {
            "level": 3,
            "name": "珙县",
            "id": "511526"
          },
          {
            "level": 3,
            "name": "筠连县",
            "id": "511527"
          },
          {
            "level": 3,
            "name": "兴文县",
            "id": "511528"
          },
          {
            "level": 3,
            "name": "屏山县",
            "id": "511529"
          }
        ]
      },
      {
        "level": 2,
        "name": "广安市",
        "id": "511600",
        "childs": [
          {
            "level": 3,
            "name": "广安区",
            "id": "511602"
          },
          {
            "level": 3,
            "name": "前锋区",
            "id": "511603"
          },
          {
            "level": 3,
            "name": "岳池县",
            "id": "511621"
          },
          {
            "level": 3,
            "name": "武胜县",
            "id": "511622"
          },
          {
            "level": 3,
            "name": "邻水县",
            "id": "511623"
          },
          {
            "level": 3,
            "name": "华蓥市",
            "id": "511681"
          }
        ]
      },
      {
        "level": 2,
        "name": "达州市",
        "id": "511700",
        "childs": [
          {
            "level": 3,
            "name": "通川区",
            "id": "511702"
          },
          {
            "level": 3,
            "name": "达川区",
            "id": "511721"
          },
          {
            "level": 3,
            "name": "宣汉县",
            "id": "511722"
          },
          {
            "level": 3,
            "name": "开江县",
            "id": "511723"
          },
          {
            "level": 3,
            "name": "大竹县",
            "id": "511724"
          },
          {
            "level": 3,
            "name": "渠县",
            "id": "511725"
          },
          {
            "level": 3,
            "name": "万源市",
            "id": "511781"
          }
        ]
      },
      {
        "level": 2,
        "name": "雅安市",
        "id": "511800",
        "childs": [
          {
            "level": 3,
            "name": "雨城区",
            "id": "511802"
          },
          {
            "level": 3,
            "name": "名山区",
            "id": "511821"
          },
          {
            "level": 3,
            "name": "荥经县",
            "id": "511822"
          },
          {
            "level": 3,
            "name": "汉源县",
            "id": "511823"
          },
          {
            "level": 3,
            "name": "石棉县",
            "id": "511824"
          },
          {
            "level": 3,
            "name": "天全县",
            "id": "511825"
          },
          {
            "level": 3,
            "name": "芦山县",
            "id": "511826"
          },
          {
            "level": 3,
            "name": "宝兴县",
            "id": "511827"
          }
        ]
      },
      {
        "level": 2,
        "name": "巴中市",
        "id": "511900",
        "childs": [
          {
            "level": 3,
            "name": "巴州区",
            "id": "511902"
          },
          {
            "level": 3,
            "name": "恩阳区",
            "id": "511903"
          },
          {
            "level": 3,
            "name": "通江县",
            "id": "511921"
          },
          {
            "level": 3,
            "name": "南江县",
            "id": "511922"
          },
          {
            "level": 3,
            "name": "平昌县",
            "id": "511923"
          }
        ]
      },
      {
        "level": 2,
        "name": "资阳市",
        "id": "512000",
        "childs": [
          {
            "level": 3,
            "name": "雁江区",
            "id": "512002"
          },
          {
            "level": 3,
            "name": "安岳县",
            "id": "512021"
          },
          {
            "level": 3,
            "name": "乐至县",
            "id": "512022"
          },
          {
            "level": 3,
            "name": "简阳市",
            "id": "512081"
          }
        ]
      },
      {
        "level": 2,
        "name": "阿坝藏族羌族自治州",
        "id": "513200",
        "childs": [
          {
            "level": 3,
            "name": "汶川县",
            "id": "513221"
          },
          {
            "level": 3,
            "name": "理县",
            "id": "513222"
          },
          {
            "level": 3,
            "name": "茂县",
            "id": "513223"
          },
          {
            "level": 3,
            "name": "松潘县",
            "id": "513224"
          },
          {
            "level": 3,
            "name": "九寨沟县",
            "id": "513225"
          },
          {
            "level": 3,
            "name": "金川县",
            "id": "513226"
          },
          {
            "level": 3,
            "name": "小金县",
            "id": "513227"
          },
          {
            "level": 3,
            "name": "黑水县",
            "id": "513228"
          },
          {
            "level": 3,
            "name": "马尔康县",
            "id": "513229"
          },
          {
            "level": 3,
            "name": "壤塘县",
            "id": "513230"
          },
          {
            "level": 3,
            "name": "阿坝县",
            "id": "513231"
          },
          {
            "level": 3,
            "name": "若尔盖县",
            "id": "513232"
          },
          {
            "level": 3,
            "name": "红原县",
            "id": "513233"
          }
        ]
      },
      {
        "level": 2,
        "name": "甘孜藏族自治州",
        "id": "513300",
        "childs": [
          {
            "level": 3,
            "name": "康定县",
            "id": "513321"
          },
          {
            "level": 3,
            "name": "泸定县",
            "id": "513322"
          },
          {
            "level": 3,
            "name": "丹巴县",
            "id": "513323"
          },
          {
            "level": 3,
            "name": "九龙县",
            "id": "513324"
          },
          {
            "level": 3,
            "name": "雅江县",
            "id": "513325"
          },
          {
            "level": 3,
            "name": "道孚县",
            "id": "513326"
          },
          {
            "level": 3,
            "name": "炉霍县",
            "id": "513327"
          },
          {
            "level": 3,
            "name": "甘孜县",
            "id": "513328"
          },
          {
            "level": 3,
            "name": "新龙县",
            "id": "513329"
          },
          {
            "level": 3,
            "name": "德格县",
            "id": "513330"
          },
          {
            "level": 3,
            "name": "白玉县",
            "id": "513331"
          },
          {
            "level": 3,
            "name": "石渠县",
            "id": "513332"
          },
          {
            "level": 3,
            "name": "色达县",
            "id": "513333"
          },
          {
            "level": 3,
            "name": "理塘县",
            "id": "513334"
          },
          {
            "level": 3,
            "name": "巴塘县",
            "id": "513335"
          },
          {
            "level": 3,
            "name": "乡城县",
            "id": "513336"
          },
          {
            "level": 3,
            "name": "稻城县",
            "id": "513337"
          },
          {
            "level": 3,
            "name": "得荣县",
            "id": "513338"
          }
        ]
      },
      {
        "level": 2,
        "name": "凉山彝族自治州",
        "id": "513400",
        "childs": [
          {
            "level": 3,
            "name": "西昌市",
            "id": "513401"
          },
          {
            "level": 3,
            "name": "木里藏族自治县",
            "id": "513422"
          },
          {
            "level": 3,
            "name": "盐源县",
            "id": "513423"
          },
          {
            "level": 3,
            "name": "德昌县",
            "id": "513424"
          },
          {
            "level": 3,
            "name": "会理县",
            "id": "513425"
          },
          {
            "level": 3,
            "name": "会东县",
            "id": "513426"
          },
          {
            "level": 3,
            "name": "宁南县",
            "id": "513427"
          },
          {
            "level": 3,
            "name": "普格县",
            "id": "513428"
          },
          {
            "level": 3,
            "name": "布拖县",
            "id": "513429"
          },
          {
            "level": 3,
            "name": "金阳县",
            "id": "513430"
          },
          {
            "level": 3,
            "name": "昭觉县",
            "id": "513431"
          },
          {
            "level": 3,
            "name": "喜德县",
            "id": "513432"
          },
          {
            "level": 3,
            "name": "冕宁县",
            "id": "513433"
          },
          {
            "level": 3,
            "name": "越西县",
            "id": "513434"
          },
          {
            "level": 3,
            "name": "甘洛县",
            "id": "513435"
          },
          {
            "level": 3,
            "name": "美姑县",
            "id": "513436"
          },
          {
            "level": 3,
            "name": "雷波县",
            "id": "513437"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "贵州省",
    "id": "520000",
    "childs": [
      {
        "level": 2,
        "name": "贵阳市",
        "id": "520100",
        "childs": [
          {
            "level": 3,
            "name": "南明区",
            "id": "520102"
          },
          {
            "level": 3,
            "name": "云岩区",
            "id": "520103"
          },
          {
            "level": 3,
            "name": "花溪区",
            "id": "520111"
          },
          {
            "level": 3,
            "name": "乌当区",
            "id": "520112"
          },
          {
            "level": 3,
            "name": "白云区",
            "id": "520113"
          },
          {
            "level": 3,
            "name": "小河区",
            "id": "520114"
          },
          {
            "level": 3,
            "name": "开阳县",
            "id": "520121"
          },
          {
            "level": 3,
            "name": "息烽县",
            "id": "520122"
          },
          {
            "level": 3,
            "name": "修文县",
            "id": "520123"
          },
          {
            "level": 3,
            "name": "观山湖区",
            "id": "520151"
          },
          {
            "level": 3,
            "name": "清镇市",
            "id": "520181"
          }
        ]
      },
      {
        "level": 2,
        "name": "六盘水市",
        "id": "520200",
        "childs": [
          {
            "level": 3,
            "name": "钟山区",
            "id": "520201"
          },
          {
            "level": 3,
            "name": "六枝特区",
            "id": "520203"
          },
          {
            "level": 3,
            "name": "水城县",
            "id": "520221"
          },
          {
            "level": 3,
            "name": "盘县",
            "id": "520222"
          }
        ]
      },
      {
        "level": 2,
        "name": "遵义市",
        "id": "520300",
        "childs": [
          {
            "level": 3,
            "name": "红花岗区",
            "id": "520302"
          },
          {
            "level": 3,
            "name": "汇川区",
            "id": "520303"
          },
          {
            "level": 3,
            "name": "遵义县",
            "id": "520321"
          },
          {
            "level": 3,
            "name": "桐梓县",
            "id": "520322"
          },
          {
            "level": 3,
            "name": "绥阳县",
            "id": "520323"
          },
          {
            "level": 3,
            "name": "正安县",
            "id": "520324"
          },
          {
            "level": 3,
            "name": "道真仡佬族苗族自治县",
            "id": "520325"
          },
          {
            "level": 3,
            "name": "务川仡佬族苗族自治县",
            "id": "520326"
          },
          {
            "level": 3,
            "name": "凤冈县",
            "id": "520327"
          },
          {
            "level": 3,
            "name": "湄潭县",
            "id": "520328"
          },
          {
            "level": 3,
            "name": "余庆县",
            "id": "520329"
          },
          {
            "level": 3,
            "name": "习水县",
            "id": "520330"
          },
          {
            "level": 3,
            "name": "赤水市",
            "id": "520381"
          },
          {
            "level": 3,
            "name": "仁怀市",
            "id": "520382"
          }
        ]
      },
      {
        "level": 2,
        "name": "安顺市",
        "id": "520400",
        "childs": [
          {
            "level": 3,
            "name": "西秀区",
            "id": "520402"
          },
          {
            "level": 3,
            "name": "平坝县",
            "id": "520421"
          },
          {
            "level": 3,
            "name": "普定县",
            "id": "520422"
          },
          {
            "level": 3,
            "name": "镇宁布依族苗族自治县",
            "id": "520423"
          },
          {
            "level": 3,
            "name": "关岭布依族苗族自治县",
            "id": "520424"
          },
          {
            "level": 3,
            "name": "紫云苗族布依族自治县",
            "id": "520425"
          }
        ]
      },
      {
        "level": 2,
        "name": "铜仁市",
        "id": "522200",
        "childs": [
          {
            "level": 3,
            "name": "碧江区",
            "id": "522201"
          },
          {
            "level": 3,
            "name": "江口县",
            "id": "522222"
          },
          {
            "level": 3,
            "name": "玉屏侗族自治县",
            "id": "522223"
          },
          {
            "level": 3,
            "name": "石阡县",
            "id": "522224"
          },
          {
            "level": 3,
            "name": "思南县",
            "id": "522225"
          },
          {
            "level": 3,
            "name": "印江土家族苗族自治县",
            "id": "522226"
          },
          {
            "level": 3,
            "name": "德江县",
            "id": "522227"
          },
          {
            "level": 3,
            "name": "沿河土家族自治县",
            "id": "522228"
          },
          {
            "level": 3,
            "name": "松桃苗族自治县",
            "id": "522229"
          },
          {
            "level": 3,
            "name": "万山区",
            "id": "522230"
          }
        ]
      },
      {
        "level": 2,
        "name": "黔西南布依族苗族自治州",
        "id": "522300",
        "childs": [
          {
            "level": 3,
            "name": "兴义市",
            "id": "522301"
          },
          {
            "level": 3,
            "name": "兴仁县",
            "id": "522322"
          },
          {
            "level": 3,
            "name": "普安县",
            "id": "522323"
          },
          {
            "level": 3,
            "name": "晴隆县",
            "id": "522324"
          },
          {
            "level": 3,
            "name": "贞丰县",
            "id": "522325"
          },
          {
            "level": 3,
            "name": "望谟县",
            "id": "522326"
          },
          {
            "level": 3,
            "name": "册亨县",
            "id": "522327"
          },
          {
            "level": 3,
            "name": "安龙县",
            "id": "522328"
          }
        ]
      },
      {
        "level": 2,
        "name": "毕节市",
        "id": "522400",
        "childs": [
          {
            "level": 3,
            "name": "七星关区",
            "id": "522401"
          },
          {
            "level": 3,
            "name": "大方县",
            "id": "522422"
          },
          {
            "level": 3,
            "name": "黔西县",
            "id": "522423"
          },
          {
            "level": 3,
            "name": "金沙县",
            "id": "522424"
          },
          {
            "level": 3,
            "name": "织金县",
            "id": "522425"
          },
          {
            "level": 3,
            "name": "纳雍县",
            "id": "522426"
          },
          {
            "level": 3,
            "name": "威宁彝族回族苗族自治县",
            "id": "522427"
          },
          {
            "level": 3,
            "name": "赫章县",
            "id": "522428"
          }
        ]
      },
      {
        "level": 2,
        "name": "黔东南苗族侗族自治州",
        "id": "522600",
        "childs": [
          {
            "level": 3,
            "name": "凯里市",
            "id": "522601"
          },
          {
            "level": 3,
            "name": "黄平县",
            "id": "522622"
          },
          {
            "level": 3,
            "name": "施秉县",
            "id": "522623"
          },
          {
            "level": 3,
            "name": "三穗县",
            "id": "522624"
          },
          {
            "level": 3,
            "name": "镇远县",
            "id": "522625"
          },
          {
            "level": 3,
            "name": "岑巩县",
            "id": "522626"
          },
          {
            "level": 3,
            "name": "天柱县",
            "id": "522627"
          },
          {
            "level": 3,
            "name": "锦屏县",
            "id": "522628"
          },
          {
            "level": 3,
            "name": "剑河县",
            "id": "522629"
          },
          {
            "level": 3,
            "name": "台江县",
            "id": "522630"
          },
          {
            "level": 3,
            "name": "黎平县",
            "id": "522631"
          },
          {
            "level": 3,
            "name": "榕江县",
            "id": "522632"
          },
          {
            "level": 3,
            "name": "从江县",
            "id": "522633"
          },
          {
            "level": 3,
            "name": "雷山县",
            "id": "522634"
          },
          {
            "level": 3,
            "name": "麻江县",
            "id": "522635"
          },
          {
            "level": 3,
            "name": "丹寨县",
            "id": "522636"
          }
        ]
      },
      {
        "level": 2,
        "name": "黔南布依族苗族自治州",
        "id": "522700",
        "childs": [
          {
            "level": 3,
            "name": "都匀市",
            "id": "522701"
          },
          {
            "level": 3,
            "name": "福泉市",
            "id": "522702"
          },
          {
            "level": 3,
            "name": "荔波县",
            "id": "522722"
          },
          {
            "level": 3,
            "name": "贵定县",
            "id": "522723"
          },
          {
            "level": 3,
            "name": "瓮安县",
            "id": "522725"
          },
          {
            "level": 3,
            "name": "独山县",
            "id": "522726"
          },
          {
            "level": 3,
            "name": "平塘县",
            "id": "522727"
          },
          {
            "level": 3,
            "name": "罗甸县",
            "id": "522728"
          },
          {
            "level": 3,
            "name": "长顺县",
            "id": "522729"
          },
          {
            "level": 3,
            "name": "龙里县",
            "id": "522730"
          },
          {
            "level": 3,
            "name": "惠水县",
            "id": "522731"
          },
          {
            "level": 3,
            "name": "三都水族自治县",
            "id": "522732"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "云南省",
    "id": "530000",
    "childs": [
      {
        "level": 2,
        "name": "昆明市",
        "id": "530100",
        "childs": [
          {
            "level": 3,
            "name": "五华区",
            "id": "530102"
          },
          {
            "level": 3,
            "name": "盘龙区",
            "id": "530103"
          },
          {
            "level": 3,
            "name": "官渡区",
            "id": "530111"
          },
          {
            "level": 3,
            "name": "西山区",
            "id": "530112"
          },
          {
            "level": 3,
            "name": "东川区",
            "id": "530113"
          },
          {
            "level": 3,
            "name": "呈贡区",
            "id": "530121"
          },
          {
            "level": 3,
            "name": "晋宁县",
            "id": "530122"
          },
          {
            "level": 3,
            "name": "富民县",
            "id": "530124"
          },
          {
            "level": 3,
            "name": "宜良县",
            "id": "530125"
          },
          {
            "level": 3,
            "name": "石林彝族自治县",
            "id": "530126"
          },
          {
            "level": 3,
            "name": "嵩明县",
            "id": "530127"
          },
          {
            "level": 3,
            "name": "禄劝彝族苗族自治县",
            "id": "530128"
          },
          {
            "level": 3,
            "name": "寻甸回族彝族自治县",
            "id": "530129"
          },
          {
            "level": 3,
            "name": "安宁市",
            "id": "530181"
          }
        ]
      },
      {
        "level": 2,
        "name": "曲靖市",
        "id": "530300",
        "childs": [
          {
            "level": 3,
            "name": "麒麟区",
            "id": "530302"
          },
          {
            "level": 3,
            "name": "马龙县",
            "id": "530321"
          },
          {
            "level": 3,
            "name": "陆良县",
            "id": "530322"
          },
          {
            "level": 3,
            "name": "师宗县",
            "id": "530323"
          },
          {
            "level": 3,
            "name": "罗平县",
            "id": "530324"
          },
          {
            "level": 3,
            "name": "富源县",
            "id": "530325"
          },
          {
            "level": 3,
            "name": "会泽县",
            "id": "530326"
          },
          {
            "level": 3,
            "name": "沾益县",
            "id": "530328"
          },
          {
            "level": 3,
            "name": "宣威市",
            "id": "530381"
          }
        ]
      },
      {
        "level": 2,
        "name": "玉溪市",
        "id": "530400",
        "childs": [
          {
            "level": 3,
            "name": "红塔区",
            "id": "530402"
          },
          {
            "level": 3,
            "name": "江川县",
            "id": "530421"
          },
          {
            "level": 3,
            "name": "澄江县",
            "id": "530422"
          },
          {
            "level": 3,
            "name": "通海县",
            "id": "530423"
          },
          {
            "level": 3,
            "name": "华宁县",
            "id": "530424"
          },
          {
            "level": 3,
            "name": "易门县",
            "id": "530425"
          },
          {
            "level": 3,
            "name": "峨山彝族自治县",
            "id": "530426"
          },
          {
            "level": 3,
            "name": "新平彝族傣族自治县",
            "id": "530427"
          },
          {
            "level": 3,
            "name": "元江哈尼族彝族傣族自治县",
            "id": "530428"
          }
        ]
      },
      {
        "level": 2,
        "name": "保山市",
        "id": "530500",
        "childs": [
          {
            "level": 3,
            "name": "隆阳区",
            "id": "530502"
          },
          {
            "level": 3,
            "name": "施甸县",
            "id": "530521"
          },
          {
            "level": 3,
            "name": "腾冲县",
            "id": "530522"
          },
          {
            "level": 3,
            "name": "龙陵县",
            "id": "530523"
          },
          {
            "level": 3,
            "name": "昌宁县",
            "id": "530524"
          }
        ]
      },
      {
        "level": 2,
        "name": "昭通市",
        "id": "530600",
        "childs": [
          {
            "level": 3,
            "name": "昭阳区",
            "id": "530602"
          },
          {
            "level": 3,
            "name": "鲁甸县",
            "id": "530621"
          },
          {
            "level": 3,
            "name": "巧家县",
            "id": "530622"
          },
          {
            "level": 3,
            "name": "盐津县",
            "id": "530623"
          },
          {
            "level": 3,
            "name": "大关县",
            "id": "530624"
          },
          {
            "level": 3,
            "name": "永善县",
            "id": "530625"
          },
          {
            "level": 3,
            "name": "绥江县",
            "id": "530626"
          },
          {
            "level": 3,
            "name": "镇雄县",
            "id": "530627"
          },
          {
            "level": 3,
            "name": "彝良县",
            "id": "530628"
          },
          {
            "level": 3,
            "name": "威信县",
            "id": "530629"
          },
          {
            "level": 3,
            "name": "水富县",
            "id": "530630"
          }
        ]
      },
      {
        "level": 2,
        "name": "丽江市",
        "id": "530700",
        "childs": [
          {
            "level": 3,
            "name": "古城区",
            "id": "530702"
          },
          {
            "level": 3,
            "name": "玉龙纳西族自治县",
            "id": "530721"
          },
          {
            "level": 3,
            "name": "永胜县",
            "id": "530722"
          },
          {
            "level": 3,
            "name": "华坪县",
            "id": "530723"
          },
          {
            "level": 3,
            "name": "宁蒗彝族自治县",
            "id": "530724"
          }
        ]
      },
      {
        "level": 2,
        "name": "普洱市",
        "id": "530800",
        "childs": [
          {
            "level": 3,
            "name": "思茅区",
            "id": "530802"
          },
          {
            "level": 3,
            "name": "宁洱哈尼族彝族自治县",
            "id": "530821"
          },
          {
            "level": 3,
            "name": "墨江哈尼族自治县",
            "id": "530822"
          },
          {
            "level": 3,
            "name": "景东彝族自治县",
            "id": "530823"
          },
          {
            "level": 3,
            "name": "景谷傣族彝族自治县",
            "id": "530824"
          },
          {
            "level": 3,
            "name": "镇沅彝族哈尼族拉祜族自治县",
            "id": "530825"
          },
          {
            "level": 3,
            "name": "江城哈尼族彝族自治县",
            "id": "530826"
          },
          {
            "level": 3,
            "name": "孟连傣族拉祜族佤族自治县",
            "id": "530827"
          },
          {
            "level": 3,
            "name": "澜沧拉祜族自治县",
            "id": "530828"
          },
          {
            "level": 3,
            "name": "西盟佤族自治县",
            "id": "530829"
          }
        ]
      },
      {
        "level": 2,
        "name": "临沧市",
        "id": "530900",
        "childs": [
          {
            "level": 3,
            "name": "临翔区",
            "id": "530902"
          },
          {
            "level": 3,
            "name": "凤庆县",
            "id": "530921"
          },
          {
            "level": 3,
            "name": "云县",
            "id": "530922"
          },
          {
            "level": 3,
            "name": "永德县",
            "id": "530923"
          },
          {
            "level": 3,
            "name": "镇康县",
            "id": "530924"
          },
          {
            "level": 3,
            "name": "双江拉祜族佤族布朗族傣族自治县",
            "id": "530925"
          },
          {
            "level": 3,
            "name": "耿马傣族佤族自治县",
            "id": "530926"
          },
          {
            "level": 3,
            "name": "沧源佤族自治县",
            "id": "530927"
          }
        ]
      },
      {
        "level": 2,
        "name": "楚雄彝族自治州",
        "id": "532300",
        "childs": [
          {
            "level": 3,
            "name": "楚雄市",
            "id": "532301"
          },
          {
            "level": 3,
            "name": "双柏县",
            "id": "532322"
          },
          {
            "level": 3,
            "name": "牟定县",
            "id": "532323"
          },
          {
            "level": 3,
            "name": "南华县",
            "id": "532324"
          },
          {
            "level": 3,
            "name": "姚安县",
            "id": "532325"
          },
          {
            "level": 3,
            "name": "大姚县",
            "id": "532326"
          },
          {
            "level": 3,
            "name": "永仁县",
            "id": "532327"
          },
          {
            "level": 3,
            "name": "元谋县",
            "id": "532328"
          },
          {
            "level": 3,
            "name": "武定县",
            "id": "532329"
          },
          {
            "level": 3,
            "name": "禄丰县",
            "id": "532331"
          }
        ]
      },
      {
        "level": 2,
        "name": "红河哈尼族彝族自治州",
        "id": "532500",
        "childs": [
          {
            "level": 3,
            "name": "个旧市",
            "id": "532501"
          },
          {
            "level": 3,
            "name": "开远市",
            "id": "532502"
          },
          {
            "level": 3,
            "name": "蒙自市",
            "id": "532522"
          },
          {
            "level": 3,
            "name": "屏边苗族自治县",
            "id": "532523"
          },
          {
            "level": 3,
            "name": "建水县",
            "id": "532524"
          },
          {
            "level": 3,
            "name": "石屏县",
            "id": "532525"
          },
          {
            "level": 3,
            "name": "弥勒市",
            "id": "532526"
          },
          {
            "level": 3,
            "name": "泸西县",
            "id": "532527"
          },
          {
            "level": 3,
            "name": "元阳县",
            "id": "532528"
          },
          {
            "level": 3,
            "name": "红河县",
            "id": "532529"
          },
          {
            "level": 3,
            "name": "金平苗族瑶族傣族自治县",
            "id": "532530"
          },
          {
            "level": 3,
            "name": "绿春县",
            "id": "532531"
          },
          {
            "level": 3,
            "name": "河口瑶族自治县",
            "id": "532532"
          }
        ]
      },
      {
        "level": 2,
        "name": "文山壮族苗族自治州",
        "id": "532600",
        "childs": [
          {
            "level": 3,
            "name": "文山市",
            "id": "532621"
          },
          {
            "level": 3,
            "name": "砚山县",
            "id": "532622"
          },
          {
            "level": 3,
            "name": "西畴县",
            "id": "532623"
          },
          {
            "level": 3,
            "name": "麻栗坡县",
            "id": "532624"
          },
          {
            "level": 3,
            "name": "马关县",
            "id": "532625"
          },
          {
            "level": 3,
            "name": "丘北县",
            "id": "532626"
          },
          {
            "level": 3,
            "name": "广南县",
            "id": "532627"
          },
          {
            "level": 3,
            "name": "富宁县",
            "id": "532628"
          }
        ]
      },
      {
        "level": 2,
        "name": "西双版纳傣族自治州",
        "id": "532800",
        "childs": [
          {
            "level": 3,
            "name": "景洪市",
            "id": "532801"
          },
          {
            "level": 3,
            "name": "勐海县",
            "id": "532822"
          },
          {
            "level": 3,
            "name": "勐腊县",
            "id": "532823"
          }
        ]
      },
      {
        "level": 2,
        "name": "大理白族自治州",
        "id": "532900",
        "childs": [
          {
            "level": 3,
            "name": "大理市",
            "id": "532901"
          },
          {
            "level": 3,
            "name": "漾濞彝族自治县",
            "id": "532922"
          },
          {
            "level": 3,
            "name": "祥云县",
            "id": "532923"
          },
          {
            "level": 3,
            "name": "宾川县",
            "id": "532924"
          },
          {
            "level": 3,
            "name": "弥渡县",
            "id": "532925"
          },
          {
            "level": 3,
            "name": "南涧彝族自治县",
            "id": "532926"
          },
          {
            "level": 3,
            "name": "巍山彝族回族自治县",
            "id": "532927"
          },
          {
            "level": 3,
            "name": "永平县",
            "id": "532928"
          },
          {
            "level": 3,
            "name": "云龙县",
            "id": "532929"
          },
          {
            "level": 3,
            "name": "洱源县",
            "id": "532930"
          },
          {
            "level": 3,
            "name": "剑川县",
            "id": "532931"
          },
          {
            "level": 3,
            "name": "鹤庆县",
            "id": "532932"
          }
        ]
      },
      {
        "level": 2,
        "name": "德宏傣族景颇族自治州",
        "id": "533100",
        "childs": [
          {
            "level": 3,
            "name": "瑞丽市",
            "id": "533102"
          },
          {
            "level": 3,
            "name": "芒市",
            "id": "533103"
          },
          {
            "level": 3,
            "name": "梁河县",
            "id": "533122"
          },
          {
            "level": 3,
            "name": "盈江县",
            "id": "533123"
          },
          {
            "level": 3,
            "name": "陇川县",
            "id": "533124"
          }
        ]
      },
      {
        "level": 2,
        "name": "怒江傈僳族自治州",
        "id": "533300",
        "childs": [
          {
            "level": 3,
            "name": "泸水县",
            "id": "533321"
          },
          {
            "level": 3,
            "name": "福贡县",
            "id": "533323"
          },
          {
            "level": 3,
            "name": "贡山独龙族怒族自治县",
            "id": "533324"
          },
          {
            "level": 3,
            "name": "兰坪白族普米族自治县",
            "id": "533325"
          }
        ]
      },
      {
        "level": 2,
        "name": "迪庆藏族自治州",
        "id": "533400",
        "childs": [
          {
            "level": 3,
            "name": "香格里拉县",
            "id": "533421"
          },
          {
            "level": 3,
            "name": "德钦县",
            "id": "533422"
          },
          {
            "level": 3,
            "name": "维西傈僳族自治县",
            "id": "533423"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "西藏自治区",
    "id": "540000",
    "childs": [
      {
        "level": 2,
        "name": "拉萨市",
        "id": "540100",
        "childs": [
          {
            "level": 3,
            "name": "城关区",
            "id": "540102"
          },
          {
            "level": 3,
            "name": "林周县",
            "id": "540121"
          },
          {
            "level": 3,
            "name": "当雄县",
            "id": "540122"
          },
          {
            "level": 3,
            "name": "尼木县",
            "id": "540123"
          },
          {
            "level": 3,
            "name": "曲水县",
            "id": "540124"
          },
          {
            "level": 3,
            "name": "堆龙德庆县",
            "id": "540125"
          },
          {
            "level": 3,
            "name": "达孜县",
            "id": "540126"
          },
          {
            "level": 3,
            "name": "墨竹工卡县",
            "id": "540127"
          }
        ]
      },
      {
        "level": 2,
        "name": "昌都地区",
        "id": "542100",
        "childs": [
          {
            "level": 3,
            "name": "昌都县",
            "id": "542121"
          },
          {
            "level": 3,
            "name": "江达县",
            "id": "542122"
          },
          {
            "level": 3,
            "name": "贡觉县",
            "id": "542123"
          },
          {
            "level": 3,
            "name": "类乌齐县",
            "id": "542124"
          },
          {
            "level": 3,
            "name": "丁青县",
            "id": "542125"
          },
          {
            "level": 3,
            "name": "察雅县",
            "id": "542126"
          },
          {
            "level": 3,
            "name": "八宿县",
            "id": "542127"
          },
          {
            "level": 3,
            "name": "左贡县",
            "id": "542128"
          },
          {
            "level": 3,
            "name": "芒康县",
            "id": "542129"
          },
          {
            "level": 3,
            "name": "洛隆县",
            "id": "542132"
          },
          {
            "level": 3,
            "name": "边坝县",
            "id": "542133"
          }
        ]
      },
      {
        "level": 2,
        "name": "山南地区",
        "id": "542200",
        "childs": [
          {
            "level": 3,
            "name": "乃东县",
            "id": "542221"
          },
          {
            "level": 3,
            "name": "扎囊县",
            "id": "542222"
          },
          {
            "level": 3,
            "name": "贡嘎县",
            "id": "542223"
          },
          {
            "level": 3,
            "name": "桑日县",
            "id": "542224"
          },
          {
            "level": 3,
            "name": "琼结县",
            "id": "542225"
          },
          {
            "level": 3,
            "name": "曲松县",
            "id": "542226"
          },
          {
            "level": 3,
            "name": "措美县",
            "id": "542227"
          },
          {
            "level": 3,
            "name": "洛扎县",
            "id": "542228"
          },
          {
            "level": 3,
            "name": "加查县",
            "id": "542229"
          },
          {
            "level": 3,
            "name": "隆子县",
            "id": "542231"
          },
          {
            "level": 3,
            "name": "错那县",
            "id": "542232"
          },
          {
            "level": 3,
            "name": "浪卡子县",
            "id": "542233"
          }
        ]
      },
      {
        "level": 2,
        "name": "日喀则地区",
        "id": "542300",
        "childs": [
          {
            "level": 3,
            "name": "日喀则市",
            "id": "542301"
          },
          {
            "level": 3,
            "name": "南木林县",
            "id": "542322"
          },
          {
            "level": 3,
            "name": "江孜县",
            "id": "542323"
          },
          {
            "level": 3,
            "name": "定日县",
            "id": "542324"
          },
          {
            "level": 3,
            "name": "萨迦县",
            "id": "542325"
          },
          {
            "level": 3,
            "name": "拉孜县",
            "id": "542326"
          },
          {
            "level": 3,
            "name": "昂仁县",
            "id": "542327"
          },
          {
            "level": 3,
            "name": "谢通门县",
            "id": "542328"
          },
          {
            "level": 3,
            "name": "白朗县",
            "id": "542329"
          },
          {
            "level": 3,
            "name": "仁布县",
            "id": "542330"
          },
          {
            "level": 3,
            "name": "康马县",
            "id": "542331"
          },
          {
            "level": 3,
            "name": "定结县",
            "id": "542332"
          },
          {
            "level": 3,
            "name": "仲巴县",
            "id": "542333"
          },
          {
            "level": 3,
            "name": "亚东县",
            "id": "542334"
          },
          {
            "level": 3,
            "name": "吉隆县",
            "id": "542335"
          },
          {
            "level": 3,
            "name": "聂拉木县",
            "id": "542336"
          },
          {
            "level": 3,
            "name": "萨嘎县",
            "id": "542337"
          },
          {
            "level": 3,
            "name": "岗巴县",
            "id": "542338"
          }
        ]
      },
      {
        "level": 2,
        "name": "那曲地区",
        "id": "542400",
        "childs": [
          {
            "level": 3,
            "name": "那曲县",
            "id": "542421"
          },
          {
            "level": 3,
            "name": "嘉黎县",
            "id": "542422"
          },
          {
            "level": 3,
            "name": "比如县",
            "id": "542423"
          },
          {
            "level": 3,
            "name": "聂荣县",
            "id": "542424"
          },
          {
            "level": 3,
            "name": "安多县",
            "id": "542425"
          },
          {
            "level": 3,
            "name": "申扎县",
            "id": "542426"
          },
          {
            "level": 3,
            "name": "索县",
            "id": "542427"
          },
          {
            "level": 3,
            "name": "班戈县",
            "id": "542428"
          },
          {
            "level": 3,
            "name": "巴青县",
            "id": "542429"
          },
          {
            "level": 3,
            "name": "尼玛县",
            "id": "542430"
          },
          {
            "level": 3,
            "name": "双湖县",
            "id": "542431"
          }
        ]
      },
      {
        "level": 2,
        "name": "阿里地区",
        "id": "542500",
        "childs": [
          {
            "level": 3,
            "name": "普兰县",
            "id": "542521"
          },
          {
            "level": 3,
            "name": "札达县",
            "id": "542522"
          },
          {
            "level": 3,
            "name": "噶尔县",
            "id": "542523"
          },
          {
            "level": 3,
            "name": "日土县",
            "id": "542524"
          },
          {
            "level": 3,
            "name": "革吉县",
            "id": "542525"
          },
          {
            "level": 3,
            "name": "改则县",
            "id": "542526"
          },
          {
            "level": 3,
            "name": "措勤县",
            "id": "542527"
          }
        ]
      },
      {
        "level": 2,
        "name": "林芝地区",
        "id": "542600",
        "childs": [
          {
            "level": 3,
            "name": "林芝县",
            "id": "542621"
          },
          {
            "level": 3,
            "name": "工布江达县",
            "id": "542622"
          },
          {
            "level": 3,
            "name": "米林县",
            "id": "542623"
          },
          {
            "level": 3,
            "name": "墨脱县",
            "id": "542624"
          },
          {
            "level": 3,
            "name": "波密县",
            "id": "542625"
          },
          {
            "level": 3,
            "name": "察隅县",
            "id": "542626"
          },
          {
            "level": 3,
            "name": "朗县",
            "id": "542627"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "陕西省",
    "id": "610000",
    "childs": [
      {
        "level": 2,
        "name": "西安市",
        "id": "610100",
        "childs": [
          {
            "level": 3,
            "name": "新城区",
            "id": "610102"
          },
          {
            "level": 3,
            "name": "碑林区",
            "id": "610103"
          },
          {
            "level": 3,
            "name": "莲湖区",
            "id": "610104"
          },
          {
            "level": 3,
            "name": "灞桥区",
            "id": "610111"
          },
          {
            "level": 3,
            "name": "未央区",
            "id": "610112"
          },
          {
            "level": 3,
            "name": "雁塔区",
            "id": "610113"
          },
          {
            "level": 3,
            "name": "阎良区",
            "id": "610114"
          },
          {
            "level": 3,
            "name": "临潼区",
            "id": "610115"
          },
          {
            "level": 3,
            "name": "长安区",
            "id": "610116"
          },
          {
            "level": 3,
            "name": "蓝田县",
            "id": "610122"
          },
          {
            "level": 3,
            "name": "周至县",
            "id": "610124"
          },
          {
            "level": 3,
            "name": "户县",
            "id": "610125"
          },
          {
            "level": 3,
            "name": "高陵县",
            "id": "610126"
          }
        ]
      },
      {
        "level": 2,
        "name": "铜川市",
        "id": "610200",
        "childs": [
          {
            "level": 3,
            "name": "王益区",
            "id": "610202"
          },
          {
            "level": 3,
            "name": "印台区",
            "id": "610203"
          },
          {
            "level": 3,
            "name": "耀州区",
            "id": "610204"
          },
          {
            "level": 3,
            "name": "宜君县",
            "id": "610222"
          }
        ]
      },
      {
        "level": 2,
        "name": "宝鸡市",
        "id": "610300",
        "childs": [
          {
            "level": 3,
            "name": "渭滨区",
            "id": "610302"
          },
          {
            "level": 3,
            "name": "金台区",
            "id": "610303"
          },
          {
            "level": 3,
            "name": "陈仓区",
            "id": "610304"
          },
          {
            "level": 3,
            "name": "凤翔县",
            "id": "610322"
          },
          {
            "level": 3,
            "name": "岐山县",
            "id": "610323"
          },
          {
            "level": 3,
            "name": "扶风县",
            "id": "610324"
          },
          {
            "level": 3,
            "name": "眉县",
            "id": "610326"
          },
          {
            "level": 3,
            "name": "陇县",
            "id": "610327"
          },
          {
            "level": 3,
            "name": "千阳县",
            "id": "610328"
          },
          {
            "level": 3,
            "name": "麟游县",
            "id": "610329"
          },
          {
            "level": 3,
            "name": "凤县",
            "id": "610330"
          },
          {
            "level": 3,
            "name": "太白县",
            "id": "610331"
          }
        ]
      },
      {
        "level": 2,
        "name": "咸阳市",
        "id": "610400",
        "childs": [
          {
            "level": 3,
            "name": "秦都区",
            "id": "610402"
          },
          {
            "level": 3,
            "name": "杨陵区",
            "id": "610403"
          },
          {
            "level": 3,
            "name": "渭城区",
            "id": "610404"
          },
          {
            "level": 3,
            "name": "三原县",
            "id": "610422"
          },
          {
            "level": 3,
            "name": "泾阳县",
            "id": "610423"
          },
          {
            "level": 3,
            "name": "乾县",
            "id": "610424"
          },
          {
            "level": 3,
            "name": "礼泉县",
            "id": "610425"
          },
          {
            "level": 3,
            "name": "永寿县",
            "id": "610426"
          },
          {
            "level": 3,
            "name": "彬县",
            "id": "610427"
          },
          {
            "level": 3,
            "name": "长武县",
            "id": "610428"
          },
          {
            "level": 3,
            "name": "旬邑县",
            "id": "610429"
          },
          {
            "level": 3,
            "name": "淳化县",
            "id": "610430"
          },
          {
            "level": 3,
            "name": "武功县",
            "id": "610431"
          },
          {
            "level": 3,
            "name": "兴平市",
            "id": "610481"
          }
        ]
      },
      {
        "level": 2,
        "name": "渭南市",
        "id": "610500",
        "childs": [
          {
            "level": 3,
            "name": "临渭区",
            "id": "610502"
          },
          {
            "level": 3,
            "name": "华县",
            "id": "610521"
          },
          {
            "level": 3,
            "name": "潼关县",
            "id": "610522"
          },
          {
            "level": 3,
            "name": "大荔县",
            "id": "610523"
          },
          {
            "level": 3,
            "name": "合阳县",
            "id": "610524"
          },
          {
            "level": 3,
            "name": "澄城县",
            "id": "610525"
          },
          {
            "level": 3,
            "name": "蒲城县",
            "id": "610526"
          },
          {
            "level": 3,
            "name": "白水县",
            "id": "610527"
          },
          {
            "level": 3,
            "name": "富平县",
            "id": "610528"
          },
          {
            "level": 3,
            "name": "韩城市",
            "id": "610581"
          },
          {
            "level": 3,
            "name": "华阴市",
            "id": "610582"
          }
        ]
      },
      {
        "level": 2,
        "name": "延安市",
        "id": "610600",
        "childs": [
          {
            "level": 3,
            "name": "宝塔区",
            "id": "610602"
          },
          {
            "level": 3,
            "name": "延长县",
            "id": "610621"
          },
          {
            "level": 3,
            "name": "延川县",
            "id": "610622"
          },
          {
            "level": 3,
            "name": "子长县",
            "id": "610623"
          },
          {
            "level": 3,
            "name": "安塞县",
            "id": "610624"
          },
          {
            "level": 3,
            "name": "志丹县",
            "id": "610625"
          },
          {
            "level": 3,
            "name": "吴起县",
            "id": "610626"
          },
          {
            "level": 3,
            "name": "甘泉县",
            "id": "610627"
          },
          {
            "level": 3,
            "name": "富县",
            "id": "610628"
          },
          {
            "level": 3,
            "name": "洛川县",
            "id": "610629"
          },
          {
            "level": 3,
            "name": "宜川县",
            "id": "610630"
          },
          {
            "level": 3,
            "name": "黄龙县",
            "id": "610631"
          },
          {
            "level": 3,
            "name": "黄陵县",
            "id": "610632"
          }
        ]
      },
      {
        "level": 2,
        "name": "汉中市",
        "id": "610700",
        "childs": [
          {
            "level": 3,
            "name": "汉台区",
            "id": "610702"
          },
          {
            "level": 3,
            "name": "南郑县",
            "id": "610721"
          },
          {
            "level": 3,
            "name": "城固县",
            "id": "610722"
          },
          {
            "level": 3,
            "name": "洋县",
            "id": "610723"
          },
          {
            "level": 3,
            "name": "西乡县",
            "id": "610724"
          },
          {
            "level": 3,
            "name": "勉县",
            "id": "610725"
          },
          {
            "level": 3,
            "name": "宁强县",
            "id": "610726"
          },
          {
            "level": 3,
            "name": "略阳县",
            "id": "610727"
          },
          {
            "level": 3,
            "name": "镇巴县",
            "id": "610728"
          },
          {
            "level": 3,
            "name": "留坝县",
            "id": "610729"
          },
          {
            "level": 3,
            "name": "佛坪县",
            "id": "610730"
          }
        ]
      },
      {
        "level": 2,
        "name": "榆林市",
        "id": "610800",
        "childs": [
          {
            "level": 3,
            "name": "榆阳区",
            "id": "610802"
          },
          {
            "level": 3,
            "name": "神木县",
            "id": "610821"
          },
          {
            "level": 3,
            "name": "府谷县",
            "id": "610822"
          },
          {
            "level": 3,
            "name": "横山县",
            "id": "610823"
          },
          {
            "level": 3,
            "name": "靖边县",
            "id": "610824"
          },
          {
            "level": 3,
            "name": "定边县",
            "id": "610825"
          },
          {
            "level": 3,
            "name": "绥德县",
            "id": "610826"
          },
          {
            "level": 3,
            "name": "米脂县",
            "id": "610827"
          },
          {
            "level": 3,
            "name": "佳县",
            "id": "610828"
          },
          {
            "level": 3,
            "name": "吴堡县",
            "id": "610829"
          },
          {
            "level": 3,
            "name": "清涧县",
            "id": "610830"
          },
          {
            "level": 3,
            "name": "子洲县",
            "id": "610831"
          }
        ]
      },
      {
        "level": 2,
        "name": "安康市",
        "id": "610900",
        "childs": [
          {
            "level": 3,
            "name": "汉滨区",
            "id": "610902"
          },
          {
            "level": 3,
            "name": "汉阴县",
            "id": "610921"
          },
          {
            "level": 3,
            "name": "石泉县",
            "id": "610922"
          },
          {
            "level": 3,
            "name": "宁陕县",
            "id": "610923"
          },
          {
            "level": 3,
            "name": "紫阳县",
            "id": "610924"
          },
          {
            "level": 3,
            "name": "岚皋县",
            "id": "610925"
          },
          {
            "level": 3,
            "name": "平利县",
            "id": "610926"
          },
          {
            "level": 3,
            "name": "镇坪县",
            "id": "610927"
          },
          {
            "level": 3,
            "name": "旬阳县",
            "id": "610928"
          },
          {
            "level": 3,
            "name": "白河县",
            "id": "610929"
          }
        ]
      },
      {
        "level": 2,
        "name": "商洛市",
        "id": "611000",
        "childs": [
          {
            "level": 3,
            "name": "商州区",
            "id": "611002"
          },
          {
            "level": 3,
            "name": "洛南县",
            "id": "611021"
          },
          {
            "level": 3,
            "name": "丹凤县",
            "id": "611022"
          },
          {
            "level": 3,
            "name": "商南县",
            "id": "611023"
          },
          {
            "level": 3,
            "name": "山阳县",
            "id": "611024"
          },
          {
            "level": 3,
            "name": "镇安县",
            "id": "611025"
          },
          {
            "level": 3,
            "name": "柞水县",
            "id": "611026"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "甘肃省",
    "id": "620000",
    "childs": [
      {
        "level": 2,
        "name": "兰州市",
        "id": "620100",
        "childs": [
          {
            "level": 3,
            "name": "城关区",
            "id": "620102"
          },
          {
            "level": 3,
            "name": "七里河区",
            "id": "620103"
          },
          {
            "level": 3,
            "name": "西固区",
            "id": "620104"
          },
          {
            "level": 3,
            "name": "安宁区",
            "id": "620105"
          },
          {
            "level": 3,
            "name": "红古区",
            "id": "620111"
          },
          {
            "level": 3,
            "name": "永登县",
            "id": "620121"
          },
          {
            "level": 3,
            "name": "皋兰县",
            "id": "620122"
          },
          {
            "level": 3,
            "name": "榆中县",
            "id": "620123"
          },
          {
            "level": 3,
            "name": "兰州新区",
            "id": "620124"
          }
        ]
      },
      {
        "level": 2,
        "name": "嘉峪关市",
        "id": "620200",
        "childs": []
      },
      {
        "level": 2,
        "name": "金昌市",
        "id": "620300",
        "childs": [
          {
            "level": 3,
            "name": "金川区",
            "id": "620302"
          },
          {
            "level": 3,
            "name": "永昌县",
            "id": "620321"
          }
        ]
      },
      {
        "level": 2,
        "name": "白银市",
        "id": "620400",
        "childs": [
          {
            "level": 3,
            "name": "白银区",
            "id": "620402"
          },
          {
            "level": 3,
            "name": "平川区",
            "id": "620403"
          },
          {
            "level": 3,
            "name": "靖远县",
            "id": "620421"
          },
          {
            "level": 3,
            "name": "会宁县",
            "id": "620422"
          },
          {
            "level": 3,
            "name": "景泰县",
            "id": "620423"
          }
        ]
      },
      {
        "level": 2,
        "name": "天水市",
        "id": "620500",
        "childs": [
          {
            "level": 3,
            "name": "秦州区",
            "id": "620502"
          },
          {
            "level": 3,
            "name": "麦积区",
            "id": "620503"
          },
          {
            "level": 3,
            "name": "清水县",
            "id": "620521"
          },
          {
            "level": 3,
            "name": "秦安县",
            "id": "620522"
          },
          {
            "level": 3,
            "name": "甘谷县",
            "id": "620523"
          },
          {
            "level": 3,
            "name": "武山县",
            "id": "620524"
          },
          {
            "level": 3,
            "name": "张家川回族自治县",
            "id": "620525"
          }
        ]
      },
      {
        "level": 2,
        "name": "武威市",
        "id": "620600",
        "childs": [
          {
            "level": 3,
            "name": "凉州区",
            "id": "620602"
          },
          {
            "level": 3,
            "name": "民勤县",
            "id": "620621"
          },
          {
            "level": 3,
            "name": "古浪县",
            "id": "620622"
          },
          {
            "level": 3,
            "name": "天祝藏族自治县",
            "id": "620623"
          }
        ]
      },
      {
        "level": 2,
        "name": "张掖市",
        "id": "620700",
        "childs": [
          {
            "level": 3,
            "name": "甘州区",
            "id": "620702"
          },
          {
            "level": 3,
            "name": "肃南裕固族自治县",
            "id": "620721"
          },
          {
            "level": 3,
            "name": "民乐县",
            "id": "620722"
          },
          {
            "level": 3,
            "name": "临泽县",
            "id": "620723"
          },
          {
            "level": 3,
            "name": "高台县",
            "id": "620724"
          },
          {
            "level": 3,
            "name": "山丹县",
            "id": "620725"
          }
        ]
      },
      {
        "level": 2,
        "name": "平凉市",
        "id": "620800",
        "childs": [
          {
            "level": 3,
            "name": "崆峒区",
            "id": "620802"
          },
          {
            "level": 3,
            "name": "泾川县",
            "id": "620821"
          },
          {
            "level": 3,
            "name": "灵台县",
            "id": "620822"
          },
          {
            "level": 3,
            "name": "崇信县",
            "id": "620823"
          },
          {
            "level": 3,
            "name": "华亭县",
            "id": "620824"
          },
          {
            "level": 3,
            "name": "庄浪县",
            "id": "620825"
          },
          {
            "level": 3,
            "name": "静宁县",
            "id": "620826"
          }
        ]
      },
      {
        "level": 2,
        "name": "酒泉市",
        "id": "620900",
        "childs": [
          {
            "level": 3,
            "name": "肃州区",
            "id": "620902"
          },
          {
            "level": 3,
            "name": "金塔县",
            "id": "620921"
          },
          {
            "level": 3,
            "name": "瓜州县",
            "id": "620922"
          },
          {
            "level": 3,
            "name": "肃北蒙古族自治县",
            "id": "620923"
          },
          {
            "level": 3,
            "name": "阿克塞哈萨克族自治县",
            "id": "620924"
          },
          {
            "level": 3,
            "name": "玉门市",
            "id": "620981"
          },
          {
            "level": 3,
            "name": "敦煌市",
            "id": "620982"
          }
        ]
      },
      {
        "level": 2,
        "name": "庆阳市",
        "id": "621000",
        "childs": [
          {
            "level": 3,
            "name": "西峰区",
            "id": "621002"
          },
          {
            "level": 3,
            "name": "庆城县",
            "id": "621021"
          },
          {
            "level": 3,
            "name": "环县",
            "id": "621022"
          },
          {
            "level": 3,
            "name": "华池县",
            "id": "621023"
          },
          {
            "level": 3,
            "name": "合水县",
            "id": "621024"
          },
          {
            "level": 3,
            "name": "正宁县",
            "id": "621025"
          },
          {
            "level": 3,
            "name": "宁县",
            "id": "621026"
          },
          {
            "level": 3,
            "name": "镇原县",
            "id": "621027"
          }
        ]
      },
      {
        "level": 2,
        "name": "定西市",
        "id": "621100",
        "childs": [
          {
            "level": 3,
            "name": "安定区",
            "id": "621102"
          },
          {
            "level": 3,
            "name": "通渭县",
            "id": "621121"
          },
          {
            "level": 3,
            "name": "陇西县",
            "id": "621122"
          },
          {
            "level": 3,
            "name": "渭源县",
            "id": "621123"
          },
          {
            "level": 3,
            "name": "临洮县",
            "id": "621124"
          },
          {
            "level": 3,
            "name": "漳县",
            "id": "621125"
          },
          {
            "level": 3,
            "name": "岷县",
            "id": "621126"
          }
        ]
      },
      {
        "level": 2,
        "name": "陇南市",
        "id": "621200",
        "childs": [
          {
            "level": 3,
            "name": "武都区",
            "id": "621202"
          },
          {
            "level": 3,
            "name": "成县",
            "id": "621221"
          },
          {
            "level": 3,
            "name": "文县",
            "id": "621222"
          },
          {
            "level": 3,
            "name": "宕昌县",
            "id": "621223"
          },
          {
            "level": 3,
            "name": "康县",
            "id": "621224"
          },
          {
            "level": 3,
            "name": "西和县",
            "id": "621225"
          },
          {
            "level": 3,
            "name": "礼县",
            "id": "621226"
          },
          {
            "level": 3,
            "name": "徽县",
            "id": "621227"
          },
          {
            "level": 3,
            "name": "两当县",
            "id": "621228"
          }
        ]
      },
      {
        "level": 2,
        "name": "临夏回族自治州",
        "id": "622900",
        "childs": [
          {
            "level": 3,
            "name": "临夏市",
            "id": "622901"
          },
          {
            "level": 3,
            "name": "临夏县",
            "id": "622921"
          },
          {
            "level": 3,
            "name": "康乐县",
            "id": "622922"
          },
          {
            "level": 3,
            "name": "永靖县",
            "id": "622923"
          },
          {
            "level": 3,
            "name": "广河县",
            "id": "622924"
          },
          {
            "level": 3,
            "name": "和政县",
            "id": "622925"
          },
          {
            "level": 3,
            "name": "东乡族自治县",
            "id": "622926"
          },
          {
            "level": 3,
            "name": "积石山保安族东乡族撒拉族自治县",
            "id": "622927"
          }
        ]
      },
      {
        "level": 2,
        "name": "甘南藏族自治州",
        "id": "623000",
        "childs": [
          {
            "level": 3,
            "name": "合作市",
            "id": "623001"
          },
          {
            "level": 3,
            "name": "临潭县",
            "id": "623021"
          },
          {
            "level": 3,
            "name": "卓尼县",
            "id": "623022"
          },
          {
            "level": 3,
            "name": "舟曲县",
            "id": "623023"
          },
          {
            "level": 3,
            "name": "迭部县",
            "id": "623024"
          },
          {
            "level": 3,
            "name": "玛曲县",
            "id": "623025"
          },
          {
            "level": 3,
            "name": "碌曲县",
            "id": "623026"
          },
          {
            "level": 3,
            "name": "夏河县",
            "id": "623027"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "青海省",
    "id": "630000",
    "childs": [
      {
        "level": 2,
        "name": "西宁市",
        "id": "630100",
        "childs": [
          {
            "level": 3,
            "name": "城东区",
            "id": "630102"
          },
          {
            "level": 3,
            "name": "城中区",
            "id": "630103"
          },
          {
            "level": 3,
            "name": "城西区",
            "id": "630104"
          },
          {
            "level": 3,
            "name": "城北区",
            "id": "630105"
          },
          {
            "level": 3,
            "name": "大通回族土族自治县",
            "id": "630121"
          },
          {
            "level": 3,
            "name": "湟中县",
            "id": "630122"
          },
          {
            "level": 3,
            "name": "湟源县",
            "id": "630123"
          }
        ]
      },
      {
        "level": 2,
        "name": "海东市",
        "id": "632100",
        "childs": [
          {
            "level": 3,
            "name": "平安县",
            "id": "632121"
          },
          {
            "level": 3,
            "name": "民和回族土族自治县",
            "id": "632122"
          },
          {
            "level": 3,
            "name": "乐都区",
            "id": "632123"
          },
          {
            "level": 3,
            "name": "互助土族自治县",
            "id": "632126"
          },
          {
            "level": 3,
            "name": "化隆回族自治县",
            "id": "632127"
          },
          {
            "level": 3,
            "name": "循化撒拉族自治县",
            "id": "632128"
          }
        ]
      },
      {
        "level": 2,
        "name": "海北藏族自治州",
        "id": "632200",
        "childs": [
          {
            "level": 3,
            "name": "门源回族自治县",
            "id": "632221"
          },
          {
            "level": 3,
            "name": "祁连县",
            "id": "632222"
          },
          {
            "level": 3,
            "name": "海晏县",
            "id": "632223"
          },
          {
            "level": 3,
            "name": "刚察县",
            "id": "632224"
          }
        ]
      },
      {
        "level": 2,
        "name": "黄南藏族自治州",
        "id": "632300",
        "childs": [
          {
            "level": 3,
            "name": "同仁县",
            "id": "632321"
          },
          {
            "level": 3,
            "name": "尖扎县",
            "id": "632322"
          },
          {
            "level": 3,
            "name": "泽库县",
            "id": "632323"
          },
          {
            "level": 3,
            "name": "河南蒙古族自治县",
            "id": "632324"
          }
        ]
      },
      {
        "level": 2,
        "name": "海南藏族自治州",
        "id": "632500",
        "childs": [
          {
            "level": 3,
            "name": "共和县",
            "id": "632521"
          },
          {
            "level": 3,
            "name": "同德县",
            "id": "632522"
          },
          {
            "level": 3,
            "name": "贵德县",
            "id": "632523"
          },
          {
            "level": 3,
            "name": "兴海县",
            "id": "632524"
          },
          {
            "level": 3,
            "name": "贵南县",
            "id": "632525"
          }
        ]
      },
      {
        "level": 2,
        "name": "果洛藏族自治州",
        "id": "632600",
        "childs": [
          {
            "level": 3,
            "name": "玛沁县",
            "id": "632621"
          },
          {
            "level": 3,
            "name": "班玛县",
            "id": "632622"
          },
          {
            "level": 3,
            "name": "甘德县",
            "id": "632623"
          },
          {
            "level": 3,
            "name": "达日县",
            "id": "632624"
          },
          {
            "level": 3,
            "name": "久治县",
            "id": "632625"
          },
          {
            "level": 3,
            "name": "玛多县",
            "id": "632626"
          }
        ]
      },
      {
        "level": 2,
        "name": "玉树藏族自治州",
        "id": "632700",
        "childs": [
          {
            "level": 3,
            "name": "玉树市",
            "id": "632721"
          },
          {
            "level": 3,
            "name": "杂多县",
            "id": "632722"
          },
          {
            "level": 3,
            "name": "称多县",
            "id": "632723"
          },
          {
            "level": 3,
            "name": "治多县",
            "id": "632724"
          },
          {
            "level": 3,
            "name": "囊谦县",
            "id": "632725"
          },
          {
            "level": 3,
            "name": "曲麻莱县",
            "id": "632726"
          }
        ]
      },
      {
        "level": 2,
        "name": "海西蒙古族藏族自治州",
        "id": "632800",
        "childs": [
          {
            "level": 3,
            "name": "格尔木市",
            "id": "632801"
          },
          {
            "level": 3,
            "name": "德令哈市",
            "id": "632802"
          },
          {
            "level": 3,
            "name": "乌兰县",
            "id": "632821"
          },
          {
            "level": 3,
            "name": "都兰县",
            "id": "632822"
          },
          {
            "level": 3,
            "name": "天峻县",
            "id": "632823"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "宁夏回族自治区",
    "id": "640000",
    "childs": [
      {
        "level": 2,
        "name": "银川市",
        "id": "640100",
        "childs": [
          {
            "level": 3,
            "name": "兴庆区",
            "id": "640104"
          },
          {
            "level": 3,
            "name": "西夏区",
            "id": "640105"
          },
          {
            "level": 3,
            "name": "金凤区",
            "id": "640106"
          },
          {
            "level": 3,
            "name": "永宁县",
            "id": "640121"
          },
          {
            "level": 3,
            "name": "贺兰县",
            "id": "640122"
          },
          {
            "level": 3,
            "name": "灵武市",
            "id": "640181"
          }
        ]
      },
      {
        "level": 2,
        "name": "石嘴山市",
        "id": "640200",
        "childs": [
          {
            "level": 3,
            "name": "大武口区",
            "id": "640202"
          },
          {
            "level": 3,
            "name": "惠农区",
            "id": "640205"
          },
          {
            "level": 3,
            "name": "平罗县",
            "id": "640221"
          }
        ]
      },
      {
        "level": 2,
        "name": "吴忠市",
        "id": "640300",
        "childs": [
          {
            "level": 3,
            "name": "利通区",
            "id": "640302"
          },
          {
            "level": 3,
            "name": "红寺堡区",
            "id": "640303"
          },
          {
            "level": 3,
            "name": "盐池县",
            "id": "640323"
          },
          {
            "level": 3,
            "name": "同心县",
            "id": "640324"
          },
          {
            "level": 3,
            "name": "青铜峡市",
            "id": "640381"
          }
        ]
      },
      {
        "level": 2,
        "name": "固原市",
        "id": "640400",
        "childs": [
          {
            "level": 3,
            "name": "原州区",
            "id": "640402"
          },
          {
            "level": 3,
            "name": "西吉县",
            "id": "640422"
          },
          {
            "level": 3,
            "name": "隆德县",
            "id": "640423"
          },
          {
            "level": 3,
            "name": "泾源县",
            "id": "640424"
          },
          {
            "level": 3,
            "name": "彭阳县",
            "id": "640425"
          }
        ]
      },
      {
        "level": 2,
        "name": "中卫市",
        "id": "640500",
        "childs": [
          {
            "level": 3,
            "name": "沙坡头区",
            "id": "640502"
          },
          {
            "level": 3,
            "name": "中宁县",
            "id": "640521"
          },
          {
            "level": 3,
            "name": "海原县",
            "id": "640522"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "新疆维吾尔自治区",
    "id": "650000",
    "childs": [
      {
        "level": 2,
        "name": "乌鲁木齐市",
        "id": "650100",
        "childs": [
          {
            "level": 3,
            "name": "天山区",
            "id": "650102"
          },
          {
            "level": 3,
            "name": "沙依巴克区",
            "id": "650103"
          },
          {
            "level": 3,
            "name": "新市区",
            "id": "650104"
          },
          {
            "level": 3,
            "name": "水磨沟区",
            "id": "650105"
          },
          {
            "level": 3,
            "name": "头屯河区",
            "id": "650106"
          },
          {
            "level": 3,
            "name": "达坂城区",
            "id": "650107"
          },
          {
            "level": 3,
            "name": "东山区",
            "id": "650108"
          },
          {
            "level": 3,
            "name": "米东区",
            "id": "650109"
          },
          {
            "level": 3,
            "name": "乌鲁木齐县",
            "id": "650121"
          }
        ]
      },
      {
        "level": 2,
        "name": "克拉玛依市",
        "id": "650200",
        "childs": [
          {
            "level": 3,
            "name": "独山子区",
            "id": "650202"
          },
          {
            "level": 3,
            "name": "克拉玛依区",
            "id": "650203"
          },
          {
            "level": 3,
            "name": "白碱滩区",
            "id": "650204"
          },
          {
            "level": 3,
            "name": "乌尔禾区",
            "id": "650205"
          }
        ]
      },
      {
        "level": 2,
        "name": "吐鲁番地区",
        "id": "652100",
        "childs": [
          {
            "level": 3,
            "name": "吐鲁番市",
            "id": "652101"
          },
          {
            "level": 3,
            "name": "鄯善县",
            "id": "652122"
          },
          {
            "level": 3,
            "name": "托克逊县",
            "id": "652123"
          }
        ]
      },
      {
        "level": 2,
        "name": "哈密地区",
        "id": "652200",
        "childs": [
          {
            "level": 3,
            "name": "哈密市",
            "id": "652201"
          },
          {
            "level": 3,
            "name": "巴里坤哈萨克自治县",
            "id": "652222"
          },
          {
            "level": 3,
            "name": "伊吾县",
            "id": "652223"
          }
        ]
      },
      {
        "level": 2,
        "name": "昌吉回族自治州",
        "id": "652300",
        "childs": [
          {
            "level": 3,
            "name": "昌吉市",
            "id": "652301"
          },
          {
            "level": 3,
            "name": "阜康市",
            "id": "652302"
          },
          {
            "level": 3,
            "name": "米泉市",
            "id": "652303"
          },
          {
            "level": 3,
            "name": "呼图壁县",
            "id": "652323"
          },
          {
            "level": 3,
            "name": "玛纳斯县",
            "id": "652324"
          },
          {
            "level": 3,
            "name": "奇台县",
            "id": "652325"
          },
          {
            "level": 3,
            "name": "吉木萨尔县",
            "id": "652327"
          },
          {
            "level": 3,
            "name": "木垒哈萨克自治县",
            "id": "652328"
          }
        ]
      },
      {
        "level": 2,
        "name": "博尔塔拉蒙古自治州",
        "id": "652700",
        "childs": [
          {
            "level": 3,
            "name": "博乐市",
            "id": "652701"
          },
          {
            "level": 3,
            "name": "阿拉山口市",
            "id": "652702"
          },
          {
            "level": 3,
            "name": "精河县",
            "id": "652722"
          },
          {
            "level": 3,
            "name": "温泉县",
            "id": "652723"
          }
        ]
      },
      {
        "level": 2,
        "name": "巴音郭楞蒙古自治州",
        "id": "652800",
        "childs": [
          {
            "level": 3,
            "name": "库尔勒市",
            "id": "652801"
          },
          {
            "level": 3,
            "name": "轮台县",
            "id": "652822"
          },
          {
            "level": 3,
            "name": "尉犁县",
            "id": "652823"
          },
          {
            "level": 3,
            "name": "若羌县",
            "id": "652824"
          },
          {
            "level": 3,
            "name": "且末县",
            "id": "652825"
          },
          {
            "level": 3,
            "name": "焉耆回族自治县",
            "id": "652826"
          },
          {
            "level": 3,
            "name": "和静县",
            "id": "652827"
          },
          {
            "level": 3,
            "name": "和硕县",
            "id": "652828"
          },
          {
            "level": 3,
            "name": "博湖县",
            "id": "652829"
          }
        ]
      },
      {
        "level": 2,
        "name": "阿克苏地区",
        "id": "652900",
        "childs": [
          {
            "level": 3,
            "name": "阿克苏市",
            "id": "652901"
          },
          {
            "level": 3,
            "name": "温宿县",
            "id": "652922"
          },
          {
            "level": 3,
            "name": "库车县",
            "id": "652923"
          },
          {
            "level": 3,
            "name": "沙雅县",
            "id": "652924"
          },
          {
            "level": 3,
            "name": "新和县",
            "id": "652925"
          },
          {
            "level": 3,
            "name": "拜城县",
            "id": "652926"
          },
          {
            "level": 3,
            "name": "乌什县",
            "id": "652927"
          },
          {
            "level": 3,
            "name": "阿瓦提县",
            "id": "652928"
          },
          {
            "level": 3,
            "name": "柯坪县",
            "id": "652929"
          }
        ]
      },
      {
        "level": 2,
        "name": "克孜勒苏柯尔克孜自治州",
        "id": "653000",
        "childs": [
          {
            "level": 3,
            "name": "阿图什市",
            "id": "653001"
          },
          {
            "level": 3,
            "name": "阿克陶县",
            "id": "653022"
          },
          {
            "level": 3,
            "name": "阿合奇县",
            "id": "653023"
          },
          {
            "level": 3,
            "name": "乌恰县",
            "id": "653024"
          }
        ]
      },
      {
        "level": 2,
        "name": "喀什地区",
        "id": "653100",
        "childs": [
          {
            "level": 3,
            "name": "喀什市",
            "id": "653101"
          },
          {
            "level": 3,
            "name": "疏附县",
            "id": "653121"
          },
          {
            "level": 3,
            "name": "疏勒县",
            "id": "653122"
          },
          {
            "level": 3,
            "name": "英吉沙县",
            "id": "653123"
          },
          {
            "level": 3,
            "name": "泽普县",
            "id": "653124"
          },
          {
            "level": 3,
            "name": "莎车县",
            "id": "653125"
          },
          {
            "level": 3,
            "name": "叶城县",
            "id": "653126"
          },
          {
            "level": 3,
            "name": "麦盖提县",
            "id": "653127"
          },
          {
            "level": 3,
            "name": "岳普湖县",
            "id": "653128"
          },
          {
            "level": 3,
            "name": "伽师县",
            "id": "653129"
          },
          {
            "level": 3,
            "name": "巴楚县",
            "id": "653130"
          },
          {
            "level": 3,
            "name": "塔什库尔干塔吉克自治县",
            "id": "653131"
          }
        ]
      },
      {
        "level": 2,
        "name": "和田地区",
        "id": "653200",
        "childs": [
          {
            "level": 3,
            "name": "和田市",
            "id": "653201"
          },
          {
            "level": 3,
            "name": "和田县",
            "id": "653221"
          },
          {
            "level": 3,
            "name": "墨玉县",
            "id": "653222"
          },
          {
            "level": 3,
            "name": "皮山县",
            "id": "653223"
          },
          {
            "level": 3,
            "name": "洛浦县",
            "id": "653224"
          },
          {
            "level": 3,
            "name": "策勒县",
            "id": "653225"
          },
          {
            "level": 3,
            "name": "于田县",
            "id": "653226"
          },
          {
            "level": 3,
            "name": "民丰县",
            "id": "653227"
          }
        ]
      },
      {
        "level": 2,
        "name": "伊犁哈萨克自治州",
        "id": "654000",
        "childs": [
          {
            "level": 3,
            "name": "伊宁市",
            "id": "654002"
          },
          {
            "level": 3,
            "name": "奎屯市",
            "id": "654003"
          },
          {
            "level": 3,
            "name": "伊宁县",
            "id": "654021"
          },
          {
            "level": 3,
            "name": "察布查尔锡伯自治县",
            "id": "654022"
          },
          {
            "level": 3,
            "name": "霍城县",
            "id": "654023"
          },
          {
            "level": 3,
            "name": "巩留县",
            "id": "654024"
          },
          {
            "level": 3,
            "name": "新源县",
            "id": "654025"
          },
          {
            "level": 3,
            "name": "昭苏县",
            "id": "654026"
          },
          {
            "level": 3,
            "name": "特克斯县",
            "id": "654027"
          },
          {
            "level": 3,
            "name": "尼勒克县",
            "id": "654028"
          }
        ]
      },
      {
        "level": 2,
        "name": "塔城地区",
        "id": "654200",
        "childs": [
          {
            "level": 3,
            "name": "塔城市",
            "id": "654201"
          },
          {
            "level": 3,
            "name": "乌苏市",
            "id": "654202"
          },
          {
            "level": 3,
            "name": "额敏县",
            "id": "654221"
          },
          {
            "level": 3,
            "name": "沙湾县",
            "id": "654223"
          },
          {
            "level": 3,
            "name": "托里县",
            "id": "654224"
          },
          {
            "level": 3,
            "name": "裕民县",
            "id": "654225"
          },
          {
            "level": 3,
            "name": "和布克赛尔蒙古自治县",
            "id": "654226"
          }
        ]
      },
      {
        "level": 2,
        "name": "阿勒泰地区",
        "id": "654300",
        "childs": [
          {
            "level": 3,
            "name": "阿勒泰市",
            "id": "654301"
          },
          {
            "level": 3,
            "name": "布尔津县",
            "id": "654321"
          },
          {
            "level": 3,
            "name": "富蕴县",
            "id": "654322"
          },
          {
            "level": 3,
            "name": "福海县",
            "id": "654323"
          },
          {
            "level": 3,
            "name": "哈巴河县",
            "id": "654324"
          },
          {
            "level": 3,
            "name": "青河县",
            "id": "654325"
          },
          {
            "level": 3,
            "name": "吉木乃县",
            "id": "654326"
          }
        ]
      },
      {
        "level": 2,
        "name": "石河子市",
        "id": "659001",
        "childs": []
      },
      {
        "level": 2,
        "name": "阿拉尔市",
        "id": "659002",
        "childs": []
      },
      {
        "level": 2,
        "name": "图木舒克市",
        "id": "659003",
        "childs": []
      },
      {
        "level": 2,
        "name": "五家渠市",
        "id": "659004",
        "childs": []
      }
    ]
  },
  {
    "level": 1,
    "name": "香港特别行政区",
    "id": "810000",
    "childs": [
      {
        "level": 2,
        "name": "香港岛",
        "id": "810100",
        "childs": [
          {
            "level": 3,
            "name": "中西区",
            "id": "810101"
          },
          {
            "level": 3,
            "name": "湾仔",
            "id": "810102"
          },
          {
            "level": 3,
            "name": "东区",
            "id": "810103"
          },
          {
            "level": 3,
            "name": "南区",
            "id": "810104"
          }
        ]
      },
      {
        "level": 2,
        "name": "九龙",
        "id": "810200",
        "childs": [
          {
            "level": 3,
            "name": "九龙城区",
            "id": "810201"
          },
          {
            "level": 3,
            "name": "油尖旺区",
            "id": "810202"
          },
          {
            "level": 3,
            "name": "深水埗区",
            "id": "810203"
          },
          {
            "level": 3,
            "name": "黄大仙区",
            "id": "810204"
          },
          {
            "level": 3,
            "name": "观塘区",
            "id": "810205"
          }
        ]
      },
      {
        "level": 2,
        "name": "新界",
        "id": "810300",
        "childs": [
          {
            "level": 3,
            "name": "北区",
            "id": "810301"
          },
          {
            "level": 3,
            "name": "大埔区",
            "id": "810302"
          },
          {
            "level": 3,
            "name": "沙田区",
            "id": "810303"
          },
          {
            "level": 3,
            "name": "西贡区",
            "id": "810304"
          },
          {
            "level": 3,
            "name": "元朗区",
            "id": "810305"
          },
          {
            "level": 3,
            "name": "屯门区",
            "id": "810306"
          },
          {
            "level": 3,
            "name": "荃湾区",
            "id": "810307"
          },
          {
            "level": 3,
            "name": "葵青区",
            "id": "810308"
          },
          {
            "level": 3,
            "name": "离岛区",
            "id": "810309"
          }
        ]
      }
    ]
  },
  {
    "level": 1,
    "name": "澳门特别行政区",
    "id": "820000",
    "childs": [
      {
        "level": 2,
        "name": "澳门半岛",
        "id": "820100",
        "childs": [
          {
            "level": 3,
            "name": "花地玛堂区",
            "id": "820101"
          },
          {
            "level": 3,
            "name": "圣安多尼堂区",
            "id": "820102"
          },
          {
            "level": 3,
            "name": "望德堂区",
            "id": "820103"
          },
          {
            "level": 3,
            "name": "大堂区",
            "id": "820104"
          },
          {
            "level": 3,
            "name": "风顺堂区",
            "id": "820105"
          }
        ]
      },
      {
        "level": 2,
        "name": "路环岛",
        "id": "820300",
        "childs": []
      },
      {
        "level": 2,
        "name": "凼仔岛",
        "id": "820400",
        "childs": []
      }
    ]
  },
  {
    "level": 1,
    "name": "台湾省",
    "id": "830000",
    "childs": [
      {
        "level": 2,
        "name": "台北市",
        "id": "830100",
        "childs": [
          {
            "level": 3,
            "name": "中正区",
            "id": "830101"
          },
          {
            "level": 3,
            "name": "大同区",
            "id": "830102"
          },
          {
            "level": 3,
            "name": "中山区",
            "id": "830103"
          },
          {
            "level": 3,
            "name": "松山区",
            "id": "830104"
          },
          {
            "level": 3,
            "name": "大安区",
            "id": "830105"
          },
          {
            "level": 3,
            "name": "万华区",
            "id": "830106"
          },
          {
            "level": 3,
            "name": "信义区",
            "id": "830107"
          },
          {
            "level": 3,
            "name": "士林区",
            "id": "830108"
          },
          {
            "level": 3,
            "name": "北投区",
            "id": "830109"
          },
          {
            "level": 3,
            "name": "内湖区",
            "id": "830110"
          },
          {
            "level": 3,
            "name": "南港区",
            "id": "830111"
          },
          {
            "level": 3,
            "name": "文山区",
            "id": "830112"
          }
        ]
      },
      {
        "level": 2,
        "name": "高雄市",
        "id": "830200",
        "childs": [
          {
            "level": 3,
            "name": "新兴区",
            "id": "830201"
          },
          {
            "level": 3,
            "name": "前金区",
            "id": "830202"
          },
          {
            "level": 3,
            "name": "芩雅区",
            "id": "830203"
          },
          {
            "level": 3,
            "name": "盐埕区",
            "id": "830204"
          },
          {
            "level": 3,
            "name": "鼓山区",
            "id": "830205"
          },
          {
            "level": 3,
            "name": "旗津区",
            "id": "830206"
          },
          {
            "level": 3,
            "name": "前镇区",
            "id": "830207"
          },
          {
            "level": 3,
            "name": "三民区",
            "id": "830208"
          },
          {
            "level": 3,
            "name": "左营区",
            "id": "830209"
          },
          {
            "level": 3,
            "name": "楠梓区",
            "id": "830210"
          },
          {
            "level": 3,
            "name": "小港区",
            "id": "830211"
          },
          {
            "level": 3,
            "name": "凤山区",
            "id": "830212"
          },
          {
            "level": 3,
            "name": "冈山区",
            "id": "830213"
          },
          {
            "level": 3,
            "name": "旗山区",
            "id": "830214"
          },
          {
            "level": 3,
            "name": "美浓区",
            "id": "830215"
          },
          {
            "level": 3,
            "name": "仁武区",
            "id": "830216"
          },
          {
            "level": 3,
            "name": "大社区",
            "id": "830217"
          },
          {
            "level": 3,
            "name": "路竹区",
            "id": "830218"
          },
          {
            "level": 3,
            "name": "阿莲区",
            "id": "830219"
          },
          {
            "level": 3,
            "name": "田寮区",
            "id": "830220"
          },
          {
            "level": 3,
            "name": "燕巢区",
            "id": "830221"
          },
          {
            "level": 3,
            "name": "桥头区",
            "id": "830222"
          },
          {
            "level": 3,
            "name": "梓官区",
            "id": "830223"
          },
          {
            "level": 3,
            "name": "弥陀区",
            "id": "830224"
          },
          {
            "level": 3,
            "name": "永安区",
            "id": "830225"
          },
          {
            "level": 3,
            "name": "湖内区",
            "id": "830226"
          },
          {
            "level": 3,
            "name": "大寮区",
            "id": "830227"
          },
          {
            "level": 3,
            "name": "林园区",
            "id": "830228"
          },
          {
            "level": 3,
            "name": "鸟松区",
            "id": "830229"
          },
          {
            "level": 3,
            "name": "大树区",
            "id": "830230"
          },
          {
            "level": 3,
            "name": "六龟区",
            "id": "830231"
          },
          {
            "level": 3,
            "name": "内门区",
            "id": "830232"
          },
          {
            "level": 3,
            "name": "杉林区",
            "id": "830233"
          },
          {
            "level": 3,
            "name": "甲仙区",
            "id": "830234"
          },
          {
            "level": 3,
            "name": "桃源区",
            "id": "830235"
          },
          {
            "level": 3,
            "name": "那玛夏区",
            "id": "830236"
          },
          {
            "level": 3,
            "name": "茂林区",
            "id": "830237"
          },
          {
            "level": 3,
            "name": "茄萣区",
            "id": "830238"
          }
        ]
      },
      {
        "level": 2,
        "name": "台南市",
        "id": "830300",
        "childs": [
          {
            "level": 3,
            "name": "中西区",
            "id": "830301"
          },
          {
            "level": 3,
            "name": "东区",
            "id": "830302"
          },
          {
            "level": 3,
            "name": "南区",
            "id": "830303"
          },
          {
            "level": 3,
            "name": "北区",
            "id": "830304"
          },
          {
            "level": 3,
            "name": "安平区",
            "id": "830305"
          },
          {
            "level": 3,
            "name": "安南区",
            "id": "830306"
          },
          {
            "level": 3,
            "name": "新营区",
            "id": "830307"
          },
          {
            "level": 3,
            "name": "永康区",
            "id": "830308"
          },
          {
            "level": 3,
            "name": "新化区",
            "id": "830309"
          },
          {
            "level": 3,
            "name": "麻豆区",
            "id": "830310"
          },
          {
            "level": 3,
            "name": "佳里区",
            "id": "830311"
          },
          {
            "level": 3,
            "name": "学甲区",
            "id": "830312"
          },
          {
            "level": 3,
            "name": "白河区",
            "id": "830313"
          },
          {
            "level": 3,
            "name": "盐水区",
            "id": "830314"
          },
          {
            "level": 3,
            "name": "善化区",
            "id": "830315"
          },
          {
            "level": 3,
            "name": "归仁区",
            "id": "830316"
          },
          {
            "level": 3,
            "name": "左镇区",
            "id": "830317"
          },
          {
            "level": 3,
            "name": "玉井区",
            "id": "830318"
          },
          {
            "level": 3,
            "name": "楠西区",
            "id": "830319"
          },
          {
            "level": 3,
            "name": "南化区",
            "id": "830320"
          },
          {
            "level": 3,
            "name": "仁德区",
            "id": "830321"
          },
          {
            "level": 3,
            "name": "关庙区",
            "id": "830322"
          },
          {
            "level": 3,
            "name": "龙崎市",
            "id": "830323"
          },
          {
            "level": 3,
            "name": "官田区",
            "id": "830324"
          },
          {
            "level": 3,
            "name": "西港区",
            "id": "830325"
          },
          {
            "level": 3,
            "name": "七股区",
            "id": "830326"
          },
          {
            "level": 3,
            "name": "将军区",
            "id": "830327"
          },
          {
            "level": 3,
            "name": "北门区",
            "id": "830328"
          },
          {
            "level": 3,
            "name": "後壁区",
            "id": "830329"
          },
          {
            "level": 3,
            "name": "东山区",
            "id": "830330"
          },
          {
            "level": 3,
            "name": "六甲区",
            "id": "830331"
          },
          {
            "level": 3,
            "name": "下营区",
            "id": "830332"
          },
          {
            "level": 3,
            "name": "柳营区",
            "id": "830333"
          },
          {
            "level": 3,
            "name": "大内区",
            "id": "830334"
          },
          {
            "level": 3,
            "name": "山上区",
            "id": "830335"
          },
          {
            "level": 3,
            "name": "新市区",
            "id": "830336"
          },
          {
            "level": 3,
            "name": "安定区",
            "id": "830337"
          }
        ]
      },
      {
        "level": 2,
        "name": "台中市",
        "id": "830400",
        "childs": [
          {
            "level": 3,
            "name": "中区",
            "id": "830401"
          },
          {
            "level": 3,
            "name": "东区",
            "id": "830402"
          },
          {
            "level": 3,
            "name": "南区",
            "id": "830403"
          },
          {
            "level": 3,
            "name": "西区",
            "id": "830404"
          },
          {
            "level": 3,
            "name": "北区",
            "id": "830405"
          },
          {
            "level": 3,
            "name": "北屯区",
            "id": "830406"
          },
          {
            "level": 3,
            "name": "西屯区",
            "id": "830407"
          },
          {
            "level": 3,
            "name": "南屯区",
            "id": "830408"
          }
        ]
      },
      {
        "level": 2,
        "name": "南投县",
        "id": "830500",
        "childs": []
      },
      {
        "level": 2,
        "name": "基隆市",
        "id": "830600",
        "childs": [
          {
            "level": 3,
            "name": "仁爱区",
            "id": "830601"
          },
          {
            "level": 3,
            "name": "信义区",
            "id": "830602"
          },
          {
            "level": 3,
            "name": "中正区",
            "id": "830603"
          },
          {
            "level": 3,
            "name": "中山区",
            "id": "830604"
          },
          {
            "level": 3,
            "name": "安乐区",
            "id": "830605"
          },
          {
            "level": 3,
            "name": "暖暖区",
            "id": "830606"
          },
          {
            "level": 3,
            "name": "七堵区",
            "id": "830607"
          }
        ]
      },
      {
        "level": 2,
        "name": "新竹市",
        "id": "830700",
        "childs": [
          {
            "level": 3,
            "name": "香山区",
            "id": "830701"
          },
          {
            "level": 3,
            "name": "北区",
            "id": "830702"
          },
          {
            "level": 3,
            "name": "东区",
            "id": "830703"
          }
        ]
      },
      {
        "level": 2,
        "name": "嘉义市",
        "id": "830800",
        "childs": [
          {
            "level": 3,
            "name": "东区",
            "id": "830801"
          },
          {
            "level": 3,
            "name": "西区",
            "id": "830802"
          }
        ]
      },
      {
        "level": 2,
        "name": "宜兰县",
        "id": "830900",
        "childs": [
          {
            "level": 3,
            "name": "宜兰市",
            "id": "830901"
          },
          {
            "level": 3,
            "name": "头城镇",
            "id": "830902"
          },
          {
            "level": 3,
            "name": "罗东镇",
            "id": "830903"
          },
          {
            "level": 3,
            "name": "苏澳镇",
            "id": "830904"
          },
          {
            "level": 3,
            "name": "礁溪乡",
            "id": "830905"
          },
          {
            "level": 3,
            "name": "壮围乡",
            "id": "830906"
          },
          {
            "level": 3,
            "name": "员山乡",
            "id": "830907"
          },
          {
            "level": 3,
            "name": "三星乡",
            "id": "830908"
          },
          {
            "level": 3,
            "name": "大同乡",
            "id": "830909"
          },
          {
            "level": 3,
            "name": "五结乡",
            "id": "830910"
          },
          {
            "level": 3,
            "name": "冬山乡",
            "id": "830911"
          },
          {
            "level": 3,
            "name": "南澳乡",
            "id": "830912"
          }
        ]
      },
      {
        "level": 2,
        "name": "新竹县",
        "id": "831000",
        "childs": [
          {
            "level": 3,
            "name": "竹北市",
            "id": "831001"
          },
          {
            "level": 3,
            "name": "新埔镇",
            "id": "831002"
          },
          {
            "level": 3,
            "name": "关西镇",
            "id": "831003"
          },
          {
            "level": 3,
            "name": "竹东镇",
            "id": "831004"
          },
          {
            "level": 3,
            "name": "湖口乡",
            "id": "831005"
          },
          {
            "level": 3,
            "name": "新丰乡",
            "id": "831006"
          },
          {
            "level": 3,
            "name": "芎林乡",
            "id": "831007"
          },
          {
            "level": 3,
            "name": "宝山乡",
            "id": "831008"
          },
          {
            "level": 3,
            "name": "五峰乡",
            "id": "831009"
          },
          {
            "level": 3,
            "name": "横山乡",
            "id": "831010"
          },
          {
            "level": 3,
            "name": "尖石乡",
            "id": "831011"
          },
          {
            "level": 3,
            "name": "北埔乡",
            "id": "831012"
          },
          {
            "level": 3,
            "name": "峨眉乡",
            "id": "831013"
          }
        ]
      },
      {
        "level": 2,
        "name": "桃园县",
        "id": "831100",
        "childs": [
          {
            "level": 3,
            "name": "中坜市",
            "id": "831102"
          },
          {
            "level": 3,
            "name": "平镇市",
            "id": "831103"
          },
          {
            "level": 3,
            "name": "八德市",
            "id": "831104"
          },
          {
            "level": 3,
            "name": "杨梅镇",
            "id": "831105"
          },
          {
            "level": 3,
            "name": "大溪镇",
            "id": "831106"
          },
          {
            "level": 3,
            "name": "龙潭乡",
            "id": "831107"
          },
          {
            "level": 3,
            "name": "新屋乡",
            "id": "831108"
          },
          {
            "level": 3,
            "name": "观音乡",
            "id": "831109"
          },
          {
            "level": 3,
            "name": "龟山乡",
            "id": "831110"
          },
          {
            "level": 3,
            "name": "复兴乡",
            "id": "831111"
          },
          {
            "level": 3,
            "name": "大园乡",
            "id": "831112"
          },
          {
            "level": 3,
            "name": "芦竹乡",
            "id": "831113"
          },
          {
            "level": 3,
            "name": "桃园市",
            "id": "831114"
          }
        ]
      },
      {
        "level": 2,
        "name": "苗栗县",
        "id": "831200",
        "childs": [
          {
            "level": 3,
            "name": "苗栗市",
            "id": "831201"
          },
          {
            "level": 3,
            "name": "竹南镇",
            "id": "831202"
          },
          {
            "level": 3,
            "name": "头份镇",
            "id": "831203"
          },
          {
            "level": 3,
            "name": "後龙镇",
            "id": "831204"
          },
          {
            "level": 3,
            "name": "通霄镇",
            "id": "831205"
          },
          {
            "level": 3,
            "name": "苑裡镇",
            "id": "831206"
          },
          {
            "level": 3,
            "name": "卓兰镇",
            "id": "831207"
          },
          {
            "level": 3,
            "name": "三湾乡",
            "id": "831208"
          },
          {
            "level": 3,
            "name": "南庄乡",
            "id": "831209"
          },
          {
            "level": 3,
            "name": "狮潭乡",
            "id": "831210"
          },
          {
            "level": 3,
            "name": "造桥乡",
            "id": "831211"
          },
          {
            "level": 3,
            "name": "头屋乡",
            "id": "831212"
          },
          {
            "level": 3,
            "name": "公馆乡",
            "id": "831213"
          },
          {
            "level": 3,
            "name": "大湖乡",
            "id": "831214"
          },
          {
            "level": 3,
            "name": "泰安乡",
            "id": "831215"
          },
          {
            "level": 3,
            "name": "铜锣乡",
            "id": "831216"
          },
          {
            "level": 3,
            "name": "三义乡",
            "id": "831217"
          },
          {
            "level": 3,
            "name": "西湖乡",
            "id": "831218"
          }
        ]
      },
      {
        "level": 2,
        "name": "彰化县",
        "id": "831300",
        "childs": [
          {
            "level": 3,
            "name": "彰化市",
            "id": "831301"
          },
          {
            "level": 3,
            "name": "鹿港镇",
            "id": "831302"
          },
          {
            "level": 3,
            "name": "和美镇",
            "id": "831303"
          },
          {
            "level": 3,
            "name": "员林镇",
            "id": "831304"
          },
          {
            "level": 3,
            "name": "溪湖镇",
            "id": "831305"
          },
          {
            "level": 3,
            "name": "田中镇",
            "id": "831306"
          },
          {
            "level": 3,
            "name": "北斗镇",
            "id": "831307"
          },
          {
            "level": 3,
            "name": "二林镇",
            "id": "831308"
          },
          {
            "level": 3,
            "name": "芬园乡",
            "id": "831309"
          },
          {
            "level": 3,
            "name": "花坛乡",
            "id": "831310"
          },
          {
            "level": 3,
            "name": "秀水乡",
            "id": "831311"
          },
          {
            "level": 3,
            "name": "福兴乡",
            "id": "831312"
          },
          {
            "level": 3,
            "name": "线西乡",
            "id": "831313"
          },
          {
            "level": 3,
            "name": "伸港乡",
            "id": "831314"
          },
          {
            "level": 3,
            "name": "社头乡",
            "id": "831315"
          },
          {
            "level": 3,
            "name": "永靖乡",
            "id": "831316"
          },
          {
            "level": 3,
            "name": "埔心乡",
            "id": "831317"
          },
          {
            "level": 3,
            "name": "大村乡",
            "id": "831318"
          }
        ]
      },
      {
        "level": 2,
        "name": "嘉义县",
        "id": "831400",
        "childs": [
          {
            "level": 3,
            "name": "太保市",
            "id": "831401"
          },
          {
            "level": 3,
            "name": "朴子市",
            "id": "831402"
          },
          {
            "level": 3,
            "name": "大林镇",
            "id": "831403"
          },
          {
            "level": 3,
            "name": "布袋镇",
            "id": "831404"
          },
          {
            "level": 3,
            "name": "番路乡",
            "id": "831405"
          },
          {
            "level": 3,
            "name": "梅山乡",
            "id": "831406"
          },
          {
            "level": 3,
            "name": "竹崎乡",
            "id": "831407"
          },
          {
            "level": 3,
            "name": "阿里山乡",
            "id": "831408"
          },
          {
            "level": 3,
            "name": "中埔乡",
            "id": "831409"
          },
          {
            "level": 3,
            "name": "大埔乡",
            "id": "831410"
          },
          {
            "level": 3,
            "name": "水上乡",
            "id": "831411"
          },
          {
            "level": 3,
            "name": "鹿草乡",
            "id": "831412"
          },
          {
            "level": 3,
            "name": "东石乡",
            "id": "831413"
          },
          {
            "level": 3,
            "name": "六脚乡",
            "id": "831414"
          },
          {
            "level": 3,
            "name": "新港乡",
            "id": "831415"
          },
          {
            "level": 3,
            "name": "民雄乡",
            "id": "831416"
          },
          {
            "level": 3,
            "name": "溪口乡",
            "id": "831417"
          },
          {
            "level": 3,
            "name": "义竹乡",
            "id": "831418"
          }
        ]
      },
      {
        "level": 2,
        "name": "云林县",
        "id": "831500",
        "childs": [
          {
            "level": 3,
            "name": "斗六市",
            "id": "831501"
          },
          {
            "level": 3,
            "name": "斗南镇",
            "id": "831502"
          },
          {
            "level": 3,
            "name": "虎尾镇",
            "id": "831503"
          },
          {
            "level": 3,
            "name": "土库镇",
            "id": "831504"
          },
          {
            "level": 3,
            "name": "西螺镇",
            "id": "831505"
          },
          {
            "level": 3,
            "name": "北港镇",
            "id": "831506"
          },
          {
            "level": 3,
            "name": "大埤乡",
            "id": "831507"
          },
          {
            "level": 3,
            "name": "褒忠乡",
            "id": "831508"
          },
          {
            "level": 3,
            "name": "东势乡",
            "id": "831509"
          },
          {
            "level": 3,
            "name": "台西乡",
            "id": "831510"
          },
          {
            "level": 3,
            "name": "崙背乡",
            "id": "831511"
          },
          {
            "level": 3,
            "name": "麦寮乡",
            "id": "831512"
          },
          {
            "level": 3,
            "name": "林内乡",
            "id": "831513"
          },
          {
            "level": 3,
            "name": "古坑乡",
            "id": "831514"
          },
          {
            "level": 3,
            "name": "莿桐乡",
            "id": "831515"
          },
          {
            "level": 3,
            "name": "二崙乡",
            "id": "831516"
          },
          {
            "level": 3,
            "name": "水林乡",
            "id": "831517"
          },
          {
            "level": 3,
            "name": "口湖乡",
            "id": "831518"
          },
          {
            "level": 3,
            "name": "四湖乡",
            "id": "831519"
          },
          {
            "level": 3,
            "name": "元长乡",
            "id": "831520"
          }
        ]
      },
      {
        "level": 2,
        "name": "屏东县",
        "id": "831600",
        "childs": [
          {
            "level": 3,
            "name": "屏东市",
            "id": "831601"
          },
          {
            "level": 3,
            "name": "潮州镇",
            "id": "831602"
          },
          {
            "level": 3,
            "name": "东港镇",
            "id": "831603"
          },
          {
            "level": 3,
            "name": "恒春镇",
            "id": "831604"
          },
          {
            "level": 3,
            "name": "三地乡",
            "id": "831605"
          },
          {
            "level": 3,
            "name": "雾臺乡",
            "id": "831606"
          },
          {
            "level": 3,
            "name": "玛家乡",
            "id": "831607"
          },
          {
            "level": 3,
            "name": "九如乡",
            "id": "831608"
          },
          {
            "level": 3,
            "name": "里港乡",
            "id": "831609"
          },
          {
            "level": 3,
            "name": "高树乡",
            "id": "831610"
          },
          {
            "level": 3,
            "name": "盐埔乡",
            "id": "831611"
          },
          {
            "level": 3,
            "name": "长治乡",
            "id": "831612"
          },
          {
            "level": 3,
            "name": "麟洛乡",
            "id": "831613"
          },
          {
            "level": 3,
            "name": "竹田乡",
            "id": "831614"
          },
          {
            "level": 3,
            "name": "内埔乡",
            "id": "831615"
          },
          {
            "level": 3,
            "name": "万丹乡",
            "id": "831616"
          },
          {
            "level": 3,
            "name": "泰武乡",
            "id": "831617"
          },
          {
            "level": 3,
            "name": "来义乡",
            "id": "831618"
          },
          {
            "level": 3,
            "name": "万峦乡",
            "id": "831619"
          },
          {
            "level": 3,
            "name": "嵌顶乡",
            "id": "831620"
          },
          {
            "level": 3,
            "name": "新埤乡",
            "id": "831621"
          },
          {
            "level": 3,
            "name": "南州乡",
            "id": "831622"
          },
          {
            "level": 3,
            "name": "林边乡",
            "id": "831623"
          },
          {
            "level": 3,
            "name": "琉球乡",
            "id": "831624"
          },
          {
            "level": 3,
            "name": "佳冬乡",
            "id": "831625"
          },
          {
            "level": 3,
            "name": "新园乡",
            "id": "831626"
          },
          {
            "level": 3,
            "name": "枋寮乡",
            "id": "831627"
          },
          {
            "level": 3,
            "name": "枋山乡",
            "id": "831628"
          },
          {
            "level": 3,
            "name": "春日乡",
            "id": "831629"
          },
          {
            "level": 3,
            "name": "狮子乡",
            "id": "831630"
          },
          {
            "level": 3,
            "name": "车城乡",
            "id": "831631"
          },
          {
            "level": 3,
            "name": "牡丹乡",
            "id": "831632"
          },
          {
            "level": 3,
            "name": "满州乡",
            "id": "831633"
          }
        ]
      },
      {
        "level": 2,
        "name": "台东县",
        "id": "831700",
        "childs": [
          {
            "level": 3,
            "name": "台东市",
            "id": "831701"
          },
          {
            "level": 3,
            "name": "关山镇",
            "id": "831702"
          },
          {
            "level": 3,
            "name": "成功镇",
            "id": "831703"
          },
          {
            "level": 3,
            "name": "绿岛乡",
            "id": "831704"
          },
          {
            "level": 3,
            "name": "兰屿乡",
            "id": "831705"
          },
          {
            "level": 3,
            "name": "延平乡",
            "id": "831706"
          },
          {
            "level": 3,
            "name": "卑南乡",
            "id": "831707"
          },
          {
            "level": 3,
            "name": "鹿野乡",
            "id": "831708"
          },
          {
            "level": 3,
            "name": "海端乡",
            "id": "831709"
          },
          {
            "level": 3,
            "name": "池上乡",
            "id": "831710"
          },
          {
            "level": 3,
            "name": "东河乡",
            "id": "831711"
          },
          {
            "level": 3,
            "name": "长滨乡",
            "id": "831712"
          },
          {
            "level": 3,
            "name": "太麻里乡",
            "id": "831713"
          },
          {
            "level": 3,
            "name": "金峰乡",
            "id": "831714"
          },
          {
            "level": 3,
            "name": "大武乡",
            "id": "831715"
          },
          {
            "level": 3,
            "name": "达仁乡",
            "id": "831716"
          }
        ]
      },
      {
        "level": 2,
        "name": "花莲县",
        "id": "831800",
        "childs": [
          {
            "level": 3,
            "name": "花莲市",
            "id": "831801"
          },
          {
            "level": 3,
            "name": "凤林镇",
            "id": "831802"
          },
          {
            "level": 3,
            "name": "玉里镇",
            "id": "831803"
          },
          {
            "level": 3,
            "name": "新城乡",
            "id": "831804"
          },
          {
            "level": 3,
            "name": "秀林乡",
            "id": "831805"
          },
          {
            "level": 3,
            "name": "吉安乡",
            "id": "831806"
          },
          {
            "level": 3,
            "name": "寿丰乡",
            "id": "831807"
          },
          {
            "level": 3,
            "name": "光复乡",
            "id": "831808"
          },
          {
            "level": 3,
            "name": "丰滨乡",
            "id": "831809"
          },
          {
            "level": 3,
            "name": "瑞穗乡",
            "id": "831810"
          },
          {
            "level": 3,
            "name": "万荣乡",
            "id": "831811"
          },
          {
            "level": 3,
            "name": "卓溪乡",
            "id": "831812"
          },
          {
            "level": 3,
            "name": "富里乡",
            "id": "831813"
          }
        ]
      },
      {
        "level": 2,
        "name": "澎湖县",
        "id": "831900",
        "childs": [
          {
            "level": 3,
            "name": "马公市",
            "id": "831901"
          },
          {
            "level": 3,
            "name": "西屿乡",
            "id": "831902"
          },
          {
            "level": 3,
            "name": "望安乡",
            "id": "831903"
          },
          {
            "level": 3,
            "name": "七美乡",
            "id": "831904"
          },
          {
            "level": 3,
            "name": "白沙乡",
            "id": "831905"
          },
          {
            "level": 3,
            "name": "湖西乡",
            "id": "831906"
          }
        ]
      },
      {
        "level": 2,
        "name": "新北市",
        "id": "832000",
        "childs": [
          {
            "level": 3,
            "name": "板桥市",
            "id": "832001"
          },
          {
            "level": 3,
            "name": "汐止市",
            "id": "832002"
          },
          {
            "level": 3,
            "name": "新店市",
            "id": "832003"
          },
          {
            "level": 3,
            "name": "永和市",
            "id": "832004"
          },
          {
            "level": 3,
            "name": "中和市",
            "id": "832005"
          },
          {
            "level": 3,
            "name": "土城市",
            "id": "832006"
          },
          {
            "level": 3,
            "name": "树林市",
            "id": "832007"
          },
          {
            "level": 3,
            "name": "三重市",
            "id": "832008"
          },
          {
            "level": 3,
            "name": "新庄市",
            "id": "832009"
          },
          {
            "level": 3,
            "name": "芦洲市",
            "id": "832010"
          },
          {
            "level": 3,
            "name": "瑞芳镇",
            "id": "832011"
          },
          {
            "level": 3,
            "name": "三峡镇",
            "id": "832012"
          },
          {
            "level": 3,
            "name": "莺歌镇",
            "id": "832013"
          },
          {
            "level": 3,
            "name": "淡水镇",
            "id": "832014"
          },
          {
            "level": 3,
            "name": "万里乡",
            "id": "832015"
          },
          {
            "level": 3,
            "name": "金山乡",
            "id": "832016"
          },
          {
            "level": 3,
            "name": "深坑乡",
            "id": "832017"
          },
          {
            "level": 3,
            "name": "石碇乡",
            "id": "832018"
          },
          {
            "level": 3,
            "name": "平溪乡",
            "id": "832019"
          },
          {
            "level": 3,
            "name": "双溪乡",
            "id": "832020"
          },
          {
            "level": 3,
            "name": "贡寮乡",
            "id": "832021"
          },
          {
            "level": 3,
            "name": "坪林乡",
            "id": "832022"
          },
          {
            "level": 3,
            "name": "乌来乡",
            "id": "832023"
          },
          {
            "level": 3,
            "name": "泰山乡",
            "id": "832024"
          },
          {
            "level": 3,
            "name": "林口乡",
            "id": "832025"
          },
          {
            "level": 3,
            "name": "五股乡",
            "id": "832026"
          },
          {
            "level": 3,
            "name": "八里乡",
            "id": "832027"
          },
          {
            "level": 3,
            "name": "三芝乡",
            "id": "832028"
          },
          {
            "level": 3,
            "name": "石门乡",
            "id": "832029"
          }
        ]
      },
      {
        "level": 2,
        "name": "台中县",
        "id": "832100",
        "childs": [
          {
            "level": 3,
            "name": "丰原市",
            "id": "832101"
          },
          {
            "level": 3,
            "name": "太平市",
            "id": "832102"
          },
          {
            "level": 3,
            "name": "大里市",
            "id": "832103"
          },
          {
            "level": 3,
            "name": "东势镇",
            "id": "832104"
          },
          {
            "level": 3,
            "name": "沙鹿镇",
            "id": "832105"
          },
          {
            "level": 3,
            "name": "梧栖镇",
            "id": "832106"
          },
          {
            "level": 3,
            "name": "清水镇",
            "id": "832107"
          },
          {
            "level": 3,
            "name": "大甲镇",
            "id": "832108"
          },
          {
            "level": 3,
            "name": "雾峰乡",
            "id": "832109"
          },
          {
            "level": 3,
            "name": "乌日乡",
            "id": "832110"
          },
          {
            "level": 3,
            "name": "后里乡",
            "id": "832111"
          },
          {
            "level": 3,
            "name": "石冈乡",
            "id": "832112"
          },
          {
            "level": 3,
            "name": "和平乡",
            "id": "832113"
          },
          {
            "level": 3,
            "name": "新社乡",
            "id": "832114"
          },
          {
            "level": 3,
            "name": "潭子乡",
            "id": "832115"
          },
          {
            "level": 3,
            "name": "大雅乡",
            "id": "832116"
          },
          {
            "level": 3,
            "name": "神冈乡",
            "id": "832117"
          },
          {
            "level": 3,
            "name": "大肚乡",
            "id": "832118"
          },
          {
            "level": 3,
            "name": "龙井乡",
            "id": "832119"
          },
          {
            "level": 3,
            "name": "外埔乡",
            "id": "832120"
          },
          {
            "level": 3,
            "name": "大安乡",
            "id": "832121"
          }
        ]
      },
      {
        "level": 2,
        "name": "连江县",
        "id": "832200",
        "childs": [
          {
            "level": 3,
            "name": "南竿乡",
            "id": "832201"
          },
          {
            "level": 3,
            "name": "北竿乡",
            "id": "832202"
          },
          {
            "level": 3,
            "name": "莒光乡",
            "id": "832203"
          },
          {
            "level": 3,
            "name": "东引乡",
            "id": "832204"
          }
        ]
      }
    ]
  }
]

module.exports = {
  area: area
}